[
    {
        "id": "cc10f91b-1ccf-406a-9228-0b357db7481f",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/cc10f91b-1ccf-406a-9228-0b357db7481f",
        "created_at": "Wed Feb 12 20:10:31 UTC 2020",
        "company": "PolicyStat RLDatix",
        "company_url": "https://rldatix.com/en-us/products/policy-management",
        "location": "Indianapolis, IN",
        "title": "Python + Django Software Engineer",
        "description": "<h1>Make An Impact On Healthcare</h1>\n<p><a href=\"https://rldatix.com/en-us/products/policy-management\">PolicyStat's</a> mission is to improve healthcare delivery through better processes. We help our clients make their policies and procedures easier to find, access, and manage. Hundreds of hospitals use our SaaS application to ensure that this critical information is correct, their staff can find it, and that it supports regulatory compliance.</p>\n<p><a href=\"https://hub.jhu.edu/2016/05/03/medical-errors-third-leading-cause-of-death/\">More than 250,000 Americans die each year as a result of medical error</a>. Many of these deaths could have been prevented with existing best practices for quality and patient safety. A hospital's best tool for standardizing and implementing these life-saving improvements are their written policies and procedures.</p>\n<h1>Python + Django Software Engineer</h1>\n<p><strong>ON-SITE</strong>: Indianapolis, IN or Toronto, Canada</p>\n<p><strong>REMOTE</strong>: Indiana, New Jersey, and other locations</p>\n<p>As a critical member of our small product team, you'll assume several roles including back-end and front-end development, on-call support, API design, architecture, operations and database engineering.</p>\n<h2>Technical Requirements</h2>\n<ul>\n<li>Demonstrated proficiency with Python and Django</li>\n<li>Demonstrated understanding of Linux, Git, JavaScript, CSS and HTML5</li>\n</ul>\n<h2>Cultural Requirements</h2>\n<ul>\n<li>Ability to work effectively and collaborate on a small team.</li>\n<li>Excellent communication skills and strong teamwork ethic.</li>\n<li>Passion and enthusiasm for creating amazing products and delivering unparalleled user experience.</li>\n<li>Strongly motivated by opportunities to positively impact the direction of the company and products.</li>\n</ul>\n<h2>Responsibilities</h2>\n<ul>\n<li>Serve in the weekly rotation for triage of escalated support questions and server alerts.</li>\n<li>Take initiative to address pain points that you and/or the team experience by working to improve the software, tools or processes of PolicyStat.</li>\n<li>Review code contributed by the team and get it ready for production.</li>\n<li>Design, develop, document, and write automated tests for new features.</li>\n<li>Proactively analyze, diagnose, and resolve software regressions.</li>\n<li>Write well designed, testable, efficient code.</li>\n</ul>\n<h2>Highly Desired Skills</h2>\n<ul>\n<li>Demonstrated proficiency with React, GraphQL, MySQL, IPSec, SAML.</li>\n<li>A GitHub profile with lots of code and experience contributing to open source projects.</li>\n</ul>\n<h2>Compensation and Benefits</h2>\n<ul>\n<li>Market-based salary from $80k to $110k+ USD</li>\n<li>Health (including telemedicine) with HSA, dental, vision, disability, and life insurance</li>\n<li>10 paid holidays</li>\n<li>PTO: 15 days each year to start; 20 days starting the calendar year of third anniversary</li>\n<li>Annual paid team trip to engineering conference (Djangocon, pycon, etc)</li>\n<li>(on-site) Weekly catered team lunches</li>\n</ul>\n<h1>About PolicyStat</h1>\n<ul>\n<li>Founded in 2006, <a href=\"https://www.prnewswire.com/news-releases/rldatix-to-acquire-icontracts-300848612.html\">acquired</a> by <a href=\"https://www.rldatix.com\">RLDatix</a> in 2019.</li>\n<li>Technology stack: Python 3.7, Django 2.2, AWS (RDS, EC2, S3), Ubuntu Linux, MySQL, GraphQL, React (work in progress)</li>\n<li>Toolkit: Git, Vagrant, VirtualBox, Trello, <a href=\"https://github.com/PolicyStat\">GitHub</a>, Jenkins, continuous delivery / daily deploys (1000 in 2019), fast iterations</li>\n<li>See our <a href=\"https://stackoverflow.com/jobs/companies/policystat\">Stack Overflow Company</a> page</li>\n</ul>\n<h1>Apply</h1>\n<h2>Interview Process</h2>\n<ul>\n<li>Application review.</li>\n<li>Complete a <a href=\"https://medium.com/policystat-product-development/why-all-jobs-interviews-should-include-doing-real-work-34b54d393939\">work sample</a> (&lt; 60 minutes) in Python.</li>\n<li>Phone or video conversation with the team lead (&lt; 30 minutes).</li>\n<li>Complete a work sample (&lt; 3 hours) in Python + Django.</li>\n<li>Culture conversation with team members (on-site, if possible, otherwise remote video conference).</li>\n</ul>\n<p><a href=\"../interview_process.md\">See more details</a></p>\n<h2>Remote Locations</h2>\n<p>We can hire individuals for full time employment who reside in\nCalifornia, Texas, Massachusetts, South Carolina, Florida, Pennsylvania, Illinois, Idaho, Indiana, Kentucky, Michigan, Missouri, New Jersey, New Mexico, Washington or some parts of Canada.\n<strong>If you reside in some other location, we can only pay you through a company</strong>.\nIf you have not already created a company\n(one that is responsible for taxes and can legally receive payments),\nyou will either need to create one,\nor alternatively we can hire you through a service such as\n<a href=\"https://upwork.com\">Upwork</a>.</p>\n<p><a href=\"http://bit.ly/pstat-jobs-python-django-engineer-2020-apply-github\">Click here to apply (Google Form)</a></p>\n",
        "how_to_apply": "<p><a href=\"http://bit.ly/pstat-jobs-python-django-engineer-2020-apply-github\">http://bit.ly/pstat-jobs-python-django-engineer-2020-apply-github</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc1YrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--bf59a414f124093d99f8a1fee3e69e7170bfd7ca/PolicyStat_Print_Full-Color-iContracts-v2.png"
    },
    {
        "id": "e88f3540-77d4-4559-ad3d-9d59f2f824d7",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/e88f3540-77d4-4559-ad3d-9d59f2f824d7",
        "created_at": "Wed Feb 12 16:59:07 UTC 2020",
        "company": "Toptal",
        "company_url": "https://topt.al/KAcqXg",
        "location": "Remote",
        "title": "React Native Developer – Remote",
        "description": "<p>Are you interested in a lucrative career as a freelance developer? With freelancing on the rise, thousands of developers worldwide are changing the way they work, from full-time employment to full-time remote freelancing. At Toptal, you’ll find remote freelance opportunities with leading global companies, on your terms.</p>\n<p>Unlike a regular nine-to-five job or, more often what can feel like a nine-to-nine job, working with Toptal means choosing your own projects from the world’s leading organizations, on your own hours and at the rate you decide. Our robust screening process helps ensure that you won’t have to bid against other freelancers and can maintain a steady stream of work. It’s the type of work/life balance that empowers you to travel the world, or stay at home. You’re in control of shaping your environment to however you work best while establishing yourself as an elite developer.</p>\n<p>To learn more from Toptalers that made it big through freelancing, check out the following article: <a href=\"https://topt.al/5jcRrP\">https://topt.al/5jcRrP</a></p>\n<p>Developers in our elite network share:</p>\n<ul>\n<li>English language proficiency</li>\n<li>3+ years of professional experience</li>\n<li>Project management skills</li>\n<li>A keen attention to detail</li>\n</ul>\n<p>Note: We are looking for talent who are able to freelance on a full time basis.\nIf you’re interested in joining the Toptal network, take the next step by clicking on the following link and completing the short form: <a href=\"https://topt.al/xRcxRa\">https://topt.al/xRcxRa</a></p>\n",
        "how_to_apply": "<p>If you’re interested in joining the Toptal network, take the next step by clicking on the following link and completing the short form:\n<a href=\"https://topt.al/xRcxRa\">https://topt.al/xRcxRa</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBclIrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e8054a405b41ec30724e2c62f68aaa53e71b6c76/Toptal%20Logo%20Main%20Colors-RGB.jpg"
    },
    {
        "id": "677e6c8d-5880-4784-bf28-fc37d1b3ce11",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/677e6c8d-5880-4784-bf28-fc37d1b3ce11",
        "created_at": "Wed Feb 12 15:10:10 UTC 2020",
        "company": "CGM France",
        "company_url": "https://www.cgm.com/de/index.de.jsp",
        "location": "Nanterre",
        "title": "Architecte logiciel e-Santé",
        "description": "<h2><strong>En tant que Architecte Logiciel e-Santé confirmé vous êtes acteur de la eSanté!</strong></h2>\n<p>Nous sommes des pionniers de la santé numérique et passionnés par le développement et l’implémentation de nouvelles technologies. Pour poursuivre notre croissance, nous recherchons des Collaborateurs engagés et dynamiques qui s’épanouiront au sein de nos équipes tout en poursuivant leur projet professionnel.</p>\n<h2><strong>Vous contribuerez à notre succès en:</strong></h2>\n<p>Rattaché(e) au Responsable Développement, vous interviendrez dans les équipes de développement de Produit (\"feature team\") qui assurent la maintenance et l’évolution de nos logiciels dans un cadre Agile Scrum.\nVotre rôle se décline sur les axes suivants :</p>\n<ul>\n<li>Réalisation d'études d'impact sur le SI suite à des demandes de changements fonctionnels, sur un mode agile</li>\n<li>Design de la solution en amont, dans le respect de la cible d'architecture du SI en transformation dont vous alimentez la construction</li>\n<li>Référent auprès des développeurs sur les normes de développement et les outils de la forge logicielle que vous contribuez à soutenir et améliorer</li>\n<li>Implémentations des sujets techniques complexes, des services d'entreprise et des frameworks nécessaires aux développeurs</li>\n<li>Accompagnement sur le projet pour porter et cadrer les sujets techniques dans la roadmap fonctionnelle</li>\n</ul>\n<h2><strong>Nous attendons de vous:</strong></h2>\n<ul>\n<li>Expérience significative dans un poste de développement, dans une équipe à taille humaine et dans un contexte international et multiculturel</li>\n<li>Capacité à prendre de la hauteur et à travailler de façon constructive avec les analystes fonctionnels (MOA Produit), le Scrum Master et le manager</li>\n<li>Capacité à gérer plusieurs sujets en parallèle</li>\n<li>Capacité à expliquer la solution technique et accompagner les développeurs dans son implémentation</li>\n<li>Capacité à avancer par itérations et baby-steps</li>\n<li>Autonome, organisé et méthodique</li>\n<li>Créatif, Constructif et orienté-résultats</li>\n<li>Sens des responsabilités, facilitateur et engagé à aider les équipes à atteindre leurs objectif</li>\n<li>Niveau expert en langage de programmation .NET C#(Client lourds, Web Services, ASP.NET, .NET Core) et expérimenté en JS (Angular ou REACT)</li>\n<li>Maîtrise des concepts et connaissance des outils d'une forge logicielle orientée CI/CD (Jira, Git/Gitflow, Gital-CI, Azure Devops, Jenkins, etc…)</li>\n<li>Expérience sur la gestion et l'évolution d'un système legacy</li>\n<li>Maîtrise des pratiques d'architecture services/micro-services et des conteneurs</li>\n<li>Capacité à prototyper et itérer sur la définition de la solution</li>\n<li>Expérience souhaitée sur des outils et méthodologies orientés tests (TDD, BDD)</li>\n<li>Français et Anglais courant</li>\n<li>Parfaite maîtrise des outils bureautiques classiques (Mail, Internet, Excel, Word, Visio …)</li>\n</ul>\n<h2><strong>Nous vous offrons:</strong></h2>\n<ul>\n<li>Votre environnement de travail est agréable, moderne et dynamique</li>\n<li>Vous rejoignez un groupe international de 5000 personnes, avec de réelles opportunités de carrière en France et à l’étranger</li>\n<li>Vous participez au futur de la e-santé, en rejoignant un acteur majeur de ce secteur</li>\n</ul>\n<p>Nous sommes impatients de recevoir votre candidature ainsi que vos prétentions salariales.</p>\n<p><a href=\"https://compugroupmedical.redirect.your-jobresponse.com/architecte_logiciel_e_sante_nanterre/263747/V819/apply\">Cliquez ici pour accéder au formulaire de candidature!</a></p>\n<p><strong>Synchronizing Healthcare</strong></p>\n<p><strong>Rejoignez-nous!</strong></p>\n<p><strong>Référence:</strong>\nreq3362</p>\n<p><strong>Lieu:</strong>\nMontpellier</p>\n<p><strong>Domaine:</strong>\nSoftware Development</p>\n<p><strong>Contact:</strong>\n<a href=\"mailto:career@cgm.com\">career@cgm.com</a></p>\n<p>T +33 (0) 147 162 679</p>\n<ul>\n<li>Groupe international leader dans la eSanté</li>\n<li>Plus de 717 Million d’Euros de CA en 2018</li>\n<li>Environ 5 000 employés dans le monde</li>\n<li>Une base Client unique de plus de 1 million d’Utilisateurs</li>\n<li>Nos équipes sont présentes dans 19 pays et ont des Clients dans 55 pays</li>\n<li>Plus de 30 d’expérience</li>\n</ul>\n",
        "how_to_apply": "<p><a href=\"https://compugroupmedical.redirect.your-jobresponse.com/architecte_logiciel_e_sante_nanterre/263747/V819/apply\">Cliquez ici pour accéder au formulaire de candidature!</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcWwrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cb2606e35ea1388f296d20b53950223f242d7fb9/Compugroup%20logo.jpeg"
    },
    {
        "id": "8b49f1bd-27af-4464-9d90-96b501cfe718",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/8b49f1bd-27af-4464-9d90-96b501cfe718",
        "created_at": "Wed Feb 12 08:47:12 UTC 2020",
        "company": "Virail GmbH",
        "company_url": "https://www.virail.com/",
        "location": "BERLIN",
        "title": "Frontend Engineer - UX (m /w / d)",
        "description": "<h1>What we do</h1>\n<p>Virail is a travel transportation portal with customers across more than 30 countries. Every year we help more than 60 million users find the perfect solution for their trip. Our comparison tool works with more than 2000 transportation companies and lets you find the optimal travel solutions, no matter your needs.</p>\n<p>Who we are We’re a team of seasoned industry professionals with experience in major firms including Google, Trivago, Facile.it, Smava, Jimdo and Happycar, now on a quest to make travel easier and faster for everyone.</p>\n<h1>Your tasks</h1>\n<p>You will join a cross-functional team consisting of engineering and product professionals. Our team is in charge of improving the virail web application with the goal to provide the best travel solution possible for our users.</p>\n<p>You will be the owner of UX on the engineering side. You will focus on shaping our web frontend by creating new exciting features and providing A/B testing capabilities, although there are of course touch points with the backend side. When the need occurs you will work together with product in the conception phase by implementing prototypes as well as including your own creative ideas to make our platform exciting. Our vision is to create a culture of experimentation which unlocks the creative potential of the entire company and you will be a core contributor to this new culture.</p>\n<h1>Must have</h1>\n<ul>\n<li>3+ years of Javascript development and React library.</li>\n<li>2+ years experience with PHP development.</li>\n<li>Very good understanding of frontend technologies.</li>\n<li>Good knowledge of CSS, SCSS, SASS.</li>\n<li>Experience with UX best-practices (especially on mobile) and A/B testing.</li>\n<li>Familiar with MVC pattern based software development.</li>\n<li>Experience with API implementation.</li>\n<li>Loves to work with Unix environments (we use Debian internally).</li>\n<li>Good communication in English.</li>\n</ul>\n<h1>Nice-to-have</h1>\n<ul>\n<li>Experience with SQL/Postgres.</li>\n<li>Contribution to the open source community.</li>\n<li>Experience with Vue.js</li>\n</ul>\n<h1>Your mindset</h1>\n<p>You like to work independently and being the owner of your tasks. Of course you won’t be left alone and your peers will support you any time. You have an agile mindset and support the idea of self-managed teams. We offer</p>\n<ul>\n<li>Prime office location in the heart of Berlin. Free coffee and snacks.</li>\n<li>Open remote work policy and flexible working hours.</li>\n<li>Unrestricted freedom to apply your ideas to a fast growing business.</li>\n<li>Mentorship from seasoned industry veterans.</li>\n<li>Competitive salary.</li>\n</ul>\n<p>Interested?\nSend an email to <a href=\"mailto:jobs@virail.com\">jobs@virail.com</a></p>\n",
        "how_to_apply": "<p>Send an email to <a href=\"mailto:jobs@virail.com\">jobs@virail.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbmQrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7a0653f18d124e7ab8fbdd914c19be1d685538c2/virail%20logo.jpg"
    },
    {
        "id": "a1ab6d2f-ec9b-48de-b6b8-03146ea3ac2c",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/a1ab6d2f-ec9b-48de-b6b8-03146ea3ac2c",
        "created_at": "Tue Feb 11 17:37:20 UTC 2020",
        "company": "Last Call Media",
        "company_url": "http://www.lastcallmedia.com",
        "location": "Remote",
        "title": "PHP Engineer (Remote)",
        "description": "<p>Last Call Media is looking for a well rounded PHP developer to join our team!</p>\n<p><strong>The Role</strong></p>\n<p>Last Call Media is looking for someone who understands just how flexible the PHP programming language can be, and enjoys, neh, is proud that the majority of the internet uses the PHP language.</p>\n<p>The ideal candidate will have experience in PHP frameworks such as WordPress, Symfony, Drupal, CodeIgniter but also has been involved with big single PHP files with inline CSS/HTML/(My)SQL/PHP. Last Call Media is looking for an advocate of best practices and someone who is willing to be opinionated about what they believe in when it comes to building successful programming projects.</p>\n<p>Last Call Media is a fully distributed company so you can work from anywhere, but we ask that you be able to commit to at least 5 hours of overlap with New York time (ET), Monday through Friday.</p>\n<p><strong>What you’ll do:</strong></p>\n<ul>\n<li>Review and analyze existing PHP sites for ways to improve and/or provide advice on how to migrate off antiquated monolith systems. Implement analyses from start to finish.</li>\n<li>Work with clients to communicate how and why existing PHP code works or doesn’t.</li>\n<li>Create and maintain product roadmaps, feature backlogs and product documentation, and user stories.</li>\n<li>Understand who the end user of a project is and how to build and/or suggest front-end interfaces to help them accomplish their tasks as simply and practically as possible.</li>\n<li>Participate in team and company retrospectives to help define and refine working agreements and processes to help us work more effectively together as a team.</li>\n</ul>\n<p><strong>What you’ll bring:</strong></p>\n<ul>\n<li>A proven track record of leading the delivery of digital products and services that delight customers.</li>\n<li>3+ years of similar experience in a digital agency, consultancy, or equivalent setting where you were accountable to several client engagements.</li>\n<li>An obvious drive to grow and learn from the highly-skilled team around you</li>\n<li>Experience with large-scale open source web technologies (such as Drupal, WordPress, and React).</li>\n<li>Experience and/or a desire to work remotely.</li>\n<li>Ability to work efficiently, sometimes under tight deadlines</li>\n</ul>\n<p><strong>It’d be nice if you also had:</strong></p>\n<ul>\n<li>Front-end framework experience like ReactJS/AngularJS/VueJS</li>\n<li>Relational database experience and understanding of how to improve DB performance</li>\n<li>Server administration and/or setups like Apache/NodeJS/Nginx and a general comfortability in the Linux environment</li>\n<li>Familiarity with Atlassian tools, such as Jira and Confluence.</li>\n</ul>\n<p><strong>All of us at LCM pride ourselves on being:</strong></p>\n<ul>\n<li>Able to empathize, which helps us understand the need of the client, the customer, the product, and the team at LCM.</li>\n<li>Highly communicative</li>\n<li>Able to work independently</li>\n<li>Comfortable asking for help</li>\n<li>Experienced with communicating directly with clients</li>\n<li>Eager and motivated to learn new concepts</li>\n<li>A team player in a collaborative environment</li>\n<li>A fast learner</li>\n</ul>\n<p><strong>Application Process</strong></p>\n<p>Applicants should submit through the careers section a current resume and cover letter that includes links to a few digital products you completed recently and an answer to the following question: In 3-5 sentences please share a little about what, in your opinion, the biggest challenges are working at an all remote company. If you haven’t worked for an all remote company, please try and answer the question anyway! Lastly, while resumes and interviews are a great way to learn more about you, all candidates should be prepared to complete a brief hypothetical virtual recruitment exercise and submit reference(s) upon request.</p>\n<p>To apply visit: <a href=\"https://lastcallmedia.com/careers\">https://lastcallmedia.com/careers</a></p>\n<p>This position is compensated at a salary commensurate with skill and experience, with comprehensive benefits including an annual professional development budget, and varied, engaging work for enterprise-level clients. If this position already sounds like you or sounds like where you're headed, please reach out! Applicants should submit a current resume and cover letter through the careers section and should be prepared to submit a code sample(s) and reference(s) upon request.</p>\n",
        "how_to_apply": "<p>To apply visit: <a href=\"https://lastcallmedia.freshteam.com/jobs/sMPI2WIGv6Dl/php-engineer-remote\">https://lastcallmedia.freshteam.com/jobs/sMPI2WIGv6Dl/php-engineer-remote</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbXgrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8335d8a37becbfe0d0dbca605c721b510c5895ee/LCM_Secondary_Logo_Red_RGB.png"
    },
    {
        "id": "60d06501-244b-4e0d-9dd8-0caa71685111",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/60d06501-244b-4e0d-9dd8-0caa71685111",
        "created_at": "Mon Feb 10 19:55:03 UTC 2020",
        "company": "Kite",
        "company_url": "http://kite.com",
        "location": "San Francisco",
        "title": "Software Engineer, Developer Tools",
        "description": "<p><em>“I really love the line-of-code completions in the new kite.com.” — Guido van Rossum, creator of Python</em></p>\n<p>Programmers spend too much time doing repetitive work — copying and pasting from StackOverflow, fixing simple errors, and writing boilerplate code. We're building an AI code engine that does this work for you. Programming using Kite is faster and more fun.</p>\n<p>Kite is well-funded by top investors in Silicon Valley, including the founders of PayPal, Stripe, Palantir, and Dropbox to name a few. We are looking to expand our 15-person startup with talented individuals who are interested in joining an early stage startup. The ideal candidate is excited to help guide the direction of our product and company. They will have a significant amount of ownership of critical technical components. Our team is growing rapidly and we hope you'll grow with us too!</p>\n<p><strong>What you’ll do:</strong></p>\n<ul>\n<li>Wear many hats, work with multiple components in different parts of the stack</li>\n<li>Define, develop and perform performance/scalability benchmarks for the Kite app</li>\n<li>Utilize various profiling tools to identify performance and concurrency bottleneck, propose and implement optimizations to improve the Kite product</li>\n<li>Contribute to the development of core product features and initiatives</li>\n<li>Collaborate with the product team on improving the user experience of the Copilot, website and editor plugins</li>\n</ul>\n<p><strong>What you’ve done:</strong></p>\n<ul>\n<li>A track record of working in small teams to build new software from scratch</li>\n<li>Experience building complex software outside of frameworks or existing infrastructure</li>\n<li>Ability to learn and evaluate new technologies quickly</li>\n<li>Experience taking ownership of projects and delivering results</li>\n<li>Experience with backend and/or frontend technologies (e.g Go/Java/C++, Javascript/Nodejs/React)</li>\n<li>Worked with multiple platforms (Windows, Linux, macOS)</li>\n<li>Nice to have: Experience with Go, native client software, and/or DevOps</li>\n</ul>\n<p><strong>Who you are:</strong></p>\n<ul>\n<li>Bachelor’s Degree in Computer Science or related field</li>\n<li>Minimum of 3+ years of engineering experience</li>\n<li>Experience building reliable and scalable systems</li>\n<li>Ability to work daily from our San Francisco office (wonderful office in the bustling Financial District area)</li>\n<li>Excited to work on a small, growing team in a startup environment</li>\n</ul>\n",
        "how_to_apply": "<p><a href=\"https://jobs.lever.co/kite\">Apply Here</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa3grIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0b893cf00d6c1a5c5f93ef77a357a9492665d804/%2311182F%20-%20dark%20navy%202x%20Twitter%20Logo.png"
    },
    {
        "id": "7b7d433d-caf3-4b1b-9cf1-e4c25d560a53",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/7b7d433d-caf3-4b1b-9cf1-e4c25d560a53",
        "created_at": "Fri Feb 07 18:03:55 UTC 2020",
        "company": "Fundera",
        "company_url": "https://www.fundera.com/",
        "location": "New York",
        "title": "Senior Software Engineer",
        "description": "<p>Fundera</p>\n<p>Here’s the thing—we hate traditional job descriptions. In our experience, they’re a terrible representation of what a job really entails and never paint a true picture of what it’s like to work at an organization.</p>\n<p>That’s why, at Fundera, we do things differently. Instead of presenting you with some run-of-the-mill job description, we offer potential candidates our Job Spotlights. This gives us a chance to tell you the story of us, why you should work here, and what the role is really like.</p>\n<p>Who’s Fundera and Why Should I Care?</p>\n<p>Fundera is the go-to financial resource for small businesses. We’re here to help entrepreneurs achieve their financial goals and grow businesses as big as their aspirations.</p>\n<p>As a catalyst for smart financial decisions, our combination of proprietary technology and financial expertise provides business owners with tailored solutions based on their unique needs and eligibility—helping them prosper, create more jobs, and, ultimately, grow the economy.</p>\n<p>Armed with one of the most experienced and passionate leadership teams in the business and backed by the industry’s leading investors, we’ve made a big impact on Main Street in just a short amount of time (Fundera launched in 2014 and has helped 35,000+ small businesses find their best financial solutions and secure over $1 billion in funding).</p>\n<p>We’re experiencing massive growth year over year, and our impact on America’s job creators grows with us. We’re looking to further our impact and need incredible, ambitious, mission-oriented people to get there.</p>\n<p>If you want to make a difference, if you want to create a workplace and life you love, and if you want to learn more and grow faster than you will at any other point in your career, you should keep reading.</p>\n<p>What Is It Like to Work Here?</p>\n<p>The easiest way to answer this is to check out our great rating on Glassdoor, take a deep dive into a few of our employee profiles, or look into some of our recent awards, like Crain’s Best Places to Work. Also, don’t forget to peep our Instagram.</p>\n<p>For more detail, though, here are a few of our favorite things:</p>\n<ol>\n<li>We want people who elevate the game - and offer meaningful equity in our fast-growing company to compensate for top performers.</li>\n<li>We offer generous medical, dental, and vision insurance—you shouldn’t have to stress about your health. (And less stress makes you healthier, right?!)</li>\n<li>Yes, your Fundera family is very important, but yours at home matters most. That’s why we offer incredibly generous maternity and paternity leave, have a family-friendly office, and love nothing more than seeing our Fundera kiddos at company events and socials.</li>\n<li>Everybody needs a little R&amp;R—but we want our team to have more than just a little. You’ll get flexible PTO and we mean legitimately flexible PTO.</li>\n<li>We sponsor regular catered lunches with really cool speakers (like the founders of Birchbox, CityRow, and Percolate). We also regularly host company happy hours, and other events such as employee-led trivia and visits to customers. It’s important to bring our team together as much as possible.</li>\n<li>Transparency is what our product is built on—and so is our culture. Whether that means regular all-hands meetings, board decks circulated every month, or a highly accessible leadership team, we’re all stakeholders in this company and never forget that.</li>\n</ol>\n<p>Ultimately, at Fundera, you get to come to work with a group of supportive, talented, ambitious individuals who will teach you something new every day, whilst building a product that will truly and actually change the lives of America’s small businesses and job creators. We think it’s pretty cool, and think you will, too.</p>\n<p>Is This Role Right for Me?</p>\n<p>Our Senior Software Engineer will join a team of engineers that are curious, humble, and can hop in and tackle a wide range of projects. We aim to build systems that are reliable and simple, user experiences that are beautiful and frictionless, and internal tools that help us all do our jobs better. If you’re interested in the position, here are a few things you’ll get to do and the qualifications that will make you successful in this role.</p>\n<p>As our Senior Software Engineer, You’ll Get to...</p>\n<p>Contribute ideas for projects to drive the team forward.</p>\n<ul>\n<li>Develop new features that surprise and delight our users.</li>\n<li>Work up and down the stack, from schema changes to front end javascript in the same day.</li>\n<li>Work with product managers and designers to build a well-rounded product.</li>\n<li>Measure and graph your features so we can know how something is performing.</li>\n<li>Constantly be learning from teammates, as well as sharing any knowledge and skills you have with\nothers.</li>\n<li>Create with empathy - always considering the end user and be an advocate for their experience.</li>\n</ul>\n<p>We’re Looking for People Who Have...</p>\n<ul>\n<li>5+ years of real world experience.</li>\n<li>Some familiarity with Fundera’s current stack or similar technologies: Rails, React, AWS, Postgres,\nDocker, CircleCI, StatsD, InfluxDB, Grafana.</li>\n<li>Proficiency in Unix environments.</li>\n<li>Experience working with web systems.</li>\n<li>Excellent interpersonal skills.</li>\n<li>A passion for helping small businesses.</li>\n</ul>\n<p>What Should I Do If I’m Interested?</p>\n<p>If working at Fundera gets you excited, we want to hear from you, regardless of whether you think this role is a fit. If you think you’ve got the relevant experience, apply below to be our Senior Software Engineer.</p>\n",
        "how_to_apply": "<p>Please apply at this link and reference Github <a href=\"https://jobs.lever.co/fundera/7133b9e4-36bf-4bad-90f2-abe18f1a342f\">https://jobs.lever.co/fundera/7133b9e4-36bf-4bad-90f2-abe18f1a342f</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUorIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--576683b0f1523f1d4662c695312c920cabcbd9bf/logo%20wordmark@4x.png"
    },
    {
        "id": "9847705a-14d3-475a-9c7b-1624a5cd84f8",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/9847705a-14d3-475a-9c7b-1624a5cd84f8",
        "created_at": "Thu Feb 06 18:51:56 UTC 2020",
        "company": "Tynker",
        "company_url": "http://www.tynker.com",
        "location": "Mountain View",
        "title": "Front-End Web Developer",
        "description": "<p>We are looking for a full-stack developer who has a strong command of web development including Angular, CSS3, HTML5, Javascript, cross-browser development techniques and has a passion for building pixel-perfect, clean and elegant code. You will work with a team of developers building tools and frameworks used by millions of K-12 students to learn to code. While frameworks are great, you should have no problems building your own or hacking existing ones.</p>\n<p>Tynker is the #1 Kids Coding platform and helps millions of students learn coding. Our self-paced courses and creativity tools guide them from block coding to JavaScript, Swift and and Python. Tynker’s mission is to provide every child with solid foundations in STEM, programming and critical thinking skills to prepare them to become better architects of their future world. Join a dynamic team of developers to come up with new and stimulating ways to engage young coders to get creative with code!</p>\n<p>Primary Tasks:</p>\n<ul>\n<li>Create awesome web experiences for young coders</li>\n<li>Transform design comps made by creative leads to functional web applications</li>\n<li>Create scalable cloud backend software that handles millions of users</li>\n<li>Iterate and improve experiences periodically based on feedback</li>\n</ul>\n<p>Requirements:</p>\n<ul>\n<li>BS/MS degree in Computer Science</li>\n<li>5+ years of professional experience building and maintaining large sites (50+ pages)</li>\n<li>Full grasp of HTML, CSS, JavaScript, and AJAX-based JSON/XML web services</li>\n<li>Should be proficient using frameworks like Angular, React, Foundation or Bootstrap</li>\n<li>Must be comfortable with using PHP, Mongo, and other back-end technologies</li>\n<li>Ability to debug cross-browser/cross-domain issues</li>\n<li>Solid foundation creating cross-browser and responsive web experiences and understand the nuances of supporting tablet and mobile browsers</li>\n<li>Must be able to quickly adapt and learn to work within an unfamiliar codebase</li>\n<li>Must be familiar with various design and architectural patterns</li>\n<li>Demonstrated ability to be self-driven and work with minimal supervision</li>\n<li>Experience creating APIs and RESTful web services is preferred</li>\n<li>Strong object oriented fundamentals with prior experience in Java or C++ is a plus</li>\n</ul>\n",
        "how_to_apply": "<p>Email your resume and cover letter to <a href=\"mailto:jobs@tynker.com\">jobs@tynker.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ3ArIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d3a83fbb4d89ef700a492ec3a4965e36fc099ea1/tynker-200x200.png"
    },
    {
        "id": "34c96fab-15a0-440a-870d-78963c5c3715",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/34c96fab-15a0-440a-870d-78963c5c3715",
        "created_at": "Tue Feb 04 16:57:43 UTC 2020",
        "company": "Dancor Solutions",
        "company_url": "https://dancorsolutions.com/",
        "location": "Columbus, OH",
        "title": "Backend PHP Developer (experience required)",
        "description": "<p><strong>Job Description:</strong></p>\n<p>Dancor Solutions is looking for a talented PHP developer / web developer / software developer with solid experience; someone who can write clean, tight code and thrives in a small team environment.</p>\n<p>This is a full-time position in which the ideal client should be able to come up with innovative ideas leading to solutions for our clients in a timely manner. They should be able to learn new skills as needed, and be able to balance several projects concurrently. The ideal candidate will possess the technical skills to handle the workload as well as the social skills to effectively communicate in an extremely fluid, team-based environment.</p>\n<p>At Dancor Solutions, we pride ourselves on working quickly and efficiently with quality as one cohesive team, and the candidate should be able to keep a calm head and a positive attitude in fast-paced situations.</p>\n<p><strong>Company Description:</strong></p>\n<p>Dancor Solutions’ technology division focuses on creating and developing unique web and SaaS applications for desktop, tablet, and mobile devices for our large existing client base of Fortune 100 companies. We are a team-oriented small company where each team member collaborates on innovative and creative projects, and has the opportunity to make a great deal of impact on final projects. Our company culture is an energetic, fun, flexible, creative, and open environment.</p>\n<p><strong>Top Reasons to Work With Us:</strong></p>\n<ul>\n<li>We’re passionate about building customized solutions that help our clients and their associates thrive</li>\n<li>Start-up environment in long-standing, fast-growing company</li>\n<li>Collaborative team environment that’s open to and encourages new ideas</li>\n<li>A casual, open work environment</li>\n<li>Work in a fun, energetic company culture</li>\n</ul>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Proficient with PHP. Multiple-language candidates preferred</li>\n<li>Proficient with Object Oriented PHP and/or MVC including Laravel</li>\n<li>Proficient with MySQL, Queries and Data Construction</li>\n<li>Proficient with MS Office Suite, including Excel, Word</li>\n<li>Proficient understanding of web markup, including HTML5, CSS3</li>\n<li>Proficient understanding of client-side scripting and JavaScript frameworks, including jQuery</li>\n<li>Basic understanding of advanced JavaScript libraries and frameworks, such as ReactJS, Gulp, Webpack</li>\n<li>Basic understanding of server-side CSS pre-processing platforms, such as LESS and SASS</li>\n<li>Solid understanding of asynchronous request handling, partial page updates, and AJAX</li>\n<li>Proficient understanding of cross-browser compatibility issues and ways to work around them</li>\n<li>Proficient understanding of code versioning tools, such as Git and SVN</li>\n</ul>\n<p><strong>You are:</strong></p>\n<ul>\n<li>A self-motivated individual that is able to work and collaborate in a small team environment with minimal supervision</li>\n<li>Someone who has a commitment to coding standards, documentation, and best practices</li>\n<li>Excited about and have the desire to learn new technologies</li>\n<li>Passionate about using open source tools and frameworks - a follower of PHP standard recommendations</li>\n<li>Able to develop new features based on client requirements</li>\n<li>Able build reusable code and libraries for future use</li>\n<li>Someone who assures that all user input is validated and sanitized</li>\n</ul>\n<p><strong>This is an on-site position and relocation assistance is not provided.</strong></p>\n",
        "how_to_apply": "<p>Email your resume to <a href=\"mailto:careers@dancorsolutions.com\">careers@dancorsolutions.com</a></p>\n<p>This is an on-site position (Columbus, OH) and relocation assistance is not provided.</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc2w5IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--15bfe0371630f8582f34d2497f67e82c25f1fc17/0.png"
    },
    {
        "id": "abddd671-8641-455d-a36d-03606a87918b",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/abddd671-8641-455d-a36d-03606a87918b",
        "created_at": "Mon Feb 03 18:45:43 UTC 2020",
        "company": "NIKE",
        "company_url": "https://jobs.nike.com/",
        "location": "Beaverton, Oregon",
        "title": "Senior Software Engineer (Front End)",
        "description": "<p>At Nike, we understand that consumer trust is the true currency of our data-driven world. As we expand our digital advantage to unlock a new era of consumer services, experiences and solutions, we will be guided by our core believe that consumers’ trust is earned, not given. We work hard to maintain this trust every day.</p>\n<p>By embedding privacy within every product and experience and by investing in high quality data, platforms, and models to create unbreakable relationships, we ensure that as we innovate, we do so with the consumer at the center. We create the future of sport together.</p>\n<p>If you're ready to innovate and lead in the Digital space, join Nike's Global Technology organization. We bring together technology and process expertise to deliver one-stop solutions that enable Nike, Inc.'s digital products and services. We are responsible for creating, developing and deploying seamless, tailored and inherently social experiences to its Digital consumers. Working with our organization will be rewarding, challenging, and most definitely not be just another job.</p>\n<p>As a Software Engineer on our Launch Engineering team, you will bring a broad experience of successfully ideating and delivering value that enables Nike to increase productivity, realize efficiencies and build profitable customer experiences. You will be responsible for building simple and intuitive User Interfaces for a variety of internal privacy tools within Nike. Interest and experience in the latest methodologies goes a long way here and we're looking for people who are passionate about the world of value-driven solution delivery. You'll get to work alongside truly talented teams and help them enhance their performance by promoting collaboration and innovation.</p>\n<p>What you’ll do:</p>\n<ul>\n<li>Work in a fast-paced agile environment</li>\n<li>Work in true DevOps fashion owning the entire tech stack</li>\n<li>Build Nike’s data privacy vision for today’s data driven world</li>\n<li>Design, implement, and maintain a variety of user interfaces for Nike’s privacy tools</li>\n<li>Participate in code and design reviews</li>\n<li>Collaborate with other amazing engineers to power the most exciting digital experiences for athletes on the market</li>\n</ul>\n<p>What You Bring to Nike:</p>\n<ul>\n<li>5+ years of experience as a highly productive developer with front-end technologies</li>\n<li>Excellent knowledge of Javascript (ES6), CSS, HTML</li>\n<li>Full-stack front-end developer with experience in React/Redux, Express, Node.js</li>\n<li>Knowledgeable with version control systems (Git) and issue tracking tools (JIRA)</li>\n<li>Experience with TDD, which may include Mocha, Chai, Sinon, etc.</li>\n<li>Experience with CD/CI and related tools (Jenkins etc.)</li>\n<li>Hands on experience in AWS</li>\n<li>Strong communication skills and great product sense</li>\n<li>Passion for sports!</li>\n</ul>\n",
        "how_to_apply": "<p><a href=\"https://jobs.nike.com/job/00470890?utm_source=Github&amp;utm_medium=Jobslots&amp;utm_campaign=SeniorSoftwareEngineerFrontEnd\">https://jobs.nike.com/job/00470890?utm_source=Github&amp;utm_medium=Jobslots&amp;utm_campaign=SeniorSoftwareEngineerFrontEnd</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBck45IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1520744b9f7c63e505eb8cd723324734fedad0de/NIKE.png"
    },
    {
        "id": "06088372-6e15-4282-81dd-769222535361",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/06088372-6e15-4282-81dd-769222535361",
        "created_at": "Mon Feb 03 12:41:22 UTC 2020",
        "company": "Senior Software Engineer",
        "company_url": "https://www.liongard.com/",
        "location": "Houston",
        "title": "Senior Software Engineer",
        "description": "<h2><em>Company Description</em></h2>\n<p>Liongard is a fast-growing tech startup based in Houston, Texas. Liongard’s mission is to enable relentless insight through automation to unleash IT teams to operate at 10x! Our customers are Managed Service Providers (MSPs) that are now managing into a complex modern IT stack – from cloud services like Office 365 and GSuite to network devices, apps, services and databases. Our customers love us because our product, Roar, gives them deep visibility into all the systems and configurations managed and bring it all back to one unified dashboard.  This allows them to troubleshoot issues faster, track changes over time, receive alerts when something is misconfigured, and generate reports across all of their environments and systems.</p>\n<p>We have built an amazing team that has allowed us to grow extremely quickly, while continuing to rapidly improve the product and respond to our improving understanding of our customers’ needs. The product is truly unique in its capability to unify the wide array of systems that represent the modern IT stack.  We are excited about our industry-leading capabilities for empowering MSPs, and are well-positioned to continue developing cutting-edge capabilities that we’ve planned on our roadmap.</p>\n<p>Liongard is a product and customer focused company, and that is really evident in our core values which drive both how we work and who we hire:</p>\n<ul>\n<li>\n<em>Listen &amp; Learn</em> – Be a sponge.  We are focused on learning, not perfection.</li>\n<li>\n<em>Adapt &amp; Automate</em> – Respond to what’s been learned.</li>\n<li>\n<em>Execute as a Team</em> – Collaborate to all row in the same direction.</li>\n<li>\n<em>Focus on Visible Progress</em> – Commitment to excellence through iteration.</li>\n<li>\n<em>Teach</em> – The best path to mastery is through teaching.  Provide thought leadership!</li>\n</ul>\n<h2><em>Job Description</em></h2>\n<p>As a Senior Software Engineer, you'll join a talented, collaborative, and growing engineering organization whose main responsibility is to solve challenging problems and manage complexity as the product continues to grow and change. Team members have the ability to make an impact every day by contributing code across all of our codebases which include the following:</p>\n<ul>\n<li>a web application written primarily in Node.js/Typescript, composed of a REST API and a React.js UI.</li>\n<li>an agent that is installed both in the cloud and on-premise</li>\n<li>Postgresql database</li>\n<li>Our inspectors which are responsible for collecting data from systems and reporting it back to our platform are language agnostic, implemented in whatever language fits the job best (Node.js, Python, Golang, Bash, Powershell, etc).</li>\n<li>Communication and collaboration tools: Atlassian suite (Jira, Bitbucket, Confluence), Slack\nIn addition to experience with the tools we use, the best candidates for this role are going to be absolutely fantastic communicators, with a great attitude and high level of attention to detail. Additionally, we have a lot of fun together: quarterly hackathons, weekly team lunches, bi-weekly lunch and learns, regular team outings, and just enjoying each other's company in the office.</li>\n</ul>\n<h2><em>Responsibilities</em></h2>\n<ul>\n<li>Provide mentorship and leadership on the engineering team.</li>\n<li>Improve existing design patterns and introduce new patterns to our codebases.</li>\n<li>Help to grow the engineering team by interviewing, recruiting and hiring.</li>\n<li>Make informed decisions quickly and take ownership of services and code at scale.</li>\n<li>Contribute readable, maintainable, and performant code to our existing codebases</li>\n<li>Participate in code reviews with other members of the development team</li>\n<li>Follow standard Software Development Lifecycle practices to ensure both quality and efficient delivery of code: requirements, design, and testing</li>\n<li>Work with the Product team to solidify and validate code requirements</li>\n<li>Work with the Engineering team to solidify and validate software designs as well as to solidify and validate software test plans</li>\n<li>Debug and determine root causes for customer issues in the field, clearly communicating resolutions and workarounds to both customers and the internal team</li>\n<li>Contribute to internal and external knowledge base articles and documentation</li>\n<li>Develop blameless postmortems to identify points of failure and prevent future issues</li>\n</ul>\n<h2><em>Qualifications</em></h2>\n<ul>\n<li>4+ years of experience as a software engineer working on a team in an agile environment.</li>\n<li>BS or higher in Computer Science or related field</li>\n<li>High level of competency in at least one programming language, preferably Node.js</li>\n<li>Strong experience programming web applications, and interacting with REST APIs</li>\n<li>Strong data modeling skills</li>\n<li>Excellent verbal and written communication skills, problem-solving skills, and customer service and interpersonal skills</li>\n<li>Strong experience with development tools such as the following: git, any code review tool, continuous integration, etc</li>\n<li>Experience with React, Python, or integration development is a plus</li>\n<li>Experience with general IT Infrastructure or Managed Service Providers is a plus</li>\n<li>Experience with AWS infrastructure and/or Powershell is a plus</li>\n</ul>\n<h2><em>Interested?</em></h2>\n<p>Please apply via <a href=\"https://liongard.redirect.your-jobresponse.com/senior_software_engineer_houston/263035/V819/apply\">this link</a></p>\n<h2><em>Additional Information</em></h2>\n<p>All your information will be kept confidential according to EEO guidelines.</p>\n",
        "how_to_apply": "<p><a href=\"https://liongard.redirect.your-jobresponse.com/senior_software_engineer_houston/263035/V819/apply\">Click here to apply!</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcVY5IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--74288811ce2c738d638b59e6671fd7e8c7c83f35/Liongard%20logo.jpg"
    },
    {
        "id": "6b185ea4-8d2d-4946-b6c6-a2ee866f617b",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/6b185ea4-8d2d-4946-b6c6-a2ee866f617b",
        "created_at": "Sat Feb 01 04:29:09 UTC 2020",
        "company": "KinaTrax",
        "company_url": "http://www.kinatrax.com",
        "location": "Remote",
        "title": "Full Stack Web Developer",
        "description": "<p><strong>Job Description</strong></p>\n<p>The Full Stack Web Developer (FSD) will be responsible for designing and developing a web-based biomechanics analysis platform tailored specifically for the company’s markerless motion capture and video data. The aim of this project is to develop a web-based platform, accessed through the company’s website, to aid front office personnel, coaching staff, and players in the analysis, visualization, and reporting of KinaTrax’s data. Additionally, the FSD will support future web development initiatives of the company.</p>\n<p><strong>Essential Job Responsibilities</strong></p>\n<p>The FSD performs the major functions listed below. The position may require additional duties/responsibilities that may not be outlined below, and specific functions are subject to change.</p>\n<ul>\n<li>Designing and developing a web-based biomechanical analysis platform tailored specifically for use with the company’s markerless motion capture and video data.</li>\n<li>Developing front end website architectures.</li>\n<li>Designing user interactions on web pages.</li>\n<li>Developing back end website applications.</li>\n<li>Creating servers and databases for functionality.</li>\n<li>Ensuring cross-platform optimization for mobile devices.</li>\n<li>Ensuring responsiveness of applications.</li>\n<li>Working alongside biomechanists and data scientists for core functionality.</li>\n<li>Working alongside graphic designers for web design features.</li>\n<li>Designing and developing APIs.</li>\n<li>Troubleshooting, debugging, and upgrading software.</li>\n<li>Designing and developing security and data protection measures.</li>\n<li>Seeing through a project from conception to finished product.</li>\n<li>Meeting both technical and consumer needs.</li>\n<li>Writing technical documentation.</li>\n<li>Staying abreast of developments in web technology.</li>\n<li>Supporting the company’s future web development initiatives.</li>\n<li>Designing and developing unit tests.</li>\n<li>Participating in code reviews.</li>\n</ul>\n<p><strong>Qualifications &amp; Requirements</strong></p>\n<p>The following qualifications are the minimum requirements necessary to successfully perform this role. However, any equivalent combination of experience, education and training, which provides the necessary knowledge, skills and abilities, would be acceptable, subject to any legal and/or regulatory requirements.</p>\n<ul>\n<li>Degree in Computer Engineering, Computer Science or equivalent disciplines.</li>\n<li>Proficiency with fundamental front-end languages such as HTML, CSS and JavaScript.</li>\n<li>Proficiency with AngularJS and familiarity with other JavaScript frameworks such as React.</li>\n<li>Proficiency with ASP.NET Core and familiarity with other server-side languages such as Python, Ruby, Java, and PHP.</li>\n<li>Proficiency with MySQL and familiarity with other database technologies such as MSSQL, Oracle and MongoDB.</li>\n<li>Proficiency with Microsoft Visual Studio.</li>\n<li>Proficiency with web servers, such as IIS and Apache, and UI/UX design.</li>\n<li>Experience in software engineering practices, including but not limited to software design and implementation, unit testing, code reviews, continuous integration, source control, and coding standards compliance.</li>\n<li>Experience with Git is preferred.</li>\n<li>Experience interfacing with both internal team members and external customers as part of a solution-based service process.</li>\n<li>Experience troubleshooting and responding to customer concerns.</li>\n<li>Proven record of being reliable and accountable for all aspects of their job.</li>\n<li>Excellent analytical, interpersonal and communication skills with the ability to communicate complex technical issues in an easy to understand manner.</li>\n<li>Ability to work in a fast-paced, self-directed, entrepreneurial environment.</li>\n<li>Resourceful, with the ability to work independently.</li>\n<li>Strong time management skills.</li>\n<li>Ability to adapt to changing circumstances.</li>\n<li>Decision-making, problem resolution and creative thinking skills.</li>\n<li>Attention to detail.</li>\n<li>Ability to multi-task activities with shifting priorities. Able to work productively in a pressurized environment.</li>\n<li>Ethical and trustworthy.</li>\n</ul>\n<p><strong>Working Conditions</strong></p>\n<ul>\n<li>Occasional travel to meet with clients.</li>\n<li>Extended periods of computer usage.</li>\n</ul>\n<p><strong>Relocation</strong></p>\n<ul>\n<li>None required. Remote work.</li>\n</ul>\n<p><strong>Company Description</strong></p>\n<p>KinaTrax develops a markerless motion capture system that analyzes the motions of a baseball pitcher and hitter in-game. The system is installed in more than 24 ballparks throughout the country, and is utilized by multiple professional baseball teams for the purposes of assessing and enhancing player performance and preventing injuries. The company was founded in 2015 and is headquartered in Boca Raton, Florida.</p>\n<p><strong>Additional Information</strong></p>\n<ul>\n<li>Type: Full-time</li>\n<li>Compensation: $80,000 - $120,000</li>\n<li>Benefits: Health Insurance, Retirement plan</li>\n<li>Experience: Senior level</li>\n<li>Functions: Full Stack Web Development</li>\n<li>Industries: Biomechanics, Baseball</li>\n</ul>\n",
        "how_to_apply": "<p>Apply at:\n<a href=\"https://www.kinatrax.com/kinatrax-jobs/full-stack-web-developer/\">https://www.kinatrax.com/kinatrax-jobs/full-stack-web-developer/</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcEo5IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--679dd3ed1b7182d1a5c9a33a9cb16bec5dac5d9a/KINATRAX.png"
    },
    {
        "id": "9de42a12-1cf7-42c6-b0a0-8646b5ed7d9c",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/9de42a12-1cf7-42c6-b0a0-8646b5ed7d9c",
        "created_at": "Fri Jan 31 16:58:15 UTC 2020",
        "company": "Vanguard",
        "company_url": "http://www.VanguardJobs.com",
        "location": "Malvern, PA",
        "title": "Senior Front-End Developer",
        "description": "<p>Reimagine the investment experience</p>\n<p>Investing is changing rapidly, and Vanguard must evolve constantly to offer the best for investors. New developments in virtual delivery means that the Senior Front-End Engineer will enhance online investment experiences for over twenty million people. Utilizing their ambitious nature and UI expertise to break new technological ground, this hands-on role will provide strategic insight on new ways of working through extensive and ongoing research while working alongside of UX design and the business to turn ideas into beautifully crafted responsive web applications.</p>\n<p>Requirements:</p>\n<p>In this role, you will</p>\n<p>Work on a cross-functional product team where your deep understanding of design layout and behavior will be called upon to translate advanced designs into accessible, semantic markup and responsive web pages.\nCollaborate with product owners, UX designers, data analysts, scrum masters, and developers to develop a world-class user experience. Recommend and effectively explain improvements in functionality, and UX elements that enable users to achieve their goals. Be an expert in building working relationships across divisions.\nResearch, advocate and implement industry standard coding methodologies to improve workflows through the selection of evolving technologies and tools that your team will use to build expert-level user experiences.\nDevelop and continually improve client-side and server-side architecture for web applications. Maintain reusable component libraries for design patterns. Incorporate content management system into the application architecture.\nImpact:</p>\n<p>Innovating for client success</p>\n<p>Focused on creating great user experiences, you’ll harness your passion for technology in the interests of our investors and turn design ideas into workable interfaces. Your excellent interpersonal, organizational and multitasking skills will put you at the heart of major projects, where you’ll have every opportunity to enhance your expertise. As part of our highly regarded team, you’ll build new skills as fast as you build your industry profile.</p>\n<p>Qualifications:</p>\n<p>What it takes</p>\n<p>Undergraduate degree in information technology or design (or equivalent training and experience)\nAt least five years of industry/field-specific experience, including substantial hands-on involvement in front-end development\nExtensive experience with HTML5, CSS3 and JavaScript.  Experience in Angular or React preferred.\nExpert knowledge of the UI/UX design practices and concepts to create highly interactive interfaces\nVanguard is not providing sponsorship for this position</p>\n<p>About Vanguard</p>\n<p>We are Vanguard. Together, we’re changing the way the world invests.</p>\n<p>For us, investing doesn’t just end in value. It starts with values. Because when you invest with courage, when you invest with clarity, and when you invest with care, you can get so much more in return. We invest with purpose – and that’s how we’ve become a global market leader. Here, we grow by doing the right thing for the people we serve. And so can you.</p>\n<p>We want to make success accessible to everyone. This is our opportunity. Let’s make it count.</p>\n<p>Inclusion Statement</p>\n<p>Vanguard’s continued commitment to diversity and inclusion is firmly rooted in our culture. Every decision we make to best serve our clients, crew (internally employees are referred to as crew), and communities is guided by one simple statement: “Do the right thing.”</p>\n<p>We believe that a critical aspect of doing the right thing requires building diverse, inclusive, and highly effective teams of individuals who are as unique as the clients they serve. We empower our crew to contribute their distinct strengths to achieving Vanguard’s core purpose through our values.</p>\n<p>When all crew members feel valued and included, our ability to collaborate and innovate is amplified, and we are united in delivering on Vanguard’s core purpose.</p>\n<p>Our core purpose: To take a stand for all investors, to treat them fairly, and to give them the best chance for investment success.</p>\n",
        "how_to_apply": "<p><a href=\"https://www.vanguardjobs.com/job/10578075/senior-front-end-engineer-cx-lab-malvern-pa/\">https://www.vanguardjobs.com/job/10578075/senior-front-end-engineer-cx-lab-malvern-pa/</a></p>\n",
        "company_logo": null
    },
    {
        "id": "a1831a53-ddb1-4719-9ee4-7b334501569e",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/a1831a53-ddb1-4719-9ee4-7b334501569e",
        "created_at": "Wed Jan 29 08:34:38 UTC 2020",
        "company": "bookingkit GmbH\t",
        "company_url": "https://bookingkit.net/",
        "location": "Berlin",
        "title": "Software Engineer (m/f/d)",
        "description": "<p><strong>Shape the future of the tour &amp; activity sector!</strong></p>\n<p>bookingkit is the European market leader in online booking and management software for tour &amp; activity providers. We enable providers in the leisure industry to digitize their business operations and generate more revenue. The software allows a high degree of automation in managing a wide range of leisure activities and can be implemented in a provider's website as a ready-to-use solution.</p>\n<p>We have strong technology partnerships with the most recognized international travel marketing platforms such as TripAdvisor, GetYourGuide, and mydays, but now we need YOU to join our great team and enormous market potential. We are looking for active contributors with fresh ideas, commitment, energy and passion for our vision to digitalize the leisure market and all our customers - from outdoor to indoor, from cooking school to paintball.</p>\n<p>You long for challenges? You want to develop yourself personally? You want to learn from the best? Then you are perfect with us! Become a part of our team - become a „bookingkid“!</p>\n<p><strong>These will be your tasks</strong></p>\n<p><em>Your role</em></p>\n<ul>\n<li>As a Software Engineer (mainly PHP, as well as ReactJS) you are reporting directly to our Head of Product.</li>\n<li>You are part of the Engineering team at bookingkit and will be working closely together with product managers and UX designers to conceptualize and build innovative and scalable software for our B2B customers.</li>\n<li>You will rebuild our complete design system (UI &amp; UX) with ReactJS, as well as improve existing systems in PHP as well.</li>\n<li>Based on your experience, your knowledge in ReactNative, Go, Python, DevOps processes and AWS environments will come in handy.</li>\n</ul>\n<p><em>Your mission</em></p>\n<ul>\n<li>bookingkit is building the leading infrastructure for tours &amp; activities in Europe. Thus, at our core we are a B2B2C company, driven by SaaS and APIs.</li>\n<li>You will have the chance to not only work on a SaaS system, but also the eCommerce experience of thousands of our customers and thus millions of consumers.</li>\n<li>Our API partners include connections to top-tier providers such as Google, GetYourGuide and TripAdvisor. Due to our market position we have the possibility to set and influence industry standards and are actively engaged in committees steering this development.</li>\n<li>Your role is to be part of a complete UX rework and the rollout of a design system using state of the art technology.</li>\n<li>In order to succeed on that mission we are recruiting top tier engineers to support us on our path.</li>\n</ul>\n<p><em>Your tasks</em></p>\n<ul>\n<li>Build and launch scalable, production-ready software.</li>\n<li>Collaborate with product managers &amp; UX designers during product exploration to give context on feasibility.</li>\n<li>Contribute to the product, UX/UI design and software architecture.</li>\n<li>Share your knowledge and experience with other engineers.</li>\n</ul>\n<p><strong>YOU SHOULD BRING AT LEAST</strong></p>\n<ul>\n<li>Working experience of at least 3-5 years.</li>\n<li>You are experienced in ReactJS. You have extended experience in PHP as well.</li>\n<li>Building design systems is familiar to you.</li>\n<li>Experience in Go, Python, DevOps processes and AWS environments is a definite plus.</li>\n<li>You are used to tight collaboration in cross-functional teams and can successfully help the team explore the feasibility of ideas, as well as deliver high-quality software to market.</li>\n<li>You are fluent in English and communicate with internal and external stakeholders on a high level.</li>\n</ul>\n<p><strong>THIS WOULD BE A NICE TO HAVE</strong></p>\n<ul>\n<li>You speak German.</li>\n<li>You have experience in the startup environment.</li>\n</ul>\n<p><strong>We invest in your future:</strong></p>\n<p>We care about individualized personal and professional development. After 6 months, we provide you with a development budget of up to 1000 € plus an extra day off for training and development purposes. Frequent feedback and coaching sessions with your Team Lead help you to achieve your career goals.</p>\n<p><strong>We live our values:</strong></p>\n<p>Flat hierarchies and #transparency are no empty promises! Share your ideas and #bookingkidness with us and contribute to our #growth. We #trust you to do a great job at your own pace: flexible working hours and home office prove it.</p>\n<p><strong>We believe in work-life-balance:</strong></p>\n<p>You will work with the best in the industry- 90 great colleagues from 17 nations are waiting for you to join us. We love to share our knowlegde in bookingkit university, but of course there is always time for fun team events- our monthly Barbecues are legendary!</p>\n<p>Learn more about being a bookingkid here: <a href=\"https://cdn.files.bookingkit.net/pdf/Perks%26Benefits.pdf\">https://cdn.files.bookingkit.net/pdf/Perks%26Benefits.pdf</a></p>\n<p>Please state your earliest starting date, salary expectation and the channel you´ve found this job ad at when applying.</p>\n<p>We are looking forward to hearing from you!</p>\n",
        "how_to_apply": "<p><a href=\"https://bookingkit.join.com/jobs/699328-software-engineer-m-f-d?pid=357a3b4531918760973f&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=software%2Bengineer%2Bm%2Bf%2Bd\">https://bookingkit.join.com/jobs/699328-software-engineer-m-f-d?pid=357a3b4531918760973f&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=software%2Bengineer%2Bm%2Bf%2Bd</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa0I5IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--642b1a2b6b69ae96592f8df7d0d286ab9e1de4a0/bookingkit.png"
    },
    {
        "id": "a1172771-7b8e-449a-88a8-a81df6e13b63",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/a1172771-7b8e-449a-88a8-a81df6e13b63",
        "created_at": "Tue Jan 28 10:04:35 UTC 2020",
        "company": "Accenture AG",
        "company_url": "https://www.accenture.com/ch",
        "location": "Zurich",
        "title": "Trainee zum Junior Software Engineer / Entwickler (all genders)",
        "description": "<p>Deine Persönlichkeit und Individualität machen den Unterschied. Im Team von Accenture steigern wir die unternehmerische Leistungsfähigkeit unserer Kunden und weisen ihnen den Weg ins digitale Zeitalter. So auch im Bereich Technology: Hier gestalten wir die Technologien von morgen und beschleunigen den digitalen Wandel. Mit unserem Jump-Start-Traineeprogramm machen wir dich in nur zwei Monaten zum IT-Spezialisten. Nach erfolgreichem Abschluss erhältst du einen unbefristeten Arbeitsvertrag und implementierst innovative Lösungen beim Kunden vor Ort.</p>\n<p>Das ist genau dein Ding? Dann lebe deine Leidenschaft – und entwickle dich ungewöhnlich schnell zum Java- Spezialisten! Wie das gehen kann? Mit einem Einstiegsprogramm (zum 16. September oder nach Vereinbarung) , das so nah an der Praxis ist, dass du dein Know-how sofort anwenden kannst. Das auf intensives Lernen durch professionelle Trainer in kleinen Gruppen setzt. So bist du bestens vorbereitet, wenn du im Anschluss als IT-Beraterin/IT-Berater durchstartest.</p>\n<p><strong>Hier machst du den Unterschied</strong>\nDein Traineeprogramm hat es in sich – damit du es schnell drauf hast! Und das steht auf dem Programm:</p>\n<ul>\n<li>Entwicklung von Java-Anwendungen auf Basis von Java EE, Spring, Hibernate und Open-Source-Frameworks</li>\n<li>Agile Methoden, insbesondere Scrum und DevOps</li>\n<li>Erstellung moderner Web-Architekturen und Front-Ends mit Angular/React</li>\n<li>Grundlagen in Software Engineering und Software-Architektur</li>\n</ul>\n<p><strong>Hiermit kommst du bei uns an</strong></p>\n<ul>\n<li>Abgeschlossenes IT- oder IT-nahes Studium bzw. eine solide IT-Ausbildung</li>\n<li>Erste Praxis in Java und relationalen Datenbanken (SQL)</li>\n<li>Sehr gute analytisch-konzeptionelle Fähigkeiten und eine hohe Lernbereitschaft</li>\n<li>Sehr gute Deutsch- und Englischkenntnisse</li>\n<li>Mobilität und Spass an der Arbeit in einem internationalen Projektteam</li>\n</ul>\n<p><strong>Benefits:</strong></p>\n<ul>\n<li>\n<strong>Weiterbildung &amp; Karriere:</strong> Unser Trainingsangebot reicht von Online-Kursen über virtuelle Trainings bis hin zu Classroom-Seminaren. Wir investieren jährlich über 800 Millionen US-Dollar in Mitarbeiterbildung.</li>\n<li>\n<strong>Flexibles Arbeiten:</strong> Bei der Planung unserer Projekte berück­sichtigen wir die Lebenssituation unserer Mitarbeiter. Modernste Technologien ermöglichen ein ortsunabhängiges und flexibles Arbeiten.</li>\n<li>\n<strong>Aufgabenvielfalt:</strong> Mehr Vielfalt geht kaum: Wir begleiten Kunden aus 40 Industrien über den gesamten Lösungsprozess - von der Strategieentwicklung über die digitale Transformation bis zur operativen Durchführung.</li>\n<li>\n<strong>Innovationsführer:</strong> Accenture ist immer am Puls der Zeit. Wir gestalten die Digitalisierung aktiv mit, sind strategischer Vordenker und technologischer Vorreiter. So stärken wir Unternehmen und ganze Branchen.</li>\n<li>\n<strong>Unternehmenskultur:</strong> Unsere Kultur ist geprägt von Innovationskraft und Teamgeist sowie vom intensiven Wissens- und Erfahrungsaustausch innerhalb unseres globalen Netzwerks.</li>\n<li>\n<strong>Markterfolg:</strong> Wir arbeiten für mehr als 4.000 Kunden in über 120 Ländern, viele davon sind die erfolgreichsten und nam­haftesten Unternehmen ihrer Branche. Darunter 29 der DAX-30-Unternehmen.</li>\n<li>\n<strong>Gesellschaftliche Verantwortung:</strong> Unser gesellschaftliches Engagement als Unternehmen ist in unseren Grundwerten verankert. Gemeinsam mit unseren Mitarbeitern wollen wir einen nachhaltigen, messbaren Beitrag für die Gesellschaft leisten.</li>\n<li>\n<strong>Frauen bei Accenture:</strong> Schon heute arbeiten bei Accenture mehr als 145.000 Frauen. Doch wir wollen ihren Anteil bei Neueinstellungen weiter steigern – und das weltweit. Frauen profitieren von speziellen Trainings, Mentorings und Netzwerken.</li>\n</ul>\n",
        "how_to_apply": "<p><a href=\"https://accenture.join.com/jobs/698021-trainee-zum-junior-software-engineer-entwickler-all-genders?pid=757e7cf81db3118dbbf1&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=trainee%2Bzum%2Bjunior%2Bsoftware%2Bengineer%2Bentwickler%2Ball%2Bgenders\">https://accenture.join.com/jobs/698021-trainee-zum-junior-software-engineer-entwickler-all-genders?pid=757e7cf81db3118dbbf1&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=trainee%2Bzum%2Bjunior%2Bsoftware%2Bengineer%2Bentwickler%2Ball%2Bgenders</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaVo5IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--edb70dec2a938eb99fd3e417cc358c07771735f6/accenture-logo-talendo.png"
    },
    {
        "id": "d8a09f8c-64c9-47c5-b64c-7c48c2e35850",
        "type": "Contract",
        "url": "https://jobs.github.com/positions/d8a09f8c-64c9-47c5-b64c-7c48c2e35850",
        "created_at": "Tue Jan 28 00:34:21 UTC 2020",
        "company": "RedDoor Inc.",
        "company_url": "https://reddoor.com/",
        "location": "San Francisco Bay Area - Remote",
        "title": "Full Stack Engineer",
        "description": "<h2><strong>What is RedDoor?</strong></h2>\n<p>RedDoor is a Sacramento/San Francisco based start-up focused on building tech that elevates the home-buying experience. With a mission focused on understanding the home buyer’s best interest, we are building tech that gives them instant access to transparency in options and control over their financing experience. Simultaneously, we stand for the human aspect of the home buying process and know that the professionals involved in assisting the home buyer are imperative to their best interest, and our tech empowers these professionals to provide a higher level of service from beginning to end. Before RedDoor tech was out of prototype, we had several industry brands ask for exclusive rights (which we declined) and since we launched with our first version in May 2019, within twenty days we had an agreement to make sure our tech is in the hands of every agent in the largest brokerage in California.</p>\n<p>RedDoor is fully funded and at an incredible inflection point as we trail towards the end of our early-stage we sit poised for high growth to not only disrupt but ultimately change the industry.</p>\n<p><strong>Responsibilities</strong></p>\n<ul>\n<li>Design and architect front-end and back-end systems.</li>\n<li>Ensure that systems are robust, secure, and scalable.</li>\n<li>You will be expected to be an authority on your area of responsibility answering queries from other teams.</li>\n</ul>\n<p><strong>Qualifications</strong></p>\n<ul>\n<li>Experienced knowledge in JavaScript and modern frameworks such as ReactJS or Vue (4+ years).</li>\n<li>Clear understanding of async design patterns.</li>\n<li>Deep knowledge in Node.js and a server framework like Express or HAPI.</li>\n<li>Experience working within a distributed SOA architecture.</li>\n<li>Experience building an automation‐focused culture, both in testing and build/deploy.</li>\n<li>You are client-focused, react well to change, work with teams and able to multi-task on multiple products and projects.</li>\n</ul>\n<p><strong>What we offer</strong></p>\n<ul>\n<li>Phenomenal Leadership</li>\n<li>Collaborative work environment</li>\n<li>Own your work - let your influence and expertise shine here. We want  - to hear your ideas!</li>\n<li>Flexibility in working hours</li>\n<li>Compensated sick and vacation time</li>\n<li>Build your dream with us - jump on a massive opportunity for growth with our company</li>\n</ul>\n<p>Fine Print,\nRedDoor HQ Inc, is an equal opportunity employer that values diversity, inclusion and belonging. We do not discriminate on the basis of race, religion, color, national origin, gender, gender identity or expression, sexual orientation, age, marital status, veteran status, disability status, or any other characteristic protected by law. We will consider for employment all qualified applicants with arrest and conviction records in a manner consistent with applicable law, including the San Francisco Fair Chance Ordinance. DRE 0204298, NMLS 1838659</p>\n",
        "how_to_apply": "<p>Apply on linkedIn: <a href=\"https://www.linkedin.com/jobs/view/1701174816\">https://www.linkedin.com/jobs/view/1701174816</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaGw5IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--45d9c448a301d863373f94d262008c302b077d80/download.png"
    },
    {
        "id": "9dd7e709-b3dc-402d-9976-52e628e77dbc",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/9dd7e709-b3dc-402d-9976-52e628e77dbc",
        "created_at": "Mon Jan 27 21:40:49 UTC 2020",
        "company": "One Click Contractor",
        "company_url": "https://oneclickcontractor.com/",
        "location": "Carmel, IN 46074",
        "title": "Full Stack Software Engineer - Rails",
        "description": "<p>Are you a full stack software engineer looking to join a small, growing development team? One Click Contractor is a 4-person dev team building a new SaaS product for the home improvement industry. We build with Rails, React/Typescript, and Elixir. Your work will help hundreds of home improvement contractors streamline their sales process and improve their business.</p>\n<p>As a small team, we all get to wear lots of hats, explore our interests, learn, and make a big impact. We trust each other, so our team has flexible hours and often works from home. We &lt;3 remote work! Anyone within a ~2.5 hour drive of Indianapolis is encouraged to apply and learn more.</p>\n<p>Our most junior developers have suggested features that have shipped to production. This has led to a product that our customers love. Those happy customers are pulling more ideas from us and we need your help to build these greenfield projects.</p>\n<p>Some things we’re excited to build together:</p>\n<ul>\n<li>3rd party API integrations</li>\n<li>Using Elixir to build Real Time Systems</li>\n<li>Improving our DevOps tools and practices</li>\n<li>Brand new modules for our core platform</li>\n</ul>\n<p>You would be a good fit if you are:</p>\n<ul>\n<li>Curious - Desires to learn every day</li>\n<li>Quick study, self-learner - Gains proficiency in new technologies quickly</li>\n<li>Critical Thinker - Looks beyond the obvious</li>\n<li>Communicator - Shares thoughts, candidly and respectfully</li>\n<li>Ready to drive innovative ideas</li>\n<li>Honest, candid and trustworthy</li>\n<li>Has a bias toward action - Executes quickly and gets things done on time</li>\n<li>Agile and adaptable - Thrives on change</li>\n</ul>\n<p>Technologies:</p>\n<ul>\n<li>Linux / MacOS</li>\n<li>Elixir / Phoenix, Ruby on Rails</li>\n<li>React / Typescript / Angular (currently 1.x)</li>\n<li>Test Driven Development (TDD)</li>\n<li>Kanban / Lean</li>\n<li>Docker / AWS / Terraform / PostgreSQL</li>\n<li>The Right Tool for the Job</li>\n</ul>\n<p>Benefits:</p>\n<ul>\n<li>Work From Home and Telecommuting Options</li>\n<li>Convenient North-Side Indy Office Location (Carmel, IN)</li>\n<li>Free Parking</li>\n<li>Paid Holidays</li>\n<li>PTO</li>\n<li>Community Involvement and Paid Volunteer Time</li>\n<li>Flexible Work Environment (Maintain a healthy life balance)</li>\n<li>Job-Related Education Reimbursement</li>\n<li>Performance Rewards</li>\n</ul>\n",
        "how_to_apply": "<p>If you're interested, please complete this form:\n<a href=\"https://docs.google.com/forms/d/e/1FAIpQLSchnqxpCcb_zmR8Z4C6v4r5Z7ivFDKn1kB3bh66RQPItYI-yQ/viewform?usp=pp_url&amp;entry.143369278=Github+Jobs\">Apply Here</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZzE5IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--26c0c3ca6ec2f1e5e9cc0d1aa440e5442346ee01/OCC-logo-MASTER.png"
    },
    {
        "id": "710a31cf-dbe4-4767-9e1d-c482858911f0",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/710a31cf-dbe4-4767-9e1d-c482858911f0",
        "created_at": "Sat Jan 25 14:28:08 UTC 2020",
        "company": "Banner Ltd",
        "company_url": "http://http",
        "location": "Manchester, UK",
        "title": "Senior Magento PHP Developer Manchester UK",
        "description": "<p>Working for Banner</p>\n\n<p>Banner Ltd is the UK’s leading supplier of school uniform and sportswear, renowned for its high level of service, product choice, quality and year round stock availability.  We are an ambitious team of c.340 people across two business divisions; wholesale and retail, and work with an extensive network of retail/e-tail/online partners.</p>\n<p>Our Wholesale business is located across 3 sites, Trowbridge (HQ), Altringham and Seaham.  Our Retail business is headquartered in superb offices close to Altrincham town centre and has around 30 office and store locations around the country.</p>\n<p>Banner is private equity owned and has invested considerable resources in developing the leading digital offer in our market.  As a result, we have an ambitious digital change agenda, stewarded by a Digital Advisory Board and strong sponsorship from our CEO.  We are implementing Magento 2+ across all our platforms and have partnered with Maginus as our external development partner.  We have a number of exciting, cutting edge projects and we require an outstanding Senior Magento Developer to drive Magento App development and front end delivery, which is seen as pivotal to the Group’s commercial success.</p>\n<p>This challenging change agenda is supported by our internal commitment to empower colleagues, provide outstanding careers and make Banner a truly great place to work. We want to grow our team with diverse, collaborative, enthusiastic and ambitious talent: - people who want be part of something special.</p>\n<p>Summary of this position</p>\n\n<p>In this pivotal position you will responsible for developing PHP applications on the Magento 2.3 platform. As a Senior Magento developer you will help shape our development pipeline while building bespoke applications that are unique to our industry. Working with our development partner Maginus you will optimise and improve our websites on the Magento Enterprise Cloud architecture. Passion for code is a must!</p>\n<p>Day to day you will develop code, unit test your work, document, estimates work and be a sounding board for concepts and ideas. Working alongside IT team, UX developer and marketing you be responsible for delivering a great backlog of applications and new features both front and backend.</p>\n<p>Banner is private equity owned and has invested considerable resources in developing the leading digital offer in our market.  As a result, we have an ambitious digital change agenda, stewarded by a Digital Advisory Board and strong sponsorship from our CEO. This is an exciting opportunity for someone wanting to help build a foundation, make the next step in the career and drive real difference to the group.</p>\n<p>Are we right for you?</p>\n\n<p>To be successful with Banner you will be positive, dynamic, professional, courageous and collaborative. You will be:</p>\n<ul>\n<li>Detailed oriented and solution focused with strong time management skills</li>\n<li>A continuous learner and mentor for junior staff</li>\n<li>A great team player who can work with a teams on and off site</li>\n<li>Comfortable with clarifying briefs and communicating delivery estimates and explaining work</li>\n</ul>\n<p>You will be able to clearly demonstrate significant experience in the following areas:</p>\n<ul>\n<li>Object Orientated programming in PHP and MySQL\no\tOn the Magento 2 framework, 2.3 preferred on Magento Cloud</li>\n<li>Creating project briefs and allowing stake holders the ability to make decisions on project delivery</li>\n<li>Debugging and supporting Magento</li>\n<li>Clear documenter of own code who advocates for best practice</li>\n<li>Capable in front-end technologies such as HTML, CSS3, JavaScript, jQuery, React, Vue.JS, Bootstrap</li>\n<li>DevOps experience in Azure, Docker, Magento Cloud, Blackfire.io, New Relic will be advantageous</li>\n<li>Git</li>\n<li>PHP MVC Frameworks (Zend or Symfony or Laravel)</li>\n</ul>\n<p>To apply you will need to:</p>\n<ul>\n<li>Excellent knowledge in PHP and MySQL on Magento Enterprise framework</li>\n<li>Ideally educated to a degree standard in Computer Science or equivalent media/IT qualification</li>\n<li>Hold Magento 2 development certification but not critical</li>\n</ul>\n<p>What you can look forward to:</p>\n<ul>\n<li>Salary up to £45,000 depending on experience</li>\n<li>Birthday off</li>\n<li>Flexible working hours and work from home one day a week (manager’s discretion)</li>\n<li>Off peak early finishes on Fridays (October-May)</li>\n<li>Regular socials</li>\n</ul>\n<p>This job description is a tool to help both the Company and the individual understand the main responsibilities of the role. It is not intended to be an exhaustive or complete list of all possible tasks. Everyone is expected to be flexible in his or her approach and to take on tasks as reasonably requested.</p>\n",
        "how_to_apply": "<p>Email <a href=\"mailto:chris.park@banner.co.uk\">chris.park@banner.co.uk</a> with a copy of your CV.</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdmQ4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9fba86f9e94dd89dfd453e002cb9de2640a650f7/banner-logo.png"
    },
    {
        "id": "1c067f3d-e9ab-4c82-bfc9-a2d793b3bac6",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/1c067f3d-e9ab-4c82-bfc9-a2d793b3bac6",
        "created_at": "Fri Jan 24 16:40:21 UTC 2020",
        "company": "C4ADS",
        "company_url": "http://c4ads.org",
        "location": "Washington DC",
        "title": "Software Engineer",
        "description": "<p>Overview</p>\n<p>At C4ADS, we are pushing the bounds of what is possible with open data and technology for conflict, security, and threat-finance research. The mission of C4ADS is to understand and, where possible, disrupt illicit networks. We are guided by the philosophy that technology and data can empower us to hold governments and illicit actors accountable. We actively seek to use our unique capabilities, skill sets, and data access to drive tangible outcomes.</p>\n<p>We are looking for a Software Engineer to join our fast-growing data team. As a Software Engineer at C4ADS, you will be responsible for managing various development projects for public applications and creating new tools for analysis and information distribution for the rest of C4ADS. The ideal candidate has experience building full-stack development projects from the ground up and is able to work with all types of structured and unstructured data. We are looking for people who are creative, passionate programmers willing to learn new skills and techniques to get the job done. Software Engineers are expected to demonstrate a high level of independence with their projects, acting in a coordination role with external contractors to complete development sprints on large projects. You will quickly gain practical skills through our in-depth training and will have the opportunity to expand your professional network—all in addition to a joyful work environment with generous benefits and flexible hours. Read more about the role and requirements below.</p>\n<p>What You’ll Do:</p>\n<ul>\n<li>Manage development projects for internal and public facing web applications.</li>\n<li>Create and maintain tools for analysis and information distribution.</li>\n<li>Identify, design, and implement internal process improvements like automating manual workflows, optimizing data delivery, re-designing existing application infrastructure for greater scalability and performance, etc.</li>\n<li>Work with stakeholders, including the management and analytical teams, to understand and support their data infrastructure needs.</li>\n<li>Assist the data team with optimizing and improving existing resources and tools.</li>\n<li>Keep our data organized and secure across company and client requirements.</li>\n</ul>\n<p>What We’re Looking For:</p>\n<p>Required</p>\n<ul>\n<li>A degree in Computer Science, Statistics, Informatics, Information Systems, or any other relevant degree or certification.</li>\n<li>Strong project management and organizational skills.</li>\n<li>Proficiency in modern, full-stack web development using Javascript and Typescript (Node, React, Express, Angular).</li>\n<li>Proven ability to design and create full-stack web development projects.</li>\n<li>Experience managing projects with git and working on development in a team environment.</li>\n<li>Experience with cloud services like AWS.</li>\n<li>Experience with relational SQL and NoSQL databases.</li>\n<li>A strong commitment to personal and professional development.\nPreferred</li>\n<li>Knowledge of good infrastructure automation practices.</li>\n<li>Strong UI/UX design skills.</li>\n<li>Experience using Python and libraries like pandas and numpy for data processing.</li>\n<li>Experience with big data tools: Spark, Hadoop, etc.</li>\n<li>Experience with geospatial data analysis: PostGIS, ArcGIS/QGis, GeoMesa, etc.</li>\n<li>Proficiency in Java, C++, and/or Golang.</li>\n<li>Experience deploying and managing containerized applications: Docker, Kubernetes, etc.</li>\n</ul>\n<p>How We’ll Reward You:</p>\n<ul>\n<li>Competitive salary</li>\n<li>Medical, Dental, and Vision Insurance</li>\n<li>Voluntary 401k program</li>\n<li>Generous vacation and flex time that focuses on the work, not hours</li>\n<li>Professional development programs that allow you to customize your own courses and build your own development path</li>\n<li>A passionate team that values hard work and is serious about building and maintaining a great culture</li>\n</ul>\n<p>HOW TO APPLY:\nPlease send us your cover letter, resume, and a 2-3 page writing or code sample.  Incomplete applications will not be considered.  Applicants must be eligible to work in the United States on a full-time basis. Please include the position name in the subject of your email and direct all inquiries and applications to <a href=\"mailto:hr@c4ads.org\">hr@c4ads.org</a>.  Applications will be considered on a rolling basis.\nIf you don’t think you’re qualified but love what we’re doing, please apply anyway! We’d love to hear from you.</p>\n<p>We are committed to creating an exciting and rewarding work environment for our staff by providing equal opportunity for all positions of employment to qualified employees without regard to gender, race, color, sexual orientation, ethnic or national origin, age, physical or mental disability, marital status, military status, or any other category protected by federal, state, or local laws.  We are fully committed to the objective of furthering equality of opportunity in recruiting, hiring, training, educating, and recognizing all personnel.</p>\n",
        "how_to_apply": "<p>Please send us your cover letter, resume, and a writing or code sample.  Incomplete applications will not be considered.  Applicants must be eligible to work in the United States on a full-time basis. Please include the position name in the subject of your email and direct all inquiries and applications to <a href=\"mailto:hr@c4ads.org\">hr@c4ads.org</a>.  Applications will be considered on a rolling basis.</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdXA4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f095d2cea0bfc612a65194f4ed3c91c3ed7117d8/c4logoblack.png"
    },
    {
        "id": "30f8ce69-89aa-45f3-86a2-b1457ea9cf55",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/30f8ce69-89aa-45f3-86a2-b1457ea9cf55",
        "created_at": "Fri Jan 24 00:25:22 UTC 2020",
        "company": "GetThru",
        "company_url": "http://www.getthru.io",
        "location": "Oakland",
        "title": "DevOps Engineer (Remote)",
        "description": "<p>GetThru is looking for an experienced DevOps Engineer to join our expanding technology team. As a small team, we all wear many hats and operate with a good deal of latitude and autonomy. We are looking for a DevOps Engineer, preferably with a strong secondary skill set in security/SecOps, software development, or database administration.</p>\n<p>This is a hands-on role that will directly contribute to the success of our platform and company. You will play a key role in improving the agility, availability, scalability and security of our platform. You will work closely with the development team to ensure an automated and secure CI/CD pipeline.</p>\n<p>This is a remote, full-time position with equity and benefits in a profitable and growing progressive SaaS company.</p>\n<p>Responsibilities</p>\n<p>Automate repetitive development, operations and deployment tasks</p>\n<p>Collaborate with team members to refine application/infrastructure architecture</p>\n<p>Identify, propose, and implement solutions that optimize the platform, monitoring, and processes</p>\n<p>Optimize platform and environment to align to AWS well architected 5 pillars</p>\n<p>Actively monitor production resources</p>\n<p>Technologies We Use</p>\n<p>CloudFlare, CloudFront, AWS, Aurora PostgreSQL, Redis, GitHub, CircleCI, Dokku, Docker, Terraform, Ansible</p>\n<p>Elixir, Phoenix, React with Redux, TypeScript, Webpack &amp; Babel, HTML5, CSS3, &amp; SASS</p>\n<p>Ideal Candidate (The Purple Unicorn)</p>\n<p>Comfortable supporting customer facing, mission critical production environments</p>\n<p>Extensive CI/CD experience within AWS, especially with erlang/elixir</p>\n<p>Experience with tools &amp; techniques to support a Secure Software Development LifeCycle (S-SDLC)</p>\n<p>Hands on experience supporting microservices architecture within AWS container management solutions (ECS,EKS, Docker)</p>\n<p>Able to build and maintain environments using infrastructure as code (Terraform)</p>\n<p>Linux Administration</p>\n<p>Familiar with RDMS, ETL, and data analytics services</p>\n<p>Experience with Security/Compliance Frameworks (NIST, SOC2, ISO 2700x, GDPR, etc)</p>\n<p>Previous success in remote teams, small companies, SaaS environments</p>\n<p>While experience matters, we care just as much about work ethic, creativity, determination, and shared commitment to progressive ideals, customer service, and a high standards workplace.</p>\n<p>About Our Team</p>\n<p>Our development team iterates fast while keeping an eye to stability and maintainability. We are a small team so we expect our developers to wear many hats. Our developers know how to balance improvement projects with delivering features, how to pay off tech debt while blazing forward, and how to use modern technology while keeping stability in mind. We are a female-led operation, and we share a commitment to promoting diversity in the tech field.</p>\n<p>About GetThru</p>\n<p>GetThru operates a peer-to-peer text messaging platform (ThruText) and telephone dialing tool (ThruTalk) that political campaigns and other organizations use for large scale 1-to-1 communication. GetThru has worked with more than 1,000 clients who have sent over 250 million text messages and made more than 60 million calls through our tools. GetThru was launched in 2016 by veterans of the Bernie Sanders distributed organizing team to improve on the tools we used running voter contact programs, and we’re most excited about helping progressive politicians and organizations. We also believe in building a sustainable business, so we are actively expanding into other markets that could benefit from this technology, including working with more than 200 educational institutions. We have been profitable from day one without VC funding.</p>\n<p>Location</p>\n<p>This is a remote position. You will work from anywhere in the U.S. as long as you have good internet and the work gets done! Our team members travel a few times a year to meet with the team in-person.</p>\n<p>Compensation</p>\n<p>$100k – $140k yearly salary, commensurate with skills and experience\n100% company-paid health, dental, and vision benefits\n401k with match\nWellness and ergonomic health stipends\nParticipation in employee stock option pool\nEmployee profit sharing bonus pool\n3 weeks of vacation time per year, scales with tenure; company holidays, float holiday &amp; birthday PTO</p>\n<p>Equal Opportunity</p>\n<p>GetThru provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, sex, sexual orientation, national origin, age, disability, or genetics. As our company grows, we strive to make space for all kinds of people to do amazing work with us. We especially encourage women, people of color, LGBTQ+ people, people with disabilities, immigrants, and other communities underrepresented in technology startups to apply. We value diversity because we think a team with a wide range of experiences will be more creative, more adaptable, and more effective. Further, our clients are leading advocates for equity and justice, and we want our team to reflect the communities we are working to support.</p>\n<p>How to Apply</p>\n<p>Please submit the application form with a cover letter that explains why you want to work for GetThru. Tell us what experiences make you a good fit and why you are excited about this job in particular.</p>\n",
        "how_to_apply": "<p>Please apply by going directly to our website: <a href=\"https://getthru.freshteam.com/jobs/TIXhL3lYEOzf/devops-engineer-remote\">https://getthru.freshteam.com/jobs/TIXhL3lYEOzf/devops-engineer-remote</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdVo4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9d4d7eb38bbf6c30469504f106087b07d95df215/gt-logo-plus-tagling-navy-pink.png"
    },
    {
        "id": "c1dc352b-bfc5-4c54-acdb-303b26cc0841",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/c1dc352b-bfc5-4c54-acdb-303b26cc0841",
        "created_at": "Thu Jan 23 19:44:03 UTC 2020",
        "company": "Minneapolis Institute of Art",
        "company_url": "https://jobs-artsmia.submittable.com/submit",
        "location": "Minneapolis",
        "title": "Software Developer",
        "description": "<p>Full time, 37.5 hours/week</p>\n<p>The Job\nSustain and grow software development and infrastructure support practices at Mia. Manage day-to-day software development and contribute directly to the code base. Work collaboratively across the organization to deliver effective solutions.</p>\n<p>In this role, you will…\n●\tDesign and contribute to the coding of systems and products, including digital content, business systems, and backend systems integration.\n●\tIn collaboration with management, the software development team, and internal stakeholders, decide upon and communicate the goals, requirements, technologies, and targeted milestones for all software products and initiatives.\n●\tProvide ongoing support of products, systems, and services that have been developed by staff at Mia, including change management, infrastructure configuration, refactoring, software fixes, and monitoring.\n●\tMaintain up-to-date knowledge of software development, information technology, and internet/mobile technologies.</p>\n<p>Specific Requirements\n●\tCollege degree in computer science, computer programming, and/or equivalent work experience.\n●\tSignificant experience (typically 4 years or more) in software development and/or website development.\n●\tApplied experience with Agile methodology preferred.\n●\tRequired, critical skills for this position:\no\tLanguages/Frameworks: PHP, Javascript, React\no\tDatabases: Redis or other NoSQL DBs, MySQL, MSSQL\no\tOperating Systems: Linux (Ubuntu), Windows\n●\tAdditional knowledge and experience considered a plus:\no\tAWS: EC2, CloudFront, s3, SES\no\tRuby on Rails, WordPress\no\tNetworking technology (DNS, Firewalls, IPSec, TLS/SSL)\no\tDocker, Kubernetes, Infrastructure as Code\no\tSalesforce, especially Apex programming language\no\tScripting for automated tasks, or configuration tools (Ansible, Apache Airflow)</p>\n<p>You’re good at and enjoy…\n●\tRecognizing the value in others’ unique perspectives.\n●\tKnowing your success is directly related to visitor satisfaction.\n●\tSetting challenging goals and achieving them.\n●\tTaking advantage of promising opportunities.</p>\n<p>Who We Are\nWe are enthusiastic advocates of the mission. We understand that our work is interconnected, and communication is key to accomplishing it. We value multiple perspectives, knowing that diverse viewpoints yield valuable insight. We seek to learn and grow. We value self-awareness and are conscious of our effect on others. We each strive to bring positivity to our work and show it in our own way.</p>\n<p>Mia Culture\nWe at the Minneapolis Institute of Art aim to be an audience-centered, equitable and inclusive workplace where everyone is welcome. To achieve this aim, we are Mission Driven, Generous, Agile, Emotionally Aware, and Positive. We endeavor to create a workplace culture where we are responsible to one another, to our visitors, and to ourselves to do our best work.</p>\n<p>Benefits\n●\tMedical and dental insurance availability\n●\tPaid vacation, sick, and family leave\n●\tFree tickets to many museum events and exhibitions\n●\tMonthly all staff meetings to keep you informed about the museum and its goals, showcase\n●\tdivision/department work and celebrate wins.\n●\tMulti-Faith Prayer + Contemplation Space available to all staff and volunteers\n●\tNursing and lactation spaces\n●\t20% discount at Mia’s Agra Café\n●\t30% at The Store at Mia\n●\tTuition reimbursement for specified course/degree work\n●\tFree or discounted continuing education courses at Mia\n●\tMetro Transit and Nice Ride discounts</p>\n<p>To Apply\nTo be considered for this position, please complete and submit the online application at <a href=\"https://jobs-artsmia.submittable.com/submit\">https://jobs-artsmia.submittable.com/submit</a>.</p>\n<p>Posting Deadline\nDeadline for submissions is Wednesday, February 5th, 2020.</p>\n<p>Diversity creates a healthier atmosphere: All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, protected veteran status, disability status, sexual orientation, gender identity or expression, marital status, genetic information, or any other characteristic protected by law.\nAN AFFIRMATIVE ACTION / EQUAL EMPLOYMENT OPPORTUNITY EMPLOYER</p>\n",
        "how_to_apply": "<p>To Apply\nTo be considered for this position, please complete and submit the online application at <a href=\"https://jobs-artsmia.submittable.com/submit\">https://jobs-artsmia.submittable.com/submit</a>.</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdU44IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d53ab998c80f1638f46ddeb90a4462ec1a5bf208/Mia_200px%20NEW.png"
    },
    {
        "id": "9e6d1d24-9287-4059-9f0d-e32f09c7e6bf",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/9e6d1d24-9287-4059-9f0d-e32f09c7e6bf",
        "created_at": "Thu Jan 23 19:31:09 UTC 2020",
        "company": "Hazel Analytics",
        "company_url": "https://hazelanalytics.com",
        "location": "Seattle",
        "title": "Python/React Software Engineer",
        "description": "<h2>About the company</h2>\n<p>Hazel Analytics pairs the largest food safety inspection database with powerful analytics tools and solutions for Fortune 500s and leading organizations in the restaurant, government, and financial services industries. Our Food Safety Insights (FSI) and other analytics products transform local health department data into actionable intelligence using our proprietary Hazel Score methodology.</p>\n<p>Of the top 100 food retail chains by size, 49 are users of Hazel Analytics technology; our customers include notable national and global brands such as Instacart, Target, Subway, and Whole Foods. We're also the exclusive worldwide provider of health department data technology to Ecolab, a global leader in food safety products and services. Our recent awards include the 2019 Food Marketing Institute Food Safety Innovation Award and the 2019 Sani Professional Food Safety Program Innovation Award. We've also been recognized as one of Seattle's best small businesses to work for in 2020 by Built in Seattle.</p>\n<h2>About the role</h2>\n<p>We're currently seeking experienced full-stack and/or front-end software engineers to continue growing our engineering team. Candidates with diverse tech experience are invited to join us in both expanding our flagship product and creating new products, working across all levels of Hazel's tech stack. Our tech stack is predominantly Python (Flask), JavaScript (React), and PostgreSQL, with Docker and Google Cloud featuring in our infrastructure. The team operates in an agile manner, keeping processes to a minimum and enabling engineers to stay focused on their work. We're especially interested in people who are eager to mentor junior engineers and who have recent experience with React/Redux, recent experience in data science, a devops focus, or UI/UX skills.</p>\n<p>Compensation is $100K - $160K (DOE), plus equity and a generous benefits package. Our engineering team has some WFH flexibility, but we do <strong>not</strong> have fully-remote opportunities. We are <strong>not</strong> able to provide H1B sponsorship; relocation assistance within the United States is negotiable.</p>\n<h2>More info</h2>\n<h3>Qualifications</h3>\n<ul>\n<li>Bachelor’s or master’s degree in a field related to software development</li>\n<li>4+ years of relevant career experience (2+ positions preferred)</li>\n<li>Meaningful recent experience with technologies in our stack</li>\n<li>Enthusiasm for unit tests and robust APIs</li>\n</ul>\n<h3>Responsibilities</h3>\n<ul>\n<li>Implement new features and maintain existing features of Hazel software</li>\n<li>Support features with tests, instrumentation, and documentation</li>\n<li>Respond to customer escalations as needed</li>\n<li>Collaborate on gathering requirements for features and identifying areas of risk or uncertainty</li>\n<li>Contribute to improvements in team-wide processes, communication, and organization</li>\n</ul>\n<h3>Traits we look for</h3>\n<ul>\n<li>Self-motivated and quick to learn. Everyone says this, but we really mean it. We’re a fast-growing startup, where all employees have a direct impact on our success.</li>\n<li>Excellent communications skills. Engineers need to be equally comfortable discussing matters within the team, participating in a call with a customer, and writing timely, thoughtful emails.</li>\n<li>Writes clean, efficient, intelligible code. Although we're a startup and move quickly, we don't sacrifice code quality.</li>\n</ul>\n",
        "how_to_apply": "<p><a href=\"https://jobs.lever.co/hazelanalytics/7c4ae7ec-ed3f-45cf-b2e9-0a8146b89840?lever-origin=applied&amp;lever-source%5B%5D=GitHub\">https://jobs.lever.co/hazelanalytics/7c4ae7ec-ed3f-45cf-b2e9-0a8146b89840?lever-origin=applied&amp;lever-source%5B%5D=GitHub</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdUo4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6e64471e32a4d50b552e4177889849f31c673069/Hazel%20Analytics_FAC-02.png"
    },
    {
        "id": "d109dba5-9bbb-4548-90be-e62fc0721556",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/d109dba5-9bbb-4548-90be-e62fc0721556",
        "created_at": "Wed Jan 22 09:59:12 UTC 2020",
        "company": "the prosperity company AG",
        "company_url": "https://theprosperity.company/",
        "location": "Berlin",
        "title": "Senior Fullstack Developer (m/w)",
        "description": "<p><strong>Was wir tun</strong></p>\n<p>Wir sind ein <strong>Finanz- und Versicherung Technologie Unternehmen</strong> (FinSurTech), das heißt wir entwickeln Technologien für digitales Wohlstandsmanagement. Wir haben es uns zum Ziel gesetzt, jedem zu Ermöglichen ein Vermögen aufzubauen, zu verwalten und für jede Lebenslage vorzusorgen. Unser Konzept umfasst die Bereiche Sparen, Vermögensaufbau und Altersvorsorge.</p>\n<p><strong>Wichtige Fakten</strong></p>\n<ul>\n<li>Wir haben mehr als 40.000 Kunden, die unseren hervorragenden Dienstleistungen vertrauen.</li>\n<li>Wir verwalten für unsere Kunden mehr als 300.000.000 CHF.</li>\n<li>Wir betreuen unsere Kunden mit mehr als 50 Fonds mit unterschiedlichen Strategien.</li>\n<li>Unser Umsatz im Jahr 2018 betrug über 100 Mio. CHF und wir wachsen stetig weiter.</li>\n</ul>\n<p>Wir haben zwei Standorte, einen in <strong>Ruggell</strong>, Liechtenstein und einen in <strong>Berlin</strong>, Deutschland und sind ein Team von mehr als 65 Mitarbeitern.\nIn <strong>Ruggell</strong> sind sowohl unsere Holdinggesellschaft als auch unsere Geschäftsstellen für Lebensversicherungen verankert. In <strong>Berlin</strong> befindet sich das Büro unserer digitalen Einheit, der <strong>Prosperity.app</strong>, und ist vertreten mit Tech, HR, Produkt &amp; Marketing.</p>\n<p><a href=\"http://t3u1.mjt.lu/lnk/AM0AAGBDvoAAAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBeKBVoVVc_MIRQSJC35gg7SVPlGAAGCXo/2/CYVAX04NgHPcZ8LhqvX_Cw/aHR0cHM6Ly90aGVwcm9zcGVyaXR5LmNvbXBhbnkv\">➡ Zur Website der Holding</a>\n<a href=\"http://t3u1.mjt.lu/lnk/AM0AAGBDvoAAAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBeKBVoVVc_MIRQSJC35gg7SVPlGAAGCXo/3/5rnC29qplZHULdiWSe1Seg/aHR0cHM6Ly93d3cubGllY2h0ZW5zdGVpbmxpZmUuY29tLw\">➡ Zur Website der Liechtenstein Life</a>\n<a href=\"http://t3u1.mjt.lu/lnk/AM0AAGBDvoAAAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBeKBVoVVc_MIRQSJC35gg7SVPlGAAGCXo/4/QCz9uoAn-9aWNl3NdOw8sg/aHR0cHM6Ly93d3cubGlua2VkaW4uY29tL2NvbXBhbnkvcHJvc3Blcml0eS1hcHAv\">➡ Mehr über prosperity.app auf LinkedIn</a></p>\n<p><strong>Deine Aufgaben</strong></p>\n<ul>\n<li>Design, Entwicklung und Wartung unserer Frontend &amp; Backend-Anwendungen</li>\n<li>Arbeite mit unserer Microservices-Architektur und füge neue Backend-Services hinzu in Node oder Python</li>\n<li>Entwicklung von interaktiven, dynamischen UX-Lösungen mit Javascript &amp; React</li>\n<li>Direkte Zusammenarbeit mit Product Ownern und Backend-Entwicklern in einer agilen Arbeitsumgebung</li>\n<li>Mitgestaltung der Produkt- und Technologie-Roadmap für die nächsten Jahre</li>\n</ul>\n<p><strong>Dein Profil</strong></p>\n<ul>\n<li>Vier Jahre Erfahrung als Fullstack Entwickler</li>\n<li>Kenntnisse in HTML5, CSS3 und JavaScript</li>\n<li>Experte in React, Node.JS oder Python, insbesondere aktueller Versionen</li>\n<li>Kenntnisse in PostgreSQL &amp; Java ist \"nice to have\"</li>\n<li>Ausgezeichnete Motivation und Kommunikationsfähigkeiten</li>\n<li>Ein Bekenntnis zu hoher Qualität und ein proaktiver Problemlösungsansatz</li>\n<li>Offen für die Arbeit mit neuen Technologien</li>\n<li>Deutsch und/oder Englisch in Wort und Schrift</li>\n</ul>\n<p><strong>Was wir bieten</strong></p>\n<ul>\n<li>Flexible Arbeitszeiten. Wir bauen auf Vertrauen, nicht auf Kontrolle</li>\n<li>Ein dynamisches Arbeitsumfeld mit einer Kultur, die aufgeschlossen und innovativ ist</li>\n<li>Ein tolles Team, mit dem du Spaß haben wirst</li>\n<li>Übernimm vom ersten Tag an die volle Verantwortung, eine steile Lernkurve ist garantiert</li>\n<li>Sunny Office im Herzen von Kreuzberg</li>\n<li>Kostenlose Getränke und regelmäßige Team-Mittagessen</li>\n<li>Arbeite mit den neuesten Technologie-Tools und dem neuesten MacBook</li>\n</ul>\n<p><img src=\"https://camo.githubusercontent.com/a16fc9a97a234a7ef2f9bd7d317e3d6bb4611a82/68747470733a2f2f747261636b696e672e676f686972696e672e636f6d2f682f65326436653732383461393365343135633339613232653063306465646439313563643134306162376630333637333134356535376565623861306138313934\"></p>\n",
        "how_to_apply": "<p><a href=\"https://tracking.gohiring.com/h/4d5be32a278ba22385a2ee73969850b8cfdc57df5372fb8abc56419e4ddd344e\">application form</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcmQ4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f3f9a0bda4a83d2e94beddeeaf88b55f92e77805/prosperity%20company.png"
    },
    {
        "id": "3b9160cc-278b-42de-96a5-d60b3fb8ea0b",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/3b9160cc-278b-42de-96a5-d60b3fb8ea0b",
        "created_at": "Tue Jan 21 13:34:17 UTC 2020",
        "company": "RazorSecure",
        "company_url": "https://www.razorsecure.com",
        "location": "Basingstoke",
        "title": "Frontend Developer and DevOps Jobs",
        "description": "<p>RazorSecure is a highly disruptive cyber security SaaS provider that has invented a novel security technology initially for the transportation sector (rail, air, automotive), but with wide-reaching applications to protect critical infrastructure across global markets. We are a small team and our product delivery, reliability and scale exceeds our size. We do this with the best people, best tools and a culture of working together to solve complex problems. Will you be our next teammate to take on this challenge?</p>\n<p>We are looking for two new teammates: a Frontend Developer and Full Stack Developer with DevOps Specialism.</p>\n<p><strong>We need a Frontend Developer</strong></p>\n<p>Our data-intensive dashboard, and accompanying visualisations, are the primary interface with our customers. They have to be reliable, fast and clearly communicate a broad range of security and operational information. Our legacy dashboard needs an overhaul and this is an opportunity to input a lot of creative direction into the tools and technology we should use.</p>\n<p>If this is you, see below for details!</p>\n<p><strong>We also need a Full Stack Developer (DevOps)</strong></p>\n<p>Delivering high availability security services for critical infrastructure is hard. We have to automate many processes and use best-in-class operational tools. We do this with a DevOps culture across the entire team, but your role will focus on building and maintaining the supporting tools, automation, and processes.</p>\n<p>If this is you, see below for details!</p>\n<p><strong>Practical Requirements for either job</strong></p>\n<ul>\n<li>Living in the United Kingdom, ideally available to work from our office in Basingstoke. Working from other countries possible, via special arrangement.</li>\n<li>Must be eligible to work in the UK</li>\n<li>Available for at least 4 days a week, preferably full-time.</li>\n</ul>\n<p><strong>Benefits for either job</strong></p>\n<ul>\n<li>Challenging work in an interesting field with some awesome technology.</li>\n<li>Being part of a fast-growing company with an energetic and ambitious team.</li>\n<li>A culture focused on delivering high quality code while having fun</li>\n<li>Competitive salary and share options.</li>\n<li>Pension and flexible holiday arrangements.</li>\n</ul>\n<p><strong>Frontend Developer job details</strong></p>\n<p>The job involves:</p>\n<ul>\n<li>Develop and maintain a data-rich dashboard, with accompanying reports and visualisations.</li>\n<li>Translating brief from design to clean, well-written code</li>\n<li>Build a comprehensive frontend testing suite both stubbed for unit testing and integrated for end-to-end testing.</li>\n<li>Coach and support other team members in building new features with a frontend component.</li>\n<li>Stay current with industry trends and source new ways for our business to improve.</li>\n<li>Get involved with full-stack end-to-end delivery of new features and bug fixes.</li>\n<li>Supporting the agile development process including taking on rotating team roles, participating in planning and retrospectives.</li>\n<li>Integrate our software with partner systems and provide technical support to customers where needed.</li>\n<li>Maintaining internal and external documentation associated with the product, and internal development activities.</li>\n</ul>\n<p>We are looking for:</p>\n<ul>\n<li>Experience developing and deploying data-rich frontend applications</li>\n<li>Eye for design and able to deliver an application from a base specification</li>\n<li>Deep knowledge of their weapon of choice (React/Vue/Angular/other...)</li>\n<li>Good working knowledge of Linux, git and the command-line</li>\n<li>Committed to high engineering standards</li>\n</ul>\n<p>The cherry on the cake:</p>\n<ul>\n<li>Attitude of continuous improvement.</li>\n<li>Can design and communicate complex software architectures.</li>\n<li>Deployed software agents to a range of hardware.</li>\n<li>Worked in a security function.</li>\n<li>Google-fu.</li>\n<li>Fluency in another spoken language.</li>\n<li>The tactical mastery of Iron Man.</li>\n<li>The detective skills of Batman.</li>\n<li>The situational awareness of Samus. (We'll hire you if you are Batman, or Iron Man, or Samus.)</li>\n</ul>\n<p><strong>Full Stack Developer (DevOps) job details</strong></p>\n<p>The job involves:</p>\n<ul>\n<li>Improve efficiency and effectiveness of development and operations.</li>\n<li>Mentor and support team members with DevOps tools and processes.</li>\n<li>Speed up delivery to production, while not impacting availability, security and performance.</li>\n<li>Stay current with industry trends and source new ways for our business to improve.</li>\n<li>Get involved with full-stack end-to-end delivery of new features and bug fixes.</li>\n<li>Supporting the agile development process including taking on rotating team roles, participating in planning and retrospectives.</li>\n<li>Integrate our software with partner systems and provide technical support to customers where needed.</li>\n<li>Maintaining internal and external documentation associated with the product, and internal development activities.</li>\n</ul>\n<p>We are looking for:</p>\n<ul>\n<li>Experience developing and deploying complex, data-rich and distributed applications.</li>\n<li>Supportive and creative attitude to solving team DevOps challenges.</li>\n<li>At least 1 year experience in developing in Python.</li>\n<li>Good working knowledge of Linux, git and the command-line.</li>\n<li>Familiarity with relational and NoSQL databases.</li>\n<li>Committed to high engineering standards.</li>\n</ul>\n<p>The cherry on the cake:</p>\n<ul>\n<li>Attitude of continuous improvement.</li>\n<li>Can design and communicate complex software architectures.</li>\n<li>Deployed software agents to a range of hardware.</li>\n<li>Worked in a security function.</li>\n<li>Google-fu.</li>\n<li>Fluency in another spoken language.</li>\n<li>The tactical mastery of Iron Man.</li>\n<li>The detective skills of Batman.</li>\n<li>The situational awareness of Samus. (We'll hire you if you are Batman, or Iron Man, or Samus.)</li>\n</ul>\n",
        "how_to_apply": "<p>Email your CV to <a href=\"mailto:jobs@razorsecure.com\">jobs@razorsecure.com</a>.</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb3g4IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--71ab0a65727bb46181094ae27b7282db7890db18/0.png"
    },
    {
        "id": "07b3ce1e-ecbd-11e8-9de2-0e34d5bd5011",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/07b3ce1e-ecbd-11e8-9de2-0e34d5bd5011",
        "created_at": "Tue Nov 20 12:09:59 UTC 2018",
        "company": "Mindhive",
        "company_url": "http://www.mindhive.org",
        "location": "Brisbane CBD Australia",
        "title": "Senior Front End and Backend Developers",
        "description": "<p><strong>MINDHIVE FRONTEND AND BACKEND DEVELOPER ROLES</strong></p>\n<p>An exciting opportunity exists to work at Mindhive [www.mindhive.org] - the world’s first crowdsourced consultancy. We're looking for an experienced backend developer as part of our core team to take on some of our most demanding challenges to build and create a platform that will improve productivity and in turn change the way Mindhive clients and contributors solve challenges. You will be working closely with the engineering lead and developers in an agile environment with a high degree of freedom.</p>\n<p><strong>Mindhive</strong></p>\n<p>Mindhive sets out to do things differently – we’re taking a unique approach to creating the future of problem solving. The Company's core product is Mindhive - a cloud-based platform where organisational users (who pay) bring challenges to be solved by a growing community of high-quality individual users (non-paying) with a broad range of professional backgrounds and experiences. The model enables organisational users to gather, share and evaluate ideas efficiently and effectively, and gain access to diverse approaches to solving difficult problems. The existing model requires curation and input by administrators and does not take full advantage of the rich data available.</p>\n<p>Since completing a successful capital raising in 2017, the Company has hired a world-class development team [and has partnered with a leading digital design company Joseph Mark] which has given it the capability to develop a more technically complex platform ecosystem-style product (‘Mindhive 2.0’). Mindhive 2.0 will be a revolutionary approach that is ambitious in scale but grounded in historical experience (from the current platform) and growing market appetite for crowdsourcing and artificial intelligence</p>\n<p><strong>SENIOR BACKEND DEVELOPER ROLE</strong></p>\n<p>As a backend developer, you will help design, implement, deploy &amp; support Mindhive’s platform which includes (and not limited to):</p>\n<p>Cloud services\nDatabase\nIntegrations (in-house &amp; third party)\nTests (unit &amp; integration)</p>\n<p><strong>What you’ll do</strong></p>\n<p>Primary responsibility: Implement services (backend API endpoints) for mobile first web apps\nAdditional key responsibilities include:</p>\n<p>Develop cloud-based API services\nDevelop in-house &amp; 3rdparty integration interfaces\nDevelop database models\nImplement automated tests\nDevelop CI/CD scripts\nDevelop performance and monitoring interfaces\nAnalyse business and technical requirements</p>\n<p><strong>What you’ll bring</strong></p>\n<p>Detailed understanding of cloud architecture(s)\nDetailed knowledge of Python &amp; Node.JS\nDetailed knowledge of Django\nDetailed knowledge of Docker\nExperience working with\nPostgres and NoSQL database(s)\nExperience with authentication protocols &amp; certificates\nBonus: detailed knowledge of machine learning &amp; AI</p>\n<p><strong>How do I level up?</strong></p>\n<p>Roles within reach for the employee - Development Team Lead</p>\n<p><strong>Bespoke Requirements / Additional Responsibilities</strong></p>\n<p>Develop and maintain software specifications and architecture documents\nProvide accurate work estimates\nEngage in regular check-ins and follow-up with other developers in the team\nFollow Mindhive’s product development process and methodology</p>\n<p><strong>SENIOR FRONTEND DEVELOPER ROLE OVERVIEW</strong></p>\n<p>As a frontend developer, you will help design, implement, deploy &amp; support Mindhive’s platform which includes (and not limited to):</p>\n<p>Web application\nMobile application\nIntegrations (in-house &amp; third party)\nTests (unit &amp; integration)</p>\n<p><strong>What you’ll do</strong></p>\n<p>Primary responsibility: Implement UX/UI for mobile first web and mobile apps</p>\n<p><strong>Additional key responsibilities include:</strong></p>\n<p>Utilise any and all relevant frameworks, libraries and techniques:</p>\n<p>JavaScript (Vue.js and React Native)\nHTML5, CSS3 and SCSS for design implementations\nLinux Command Line (for bonus points)\nDemonstrate use of modern development practices such as use of Object-Oriented Design, Web Services (REST), Version Control (utilizing Git), Build processes and packaging (Webpack, etc), Automated Testing and Responsive Website Development\nCut up and implement designs\nInform the product team of relevant possibilities and solutions\nDevelop integration with cloud-based API services (in-house &amp; third party)\nReview and inform database models are in alignment with frontend view models &amp; components\nImplement components unit tests and automated tests as required\nDevelop web/site/mobile app performance and monitoring interfaces\nAnalyse business and technical requirements\nMinimise bugs in released code</p>\n<p><strong>What you’ll bring</strong></p>\n<p>Experience with current industry design tools (e.g. Figma)</p>\n<p>Understanding, and preferably experience in, agile project methodology\nYou have experience with version control and project management systems\nCan work and communicate effectively within multidisciplinary teams\nKnowledge of Accessibility and Security Principles\nUndergraduate degree in IT or relevant programming experience\nImpeccable attention to detail\nInnovative thinking and problem solving\nCourteous, supportive and honest\nMotivated self-starter, with the ability to manage your own time and adhere to time and budget restrictions\nEnthusiasm for the work\nMindhive does and your important role in delivery\nCreative thinking &amp; abstract, technical problem solving\nProactivity\nCollaboration</p>\n<p><strong>How do I level up?</strong></p>\n<p>Roles within reach for the employee - Development Team Lead</p>\n<p><strong>Bespoke Requirements / Additional Responsibilities</strong></p>\n<p>Develop and maintain software specifications and architecture documents:\nProvide accurate work estimates\nEngage in regular check-ins and follow-up with other developers in the team\nFollow Mindhive’s product development process and methodology</p>\n",
        "how_to_apply": "<p>Email your resume to <a href=\"mailto:career@mindhive.it\">career@mindhive.it</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUpYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5a6c8dd1ece5763c8a6aeb215ff3189fd8ed3bd7/c540fe15-d18d-48bd-95de-cf0a85125293"
    },
    {
        "id": "c5901f00-ec36-11e8-8d10-e7913612ce87",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/c5901f00-ec36-11e8-8d10-e7913612ce87",
        "created_at": "Mon Nov 19 20:08:09 UTC 2018",
        "company": "Prezi",
        "company_url": "http://prezi.com",
        "location": "San Francisco ",
        "title": "Senior Full Stack Engineer ",
        "description": "<p>Prezi strives to enable people to share ideas with each other, using our extraordinary product in a provenly more engaging and more effective way by helping millions of people build and deliver moving stories.</p>\n<p>To help our business stay on mission, we are looking for a senior full stack engineer to join us working on projects around the awareness, consideration and acquisition stages of the user journey.. Some examples are content discovery, content virality, end-to-end signup and payment experience, all SEO, email infrastructure, high traffic, top of the funnel part of the website etc. All of that with a laser focus on iterative increments of customer value.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>\n<p>Make significant contributions to the business by working with a cross-functional team to provide expertise, ship high-quality work, and complex components.</p>\n</li>\n<li>\n<p>Work in an agile team and organization, continuously refine our own processes towards best team performance and most fun. Our Engineering Managers, Product Owners and Program Management Team are dedicated to supporting you with this.</p>\n</li>\n<li>\n<p>Work through a variety of technical challenges that will require creativity and close collaboration across internal functions (design, UX, sales, marketing, etc).</p>\n</li>\n<li>\n<p>Release early, release often, deploy to production from day one.</p>\n</li>\n<li>\n<p>Work with a toolchain across infrastructure, data, continuous integration, back end, front end and 3rd party integrations with new things to pick up on the way.</p>\n</li>\n<li>\n<p>Coordinate and own development projects from beginning to end. Plan, implement with your fellow engineers, release, measure, repeat.</p>\n</li>\n<li>\n<p>Contribute to building our dev tools and architecture to enable us to more quickly ship new features into production at scale. Dev teams dedicate 20% of their time to this, while we also rely on our Infrastructure Team to help with major, company-wide tooling and infrastructure support.</p>\n</li>\n<li>\n<p>Participate in hackathons and engineering days</p>\n</li>\n<li>\n<p>Learn from and share your knowledge with your team and colleagues on the go.</p>\n</li>\n</ul>\n<p><strong>Skills and traits we are looking for:</strong></p>\n<ul>\n<li>\n<p>A passion for delivering value to users</p>\n</li>\n<li>\n<p>Excellent communication skills, both verbal and written</p>\n</li>\n<li>\n<p>4+ years experience in developing web applications in production (e.g. backend using Django, Rails, Node frontend using Backbone, React, Bootstrap)</p>\n</li>\n<li>\n<p>A solid understanding of the full web technology stack (e.g. cloud infrastructure, HTTP, cookies, asset loading, caching, REST)</p>\n</li>\n<li>\n<p>Proficiency with servers, linux, cloud infrastructure, build systems, continuous integration</p>\n</li>\n<li>\n<p>A passion for clean, maintainable, well-tested code</p>\n</li>\n<li>\n<p>Experience working with applications at scale</p>\n</li>\n<li>\n<p>The ability to structure and build complex client side applications</p>\n</li>\n<li>\n<p>Knowledge of test automation of backend and frontend applications</p>\n</li>\n<li>\n<p>Extensive knowledge of responsive design, web standards and modern browsers</p>\n</li>\n<li>\n<p>Ability and willingness to learn fast and pick up new things easily</p>\n</li>\n</ul>\n<p><strong>Benefits:</strong></p>\n<ul>\n<li>\n<p>A work environment where people from all backgrounds can thrive and grow</p>\n</li>\n<li>\n<p>People who listen to your opinions and value them</p>\n</li>\n<li>\n<p>The opportunity to spend time working at our Budapest office</p>\n</li>\n<li>\n<p>The opportunity to go to tech conferences anywhere in the world</p>\n</li>\n<li>\n<p>Flexible working hours and untracked vacations</p>\n</li>\n<li>\n<p>Quality meals, snacks, drinks every day</p>\n</li>\n<li>\n<p>A fun office with community activities, outings, presentations, office bar, happy hours, ping-pong/pool/foosball, a bar and sports leagues.</p>\n</li>\n<li>\n<p>A centrally located office in downtown San Francisco</p>\n</li>\n<li>\n<p>401k plan</p>\n</li>\n<li>\n<p>Health, dental and vision insurance</p>\n</li>\n<li>\n<p>Commuter benefits</p>\n</li>\n</ul>\n",
        "how_to_apply": "<p><a href=\"https://grnh.se/d5687acb1\">https://grnh.se/d5687acb1</a></p>\n",
        "company_logo": null
    },
    {
        "id": "7d0d5cf0-ec1f-11e8-9834-c8e30f51c014",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/7d0d5cf0-ec1f-11e8-9834-c8e30f51c014",
        "created_at": "Mon Nov 19 17:21:35 UTC 2018",
        "company": "Simons Foundation",
        "company_url": null,
        "location": "New York, New York",
        "title": "Web Developer",
        "description": "<p>POSITION SUMMARY</p>\n<p>This role will support the maintenance of several websites hosting editorially independent online publications covering research in autism, data and life sciences, mathematics and physics, as well as sites providing information about the foundation's support of basic and applied research.</p>\n<p>ESSENTIAL FUNCTIONS/RESPONSIBILITIES</p>\n<ul>\n<li>Support back-end and front-end web development for a diverse collection of foundation-affiliated websites, many built on WordPress</li>\n<li>Work collaboratively and closely with editors, front-end designers, web producers and other developers</li>\n<li>Effectively manage priorities for multiple concurrent projects</li>\n<li>Communicate with stakeholders to gather requirements and ensure their needs are being met</li>\n<li>Adapt to changing requirements</li>\n<li>Perform any other duties or tasks as assigned or required</li>\n</ul>\n<p>MINIMUM QUALIFICATIONS</p>\n<p>Education</p>\n<ul>\n<li>A bachelor's degree is required</li>\n</ul>\n<p>Experience</p>\n<ul>\n<li>Proficient with WordPress, with 3+ years of experience developing custom WP sites</li>\n<li>Advanced expertise with PHP and MySQL</li>\n<li>Deep understanding of HTML and CSS</li>\n<li>Experience with JavaScript and jQuery</li>\n<li>Experience with React or similar JS libraries or frameworks</li>\n<li>Experience with responsive web development</li>\n<li>Excellent communication skills</li>\n<li>Proficient with version control tools, such as Git and SVN.</li>\n<li>Portfolio of work products that function well on multiple device types</li>\n</ul>\n<p>Desirable</p>\n<ul>\n<li>Background in User Experience and User Interface design</li>\n<li>Experience with Python and Django</li>\n<li>Experience with responsive web design, integration and usability testing</li>\n<li>Experience with high-volume websites and/ or journalistic websites</li>\n<li>Comfort with Adobe Creative Cloud</li>\n</ul>\n<p>THE SIMONS FOUNDATION'S DIVERSITY COMMITMENT</p>\n<p>Many of the greatest ideas and discoveries come from a diverse mix of minds, backgrounds and experiences, and we are committed to cultivating an inclusive work environment. The Simons Foundation provides equal opportunities to all employees and applicants for employment without regard to race, religion, color, age, sex, national origin, sexual orientation, gender identity, genetic disposition, neurodiversity, disability, veteran status, or any other protected category under federal, state and local law.</p>\n<p>Apply Here:   <a href=\"http://www.Click2apply.net/tnq3zqdz2zmwb8qt\">http://www.Click2apply.net/tnq3zqdz2zmwb8qt</a></p>\n<p>PI105651217</p>\n",
        "how_to_apply": "<p><a href=\"http://www.Click2apply.net/tnq3zqdz2zmwb8qt\">http://www.Click2apply.net/tnq3zqdz2zmwb8qt</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUJYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5cec1fa3eb8f8a921945829b6e04fc43744f727e/29ad9da4-09d2-432c-bd49-6ad83582c9e8"
    },
    {
        "id": "cd535970-ec11-11e8-89ae-2e904411ec0e",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/cd535970-ec11-11e8-89ae-2e904411ec0e",
        "created_at": "Mon Nov 19 15:44:44 UTC 2018",
        "company": "Aon Cyber Solutions",
        "company_url": "http://www.strozfriedberg.com/careers",
        "location": "NY or LA",
        "title": "Cybersecurity Firm Seeks Senior Developer",
        "description": "<p>Aon Cyber Solutions is looking for a Senior Developer in NY or LA. As part of an industry-leading team, you will help empower results for our clients by delivering innovative and effective solutions supporting Risk.</p>\n<p>APPLY HERE: <a href=\"https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job\">https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job</a></p>\n<p>Position Overview\nJoin our expert software development team to create new customer-facing web applications. You will apply your expertise in web development and user interface design, working in concert with subject matter experts in digital forensics, incident response, cybersecurity, and threat intelligence. Your applications will convey deeply technical facts and analyses to a variety of consumers, from risk managers to subject matter experts to C-level executives.</p>\n<p>The responsibilities of this position include but are not limited to the following:</p>\n<ul>\n<li>Design and develop pioneering web applications that cross the boundaries of security assessment, digital forensics, incident response, malware analysis, cybersecurity, and cyberinsurance.</li>\n<li>Serve as a senior developer on multiple product teams.</li>\n<li>Create user interfaces, APIs, data visualizations, and reports that provide our clients with insight into complex narratives and data sets.</li>\n<li>Translate high-level requirements into working prototypes to generate user feedback and discussion.</li>\n<li>Adapt and apply cutting edge computer science to highly technical domains.</li>\n<li>Participate in code reviews, write test suites, profile components, and take ownership of our software, source code, tools, and processes.</li>\n<li>Mentor other developers.</li>\n<li>Contribute to a positive, collaborative culture for innovation.</li>\n</ul>\n<p>Requirements</p>\n<ul>\n<li>5+ years of software engineer experience.</li>\n<li>Proficiency in frontend technologies (React, Node.js, Webpack).     Experience working with relational and NoSQL databases.</li>\n<li>Strong knowledge of HTTP and REST web services implementation.</li>\n<li>Test driven development and unit testing frameworks.</li>\n<li>Modern DevOps experience.</li>\n<li>Standard software engineering tools (git, Jenkins, JIRA).</li>\n<li>The proven ability to see things as they should be, and to realize that vision.</li>\n<li>Comfort with agile development and remote team environments.</li>\n<li>Excellence in verbal and written communication.</li>\n</ul>\n<p>Desired Skills</p>\n<ul>\n<li>TypeScript</li>\n<li>Python 3 and web frameworks such as Django or Flask.</li>\n<li>SQL &amp; relational database modeling.</li>\n<li>Experience in deployment to AWS, especially serverless technologies.</li>\n<li>Strong knowledge of JWT and various web security models.</li>\n<li>D3.js, Vega, Bokeh, Leaflet, and other browser visualization libraries.   Experiment-driven design and iterative features-based development (A/B testing, etc.).</li>\n<li>ElasticSearch, Apache Kafka, AWS Kinesis, PostgreSQL, AWS Aurora.</li>\n<li>Java 8 and other JVM-based languages.</li>\n<li>Performance monitoring and optimization.</li>\n<li>Mobile development using Native or Cross-platform (Xamarin, Ionic, React Native).</li>\n</ul>\n<p>Education Required</p>\n<ul>\n<li>BS or BA in Computer Science, Mathematics, or Statistics, or equivalent experience.</li>\n</ul>\n",
        "how_to_apply": "<p>APPLY HERE: <a href=\"https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job\">https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job</a></p>\n",
        "company_logo": null
    },
    {
        "id": "ea94c57c-d0a1-11e8-9676-0d02532e57f6",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/ea94c57c-d0a1-11e8-9676-0d02532e57f6",
        "created_at": "Fri Nov 16 20:14:47 UTC 2018",
        "company": "Analytics Fire",
        "company_url": "http://analyticsfire.com",
        "location": "North America",
        "title": "Solutions Architect - IoT/Python/React (US/Canada)",
        "description": "<p><strong>Job Description</strong></p>\n<p>Analytics Fire builds custom data analytics software for the solar power industry. We’re looking for a hands-on Solutions Architect to help us scale our execution to support additional new high-tech sectors.</p>\n<p>Analytics Fire is a deeply technical engineering organization. Most of us are software engineers and spend the majority of our time on heads down engineering activities like coding. Our goal in creating this position is to expand our small client-facing team with a unique person that has both the personality and the technical skill set to collaborate directly with clients and senior members of the technical team in order to help steer technical decision making and requirements gathering, especially early in the project lifecycle.</p>\n<p>This position is similar to that of a technical Program Manager, but you will be much more involved in the technical details and hurdles around software deployments and releases than a traditional Project Manager would be. Our ideal candidate is a current or former embedded Software Engineer, full stack Software Engineer, or Data Engineer that has been previously trained as a Program Manager or is willing to be trained in formal Program Management processes.</p>\n<p>As a small company, Analytics Fire is able to tailor roles around the strengths of our individual team members. We will tailor this role to your specific technical background. However, it is a hard requirement that you are able to support the following 3 types of responsibilities:</p>\n<ul>\n<li>(a) Represent Analytics Fire software engineering teams in client-facing interactions (and sometimes interactions with potential clients)</li>\n<li>(b) Technical writing responsibilities such as documenting requirements, project plans, system architecture, etc.</li>\n<li>(c) Making meaningful contributions to the execution of complex software projects.</li>\n</ul>\n<p>For reference, here is a list of some technologies we are currently actively using on a day-to-day basis:</p>\n<ul>\n<li>Front-end: JavaScript / React / Angular</li>\n<li>Back-end: Ruby / Python / Node.js</li>\n<li>Embedded: Embedded Linux, Yocto, C, MQTT</li>\n<li>CV: OpenCV, PCL, object identification and tracking</li>\n<li>ML: TensorFlow, OpenCV, adaptive parametric modeling, ADTs, N-Dimensional Transforms</li>\n<li>Modern software techniques: RESTful APIs, SOA, PaaS, etc</li>\n<li>Agile collaboration and DevOps tools: Github, Trello, Slack, Chef, Ansible, Docker, Vagrant, etc</li>\n<li>Other technologies we are currently building with: AWS, GCP, Salesforce platform, ARKit</li>\n</ul>\n<p>Your primary responsibility will be to assist in guiding new projects through sales, planning, development, and deployment. This will be accomplished through a combination of client interactions, technical writing, and participation in formal sales, program management, and engineering related processes. Your contributions will naturally be slightly front-loaded towards the sales and planning phases, however you will remain deeply connected to each project through the entire lifecycle in order to ensure conceptual integrity is maintained from design to final implementation.</p>\n<p>This is a remote position but is only open to candidates living in the US or Canada. We’re flexible about location and hours. We’re a really great match for candidate who wants to work hard on interesting projects, while also having flexibility around time and geography.</p>\n<p><strong>Skills &amp; Requirements</strong></p>\n<p>“Must have” requirements:</p>\n<ul>\n<li>5+ years relevant hands-on experience as an embedded Software Engineer, full stack Software Engineer, or Data Engineer, ideally within a commercial startup environment.</li>\n<li>Fluency around current modern best practices around software development, data engineering, and DevOps.</li>\n<li>Soft skills necessary to navigate and negotiate with multiple teams, both internal and external to Analytics Fire.</li>\n<li>Ability and willingness to familiarize yourself with our technical stack.</li>\n<li>Superior organization and detail orientation.</li>\n<li>Excellent written and verbal communication skills.</li>\n<li>Willingness to design, document, and evangelize new engineering processes to meet evolving organizational requirements.</li>\n</ul>\n<p>“Nice to have” requirements:</p>\n<ul>\n<li>Former work experience or training as a technical Program Management.</li>\n<li>Deep technical experience with C, Python, or ReactJS</li>\n</ul>\n<p><strong>About Analytics Fire</strong></p>\n<p>Analytics Fire was founded by a couple of data-nerds -- one a PHd in machine learning and the other a former VP of Engineering for an analytics platform -- who both are also serial entrepreneurs backed by prominent angels and VCs including Y Combinator and 500 Startups.</p>\n<p>“We founded Analytics Fire to create the engineering department that we always dreamed of working for. To us that means being able to spend our time working on interesting technical problems, while simultaneously having flexibility around time and geography and being part of a small, tightly-knit team of world-class engineers.”</p>\n",
        "how_to_apply": "<p>Email your resume to <a href=\"mailto:join-us@analyticsfire.com\">join-us@analyticsfire.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcUZYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b27fcb2989980ffe97f523d96c3b02c68b72a096/bd4a117a-d891-43d1-ba57-e24930cd01ab"
    },
    {
        "id": "0e46406e-d0a1-11e8-828b-ee6df9cc51d4",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/0e46406e-d0a1-11e8-828b-ee6df9cc51d4",
        "created_at": "Fri Nov 16 20:13:18 UTC 2018",
        "company": "Analytics Fire",
        "company_url": "http://analyticsfire.com",
        "location": "North America",
        "title": "Release Manager - IoT/Python/React (US/Canada)",
        "description": "<p><strong>Job Description</strong></p>\n<p>Analytics Fire builds custom data analytics software for the solar power industry. We’re looking for a hands-on Release Manager to help us scale our execution to support additional new high-tech sectors.</p>\n<p>Analytics Fire is a deeply technical engineering organization. Our goal in creating this position is to expand our small client-facing team with a unique person that has both the technical skillset and the personality to maintain highly coordinated relationships with key internal and client-side stakeholders in order to help proactively guide projects through planning, development, deployment, release, and DevOps.</p>\n<p>This position is similar to that of a technical Program Manager, but you will be much more involved in the technical details and hurdles around software deployments and releases than a traditional Project Manager would be. Our ideal candidate is a current or former embedded Software Engineer, full stack Software Engineer, or Data Engineer that has been previously trained as a Program Manager or is willing to be trained in formal Program Management processes.</p>\n<p>As a small company, Analytics Fire is able to tailor roles around the strengths of our individual team members. We will tailor this role to your specific technical background and skill set    . However, ability to support client-facing interactions (clarifying requirements, negotiating technical approaches, reporting on status, etc) as well as make meaningful internal contributions in a highly technical environment is a hard requirement.</p>\n<p>For reference, here is a list of some technologies we are currently actively using on a day-to-day basis:</p>\n<ul>\n<li>Front-end: JavaScript / React / Angular</li>\n<li>Back-end: Ruby / Python / Node.js</li>\n<li>Embedded: Embedded Linux, Yocto, C, MQTT</li>\n<li>CV: OpenCV, PCL, object identification and tracking</li>\n<li>ML: TensorFlow, OpenCV, adaptive parametric modeling, ADTs, N-Dimensional Transforms</li>\n<li>Modern software techniques: RESTful APIs, SOA, PaaS, etc</li>\n<li>Agile collaboration and DevOps tools: Github, Trello, Slack, Chef, Ansible, Docker, Vagrant, etc</li>\n<li>Other technologies we are currently building with: AWS, GCP, Salesforce platform, ARKit</li>\n</ul>\n<p>Description of responsibilities:</p>\n<ul>\n<li>Develop and maintain well-coordinated relationships with key internal and client-side stakeholders to help drive decision making around production software releases, data engineering, and DevOps.</li>\n<li>Participate in collaborative planning discussions and technical decision making early in the project lifecycle to ensure that key decisions are made with reliability, testability, and maintenance in mind.</li>\n<li>Monitor and oversee coordination, integration, flow of development, testing, and deployment around multiple parallel projects and threads of engineering execution.</li>\n<li>Drive planning and delivery of high quality software releases: Manage change control process during releases, Continuously improve company release processes, Proactively identify and mitigate risks and remove obstacles to releases</li>\n<li>Personally plan and lead the team through our most important software releases. Advise and support the team so that they can take on less critical releases on a day-to-day basis.</li>\n<li>Continually integrate the QA team and testing engineers into both the requirements gathering and software development processes and report status to clients on a very frequent basis.</li>\n</ul>\n<p>This is a remote position but is only open to candidates living in the US or Canada. (Note: we may be open to US or Canadian citizens living abroad in US-overlapping time zones on a case by case basis.) We’re flexible about location and hours. We’re a really great match for candidate who wants to work hard on interesting projects, while also having flexibility around time and geography.</p>\n<p><strong>Skills &amp; Requirements</strong></p>\n<p>“Must have” requirements:</p>\n<ul>\n<li>Soft skills necessary to develop and maintain well-coordinated relationships with key internal and client-side stakeholders to help drive decision making around production software releases, data engineering, and DevOps.</li>\n<li>3+ years hands experience as an embedded Software Engineer, full stack Software Engineer, or Data Engineer, ideally within a commercial startup environment.</li>\n<li>Familiarity with current modern best practices around software development, data engineering, and DevOps</li>\n<li>Ability and willingness to familiarize yourself with the specific technical stacks that we use.</li>\n<li>Superior organization and detail orientation.</li>\n<li>Excellent written and verbal communication skills.</li>\n<li>Willingness to design, document, and evangelize new engineering processes to meet evolving organizational requirements.</li>\n</ul>\n<p>“Nice to have” requirements:</p>\n<ul>\n<li>Hands-on technical experience writing code in C, C++, Python, ReactJS</li>\n<li>Previous experience as a technical Program Manager.</li>\n</ul>\n<p><strong>About Analytics Fire</strong></p>\n<p>Analytics Fire was founded by a couple of data-nerds -- one a PHd in machine learning and the other a former VP of Engineering for an analytics platform -- who both are also serial entrepreneurs backed by prominent angels and VCs including Y Combinator and 500 Startups.</p>\n<p>“We founded Analytics Fire to create the engineering department that we always dreamed of working for. To us that means being able to spend our time working on interesting technical problems, while simultaneously having flexibility around time and geography and being part of a small, tightly-knit team of world-class engineers.”</p>\n",
        "how_to_apply": "<p>Email your resume to <a href=\"mailto:join-us@analyticsfire.com\">join-us@analyticsfire.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcUpYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--84c33b065f8858b28e9e161159f1d7f0a1333cd7/5c0bda92-4866-495d-a81e-7dd119cfae7b"
    },
    {
        "id": "b99f4c2c-e94b-11e8-8abf-17c73d6427e2",
        "type": "Contract",
        "url": "https://jobs.github.com/positions/b99f4c2c-e94b-11e8-8abf-17c73d6427e2",
        "created_at": "Fri Nov 16 03:01:16 UTC 2018",
        "company": "Ikayzo",
        "company_url": "http://ikayzo.com",
        "location": "Vancouver (remote)",
        "title": "Senior Software Engineer - Ruby on Rails / React ",
        "description": "<p><strong>Remote position for Vancouver, BC residents</strong></p>\n<p><a href=\"http://ikayzo.com\">Ikayzo</a>, a boutique software development firm based in Honolulu, is looking for experienced Ruby on Rails developers with strong React skills capable of taking complex projects from ideation to release. In this role he / she will be responsible for building high quality, secure and scalable web applications in the finance / fintech space. Our customers include industry leading software firms, renewable energy companies and financial institutions.</p>\n<p>Please provide your GitHub profile or another work example reference in your resume.</p>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>A solid grounding in OO software architecture / design patterns</li>\n<li>A pragmatic approach focused on delivering on-time while maintaining quality</li>\n<li>Experience designing and implementing successful non-trivial enterprise Ruby on Rails projects (5+ years)</li>\n<li>Experience with ReactJS (Reflux or Redux)</li>\n<li>Experience with agile development methodologies</li>\n<li>Comfort with Git Feature Branch Workflow and the ability to incorporate PR feedback quickly</li>\n<li>Firm grasp of data modeling</li>\n<li>A passion for software development</li>\n</ul>\n<p><em>Note: Specialized finance domain knowledge is not required but successful applicants must be able to quickly understand complex business rules and calculations.</em></p>\n<p>We are not accepting applications from recruiters for this position.</p>\n",
        "how_to_apply": "<p>Send resumes to <a href=\"mailto:career@ikayzo.com\">career@ikayzo.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdnRXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fe74b61172b5e2551482923d6459b31814afbde1/a4dc87ba-891e-4dc3-a3e8-30201cbdbacc"
    },
    {
        "id": "18f5af34-e8c7-11e8-85f6-109da02adff9",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/18f5af34-e8c7-11e8-85f6-109da02adff9",
        "created_at": "Thu Nov 15 11:12:09 UTC 2018",
        "company": "Sterblue",
        "company_url": "https://www.sterblue.com",
        "location": "Remote Job",
        "title": "Lead front-end engineer",
        "description": "<p>Lead front-end engineer\n\nJob description\nSterblue builds software for Drones to inspect Wind Turbines and Power Lines automatically using Artificial Intelligence. From automatic 3D navigation around infrastructures to online reports and automatic defect detection, we automate the entire inspection process to help energy and utility companies strive for a cleaner future.\n\nWe are looking for a Senior or Lead web front-end and mobile developer with experience in UI/UX, that will be able to help manage our team operationally and technically. At Sterblue, you will:</p>\n\n\n\n",
        "how_to_apply": "<p>Apply here</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdGhXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d17ed9dcb168d5f4124e2fab7b976d8f9c27947c/659f247c-8395-473d-956d-ff1c0b1ec3f6"
    },
    {
        "id": "3777f9aa-e749-11e8-81e9-7454c0cb0145",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/3777f9aa-e749-11e8-81e9-7454c0cb0145",
        "created_at": "Tue Nov 13 13:37:46 UTC 2018",
        "company": "VONQ",
        "company_url": "http://www.vonq.com",
        "location": "Rotterdam",
        "title": "Senior Frontend Engineer",
        "description": "<p>Make impact on a unique product that has a big potential to grow! At VONQ we help companies attract more qualified applicants. We are growing and in the transition to a software driven business, so there is a lot of exciting stuff to get done! As a Frontend specialist you know like no other how important a smooth customer journey is, and you make users dazzle with your skills! Up for the challenge? Apply at VONQ for Frontend Developer in Rotterdam!</p>\n<p>Senior Frontend Developer\nRotterdam, fulltime, asap</p>\n<p>Make tools people love to use and create the ultimate customer journey\nAs a Frontend expert at VONQ you’ll have a huge contribution to our core product: the Job Marketing Platform (JMP). It’s a big data-driven application with a recommendation engine to help recruiters market jobs online.</p>\n<p>The platform is used daily by our customers and we have an ambitious roadmap to build it out to out further. Make it work better, give more insights and create the ultimate customer journey. And that’s where you come in!</p>\n<p>What your actual job looks like</p>\n<ul>\n<li>You’ll work in an agile multidisciplinary team: pairing, code reviews and giving/receiving feedback is something you’ll do regularly</li>\n<li>In order to create awesome interfaces for our clients, you’ll work closely together with both Backend specialists and UX Designers. You know like no other how to turn design into working software!</li>\n<li>You’ll work on creating the ultimate customer journey &amp; data visualisations</li>\n<li>You’ll make sure that the JMP is good working and you are always looking for ways to improve further and implement new features.</li>\n<li>You’ll enjoy the state of your code: regular refactoring, and maintaining a good test coverage is in or normal workflow.</li>\n</ul>\n<p>You will be part of an international and experienced Engineering department consisting of Backend and Frontend Developers, Data- and DevOps Engineers, an Agile Coach and a CTO.</p>\n<p>What our perfect picture looks like\nThis describes the ideal candidate, but above all we value people that are eager to grow, autonomous, work together, and love to get things done! Furthermore we think you need:</p>\n<ul>\n<li>3+ year experience as a Frontend Developer and an Agile mindset</li>\n<li>Excellent English communication skills</li>\n<li>Experience with HTML, CSS (SCSS), JavaScript (ES2015+)</li>\n<li>Experience with React, and ideally Redux, BEM methodology, unit testing (Jest), and E2E testing (Cucumber)</li>\n<li>Affinity and experience with data visualisations</li>\n<li>A passion for building tools!</li>\n</ul>\n<p>Bonus points!</p>\n<ul>\n<li>It’s an absolute plus if you are a Frontend specialist with a full stack mindset: having backend and/or devops experience (PHP)!</li>\n</ul>\n<p>This is why you should join our team\nWe promise that at VONQ you’ll never stop learning! You’ll be surrounded by international and experienced colleagues, so prepare yourself for some interesting and intellectual conversations.</p>\n<p>Our product has still a lot of potential to grow, and YOU can make impact on that. You’ll get freedom and space for own initiatives, in fact, we encourage you!</p>\n<p>We have legendary company outing, beers on Friday and lots of FUN!</p>\n<p>There is more! We offer:</p>\n<ul>\n<li>A good salary, 8% holiday allowance</li>\n<li>100% commuting expenses compensation</li>\n<li>Pension contribution</li>\n<li>Flexible working hours</li>\n<li>Unlimited (paid!) holidays</li>\n<li>Time and budget for training</li>\n<li>Relocation support, and more!</li>\n</ul>\n<p>Are you ready to build with us on the ultimate customer journey and bring recruitment marketing to a new dimension? \nApply by clicking on this application link. Questions? Reach out to Sarah (Recruiter) -&gt; <a href=\"mailto:sarahellithy@vonq.com\">sarahellithy@vonq.com</a>.</p>\n",
        "how_to_apply": "<p>Apply by clicking on this application link</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBckZXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ae4319e87cef323b478629e1d524e6d538f11c7a/3e1e34df-ce1e-4895-9c04-1cca435ae0fc"
    },
    {
        "id": "96b72c48-85d2-11e8-8bb0-af6957d6ca0a",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/96b72c48-85d2-11e8-8bb0-af6957d6ca0a",
        "created_at": "Mon Nov 12 16:56:33 UTC 2018",
        "company": "Bene Studio Ltd.",
        "company_url": "http://www.benestudio.co",
        "location": "Budapest",
        "title": "Senior Full-stack React and Node Engineer - Full Relocation to Budapest",
        "description": "<p>TO BUILD PRODUCTS</p>\n<ul>\n<li>which are diverse, from healthcare to real estate</li>\n<li>making better the lives of the people globally</li>\n<li>with the latest JavaScript technologies</li>\n<li>using your creativity, empowerment and team player attitude</li>\n</ul>\n<p>TO GAIN EXPERIENCE</p>\n<ul>\n<li>from the varied, 1-6 months long projects</li>\n<li>within the English-speaking, international, growing team of highly skilled engineers,</li>\n<li>who passed the famously challenging bene : studio assessment</li>\n<li>during the journey of your Professional Development Plan</li>\n<li>with the help of your dedicated Mentor</li>\n</ul>\n<p>TO REFRESH YOURSELF</p>\n<ul>\n<li>by enjoying the flexible schedule</li>\n<li>relying on the stable, calculable job and salary</li>\n<li>in the team which won the Loveable Workplace Prize</li>\n<li>at the bike, dog and family friendly Office of the Year 2016, where you can have a massage, play ping\npong or drink a coffee/fröccs at the in-house café</li>\n</ul>\n<p>TO SHARE YOUR KNOWLEDGE</p>\n<ul>\n<li>as a Mentor within the team</li>\n<li>at our blog or one of the leading meetups, conferences</li>\n<li>at bene : studio Workshops!, the most popular cutting-edge tech workshops in Hungary</li>\n</ul>\n<p>TO RELOCATE</p>\n<ul>\n<li>into the heart of Europe, to the beautiful, safe and cheap Budapest</li>\n<li>with the adaptation guidance, flight ticket, temporary housing and visa services provided by us</li>\n</ul>\n<p>TO RECEIVE FROM US</p>\n<ul>\n<li>a MacBook Pro</li>\n<li>HUF 450 000 – HUF 710 000 net salary (calculated for full time)</li>\n<li>with paid leaves and sick-leaves</li>\n<li>promotion reflecting the improvement of your skills, experiences and your contribution to the company</li>\n</ul>\n<p>IF YOU MET THE REQUIREMENTS OF</p>\n<ul>\n<li>5+ years experience in software engineering</li>\n<li>JavaScript ES6</li>\n<li>HTML5, CSS3</li>\n<li>React.js</li>\n<li>Redux</li>\n<li>Node.js</li>\n<li>SQL &amp; noSQL</li>\n<li>Algorithms, data structures</li>\n<li>AWS &amp;/or Azure</li>\n<li>Strong systems design skills</li>\n<li>experienced in all phases of the software development lifecycle</li>\n<li>being the tech lead of one or more projects at a time</li>\n<li>Deeper knowledge of a CI tool</li>\n</ul>\n<p>OR EVEN GET ADVANTAGES HAVING</p>\n<ul>\n<li>Mobile development experience</li>\n<li>Knowledge of infrastructure as code software tools</li>\n</ul>\n",
        "how_to_apply": "<p>Apply here:</p>\n<p><a href=\"https://benestudio.co/joinus/#seniorfullstackengineer\">https://benestudio.co/joinus/#seniorfullstackengineer</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaXhnIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--451cdbb2938bf00033ff40309db16df3e64d3710/YouTube%20Video%20Thumbnail.png"
    },
    {
        "id": "dc428b94-e42e-11e8-91e2-23879ca9e8b0",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/dc428b94-e42e-11e8-91e2-23879ca9e8b0",
        "created_at": "Fri Nov 09 14:51:11 UTC 2018",
        "company": "New York University",
        "company_url": null,
        "location": "New York, New York 10001",
        "title": "Technology Solutions Developer",
        "description": "<p>As a member of the Technology Development Group, the Technology Solutions Developer is responsible for designing, implementing, and testing a wide variety of web applications, and supporting the School of Law's web presence, including academic and administrative functions. The responsibilities range from designing and developing end-to-end applications, planning and developing new site features, and extending existing applications to keeping web systems up-to-date, and integrating 3rd party applications with the school's application stack. The role requires excellent technical skills, analytical and creative problem solving skills, an ability to work independently or with a group, initiative, and high personal standards for quality work.</p>\n<p>US</p>\n<p>The Technology Development Group at NYU School of Law is a small, versatile, full stack development team. The vast majority of our development is in C#/.NET, with additional projects in PHP (Laravel) … both using Vue as our front-end framework.</p>\n<p>Our group develops and supports the school's website (Drupal), micro sites (usually WordPress), reporting, and administrative applications (both internal and public). We've been known to divert our energies towards improving our supporting infrastructure, and now run many of our services using Docker/Kubernetes/Terraform, and that only as part of our growing AWS presence. We're usually getting ourselves into trouble with interesting projects.</p>\n<p>YOU</p>\n<p>We're looking to add a developer who is flexible enough to code across different environments. Maybe you have experience in another language and are looking to switch it up. You're already good, but want to be better … and you want to learn new things and grow. Regardless, have an opinion, because we genuinely want to hear it!</p>\n<p>WHY</p>\n<p>As an employee of NYU Law, you would receive NYU's benefits (<a href=\"https://www.nyu.edu/employees/benefit.html\">https://www.nyu.edu/employees/benefit.html</a>), including excellent health coverage, retirement plans, and tuition remission. You would be part of a team of creative, talented technologists who continue to make NYU Law one of the top law schools in the country! Finally, you will be given the opportunity to become the professional you want to be, working with the tools you want to work with.</p>\n<p>Required Education:\nBachelor's degree.</p>\n<p>Required Experience:\n2-4 years' experience and expertise in working with high level languages such as: C#, PHP, Python, or Ruby; fluency in HTML, CSS, JavaScript; and familiarity with the general principles of system and network administration; direct experience with the all components of the LAMP stack and content management frameworks, such as Drupal and WordPress.</p>\n<p>Preferred Experience:\nExperience with a web development framework such as: .NET, Laravel, Django, or Rails. Experience with a JavaScript framework such as Vue, Angular, or React.</p>\n<p>Required Skills, Knowledge and Abilities:\nExcellent interpersonal and communication skills; ability and drive to learn new technologies and proactively look for ways to improve the School of Law's applications and web infrastructure.</p>\n<p>Preferred Skills, Knowledge and Abilities:\nKnowledge of module or plugin development for these frameworks is a plus. Fundamental knowledge of distributed version control systems and familiarity with one or more contemporary version control systems (e.g. Git/Mercurial/SVN)</p>\n<p>EOE/AA/Minorities/Females/Vet/Disabled/Sexual Orientation/Gender Identity</p>\n<p>Apply Here: <a href=\"http://www.Click2apply.net/cyg9sy9m99zdm9v2\">http://www.Click2apply.net/cyg9sy9m99zdm9v2</a></p>\n<p>PI105491972</p>\n",
        "how_to_apply": "<p>Apply Here: <a href=\"http://www.Click2apply.net/cyg9sy9m99zdm9v2\">http://www.Click2apply.net/cyg9sy9m99zdm9v2</a></p>\n",
        "company_logo": null
    },
    {
        "id": "ea4a734e-c8c9-11e8-9b99-00d03040101f",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/ea4a734e-c8c9-11e8-9b99-00d03040101f",
        "created_at": "Wed Nov 07 12:46:04 UTC 2018",
        "company": "Norwegian Block Exchange AS",
        "company_url": null,
        "location": "Oslo, Norway or Remote",
        "title": "Software Developer",
        "description": "<p><strong>Help us accelerate the world’s transformation to digital assets.</strong></p>\n<p>Norwegian Block Exchange (NBX) is building the best cryptocurrency exchange and digital ecosystems for consumers and institutions, optimizing ways for businesses across industries to operate. NBX will lead the community for distributed ledger technologies and other digital assets through security, integrity and customer experience.</p>\n<p><strong>What makes this a great place to work?</strong></p>\n<p>To reach our goals, we are starting from scratch building the company by using the best in class solutions and technology:</p>\n<ul>\n<li>NBX has global ambitions with no legacy code in a greenfield project.</li>\n<li>Help shaping architecture and technology choices for the future.</li>\n<li>We believe in a healthy work-life balance and flexible working hours.</li>\n</ul>\n<p><strong>What you can expect:</strong></p>\n<p>As a software developer on the NBX tech team you'll be part of a 10-15 person agile team.</p>\n<ul>\n<li>Participating in all areas of application development life-cycle.</li>\n<li>Ship updates in CI/CD pipelines.</li>\n<li>Our current tech stack:\nGCP, Kubernetes, Docker, React-Redux, Python, Go, Kafka, Cassandra.</li>\n<li>Future ambitions for our tech stack:\nMulti cloud, Global reach, AI &amp; Machine Learning, Blockchain as a service, Smart contracts as a service.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<p>We are looking for experienced software developers to help us achieve our high ambitions:</p>\n<ul>\n<li>Experience developing microservices for large scale production services.</li>\n<li>Good work ethics is necessary. As teams will be working independently within their areas of responsibility.</li>\n<li>Technology agnostic and eager to learn new languages, frameworks, patterns etc.</li>\n<li>Excellent communication skills, both verbal and written.</li>\n<li>Bachelor's degree or higher in Computer Science/Engineering, or equivalent is preferred.</li>\n</ul>\n",
        "how_to_apply": "<p>Please email your resume to <a href=\"mailto:join@nbx.com\">join@nbx.com</a>,\nLinks to github repositories or similar are welcome</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb2hYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d1c2a88373950aba7070ca4f32b212fbe54b62ab/f1f41d14-8e9f-4c73-889c-88248676e147"
    },
    {
        "id": "9fac9c8c-e27c-11e8-808b-680cc0d53917",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/9fac9c8c-e27c-11e8-808b-680cc0d53917",
        "created_at": "Wed Nov 07 11:03:36 UTC 2018",
        "company": "Marfeel",
        "company_url": "https://www.marfeel.com/",
        "location": "Barcelona, Spain ",
        "title": "Front-end Jedi",
        "description": "<p>#Who we are:</p>\n<p>Be part of Marfeel, one of the hottest European start-up companies in the mobile ad-tech world. Named as Wired Magazine’s 2015 Top 100 Startups, Inc.5000 nº 1 Fastest Growing Marketing and Advertising Private Company in Spain in 2017, and 16th out of Europe’s 1000 fastest-growing companies by the Financial Times in 2018. We are recommended at the very top by Google itself for our mobile design solution. Together with our partners we have over 6 billion worldwide readers and over 20 billion page views. Our headquarters are based in sunny Barcelona.</p>\n<p>Certified Google Publishing Partner</p>\n<p>Certified Facebook Instant Articles Official Partner</p>\n<p>If you feel like a Front-end Jedi, join the Marfeel Force you must!</p>\n<p>#This is you:</p>\n<ul>\n<li>\n<p>Your life begins and ends with a slash.</p>\n</li>\n<li>\n<p>You feel like you have a mission, not just a task, and you write testable front-end code in JavaScript and HTML/CSS.</p>\n</li>\n<li>\n<p>You understand iterative development and a day without pushing code makes you sad.</p>\n</li>\n<li>\n<p>You’re not afraid to crack open an existing code base and bend it to your will.</p>\n</li>\n<li>\n<p>“Self Starter” is your middle name. You can take or come up with a high-level idea and run with it.</p>\n</li>\n<li>\n<p>You have a real understanding of building products that work at web scale.</p>\n</li>\n<li>\n<p>You can’t imagine your life without a whiteboard, open-source boards and definetly CODE.</p>\n</li>\n<li>\n<p>You know the importance of being part of a universe where all the departments need each other and work together for a mutual goal. So, your communication shows both tech and functional command of what you’re doing.</p>\n</li>\n<li>\n<p>As a software craftsperson you will advocate and practice pair-programming, test-driven development, refactoring, collective-code ownership and continuous integration.</p>\n</li>\n<li>\n<p>You care about online news and user experience.</p>\n</li>\n<li>\n<p>You are an international team player.</p>\n</li>\n<li>\n<p>You are eager for knowledge.</p>\n</li>\n<li>\n<p>You have lots of stamina and you get bored if you have nothing to do.</p>\n</li>\n<li>\n<p>You are hands-on and proactive.</p>\n</li>\n<li>\n<p>You are fluent in English (this is a must).</p>\n</li>\n</ul>\n<p>#Experience:</p>\n<ul>\n<li>\n<p>You can solve technical problems equally well with OO, DOM oriented, or functional JS.</p>\n</li>\n<li>\n<p>You have the ability to create an interface using JavaScript, HTML and CSS.</p>\n</li>\n<li>\n<p>You have a solid understanding of the web technology stack (i.e. headers, cookies, cross-domain restrictions, https, caching, optimization opportunities, hardware acceleration, junk and scroll performance, etc.).</p>\n</li>\n<li>\n<p>You have &gt;2 years experience building software that works at web scale.</p>\n</li>\n<li>\n<p>You have demonstrable experience with cross-browser JS and CSS development. If you also have experience in Java that will be great.</p>\n</li>\n<li>\n<p>You have experience with client-side site development in JS.</p>\n</li>\n<li>\n<p>You have a solid understanding of HTML5 tags - functions and intent.</p>\n</li>\n</ul>\n<p>#We will be impressed if:</p>\n<ul>\n<li>\n<p>You have experience with Webpack, SASS and Jasmine.</p>\n</li>\n<li>\n<p>ReactJS.</p>\n</li>\n<li>\n<p>#perfMatters.</p>\n</li>\n<li>\n<p>Experience with more recent web technologies (i.e. localStorage, geolocation, CSS transitions and transformations).</p>\n</li>\n<li>\n<p>Experience with Google Analytics.</p>\n</li>\n<li>\n<p>Experience with AdServing.</p>\n</li>\n<li>\n<p>You have experience with various AWS services and understand the challenges of deploying large applications in the cloud.</p>\n</li>\n<li>\n<p>Vue.js</p>\n</li>\n</ul>\n<p>#This will be you as part of the Marfeel team:</p>\n<ul>\n<li>\n<p>Working in an international, multicultural and talented team and enjoying our sunny terrace.</p>\n</li>\n<li>\n<p>We have more than 27 nationalities so you will not get lost in translation.</p>\n</li>\n<li>\n<p>Flexible working-time.</p>\n</li>\n<li>\n<p>Free commodities (coffee, tea, juices, etc).</p>\n</li>\n<li>\n<p>Ping-pong, Mario Kart and foosball tournaments.</p>\n</li>\n<li>\n<p>Free language and yoga classes</p>\n</li>\n<li>\n<p>Team building events!</p>\n</li>\n<li>\n<p>Transport, restaurant and kindergarten tickets.</p>\n</li>\n<li>\n<p>Training, books and all you need to feel empowered.</p>\n</li>\n<li>\n<p>And a Referral Bonus if you bring other talented people like you.</p>\n</li>\n</ul>\n",
        "how_to_apply": "<p>Please apply using the following link:</p>\n<p><a href=\"https://marfeel.bamboohr.com/jobs/view.php?id=1\">https://marfeel.bamboohr.com/jobs/view.php?id=1</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb1ZXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--266b89e29de9c745f66f083046fc6b20637c7a3b/5250cec8-bccf-4227-9eea-1b896ac66700"
    },
    {
        "id": "e5f347ea-e277-11e8-989d-9bece5ee00a0",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/e5f347ea-e277-11e8-989d-9bece5ee00a0",
        "created_at": "Wed Nov 07 10:55:22 UTC 2018",
        "company": "Alasco GmbH",
        "company_url": "https://www.alasco.de/",
        "location": "Munich",
        "title": "Frontend Engineer (m/f)",
        "description": "<p>Alasco helps construction companies complete projects on time and budget. We digitalize the processes in construction planning and execution by offering a cloud based workflow platform. Alasco has been founded in 2018 by three well-known tech entrepreneurs in Munich (Anselm Bauer, Benjamin Günther, Sebastian Schuon) to enable more and higher quality buildings for everybody. If you are interested in participating in a startup early on, do join our cause!</p>\n<p>•Your Responsibilities: Together with your team, you ship new features for our cloud platform. You will participate in all SCRUM meetings and contribute to improve both the product and your team. After learning about the customers needs and processes you strive to solve them and to deliver the best possible experience for our users by empowering them through an effective and intuitive UI</p>\n<p>•Your Profile: You have mastered one frontend framework (preferably react) and have experience in collaborating with designers, bringing wireframes to life. You strive for re-usability. Styling elements is a no-go, let’s use classes and variables for that! Previously you have been part of an agile development team. Besides being fluent in English, we want to you to have a desire to learn and grow!</p>\n<p>•Our Profile\nWe are a small team of software engineers, partly distributed. For our work we use a python/django/postgres stack in the backend and use react/bootstrap in the frontend. All running on AWS. We believe in DevOps, Continuous Integration and Testing (and live it) and work as a SCRUM team, with open boards and retros. We strive hard to balance development speed and software quality and care about the personal growth of our team members!</p>\n",
        "how_to_apply": "<p>Submit your application through <a href=\"https://alasco.breezy.hr/p/49ca07b39fa3-frontend-engineer-m-w-d\">https://alasco.breezy.hr/p/49ca07b39fa3-frontend-engineer-m-w-d</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb05XIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--834caeaebed8c5a2c4f9fc769ba05f9a69539cd6/4317ab46-3da3-432d-b505-e73e17ad3eea"
    },
    {
        "id": "fa15462c-e201-11e8-9ee9-cfbf28397977",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/fa15462c-e201-11e8-9ee9-cfbf28397977",
        "created_at": "Tue Nov 06 20:25:06 UTC 2018",
        "company": "Constructive",
        "company_url": "http://constructive.co",
        "location": "New York, New York",
        "title": "Sr. Web Developer (Full-Stack/WP), Social Change Design Agency",
        "description": "<p><strong>Sr. Web Developer (Full-Stack/WP), Digital Agency for Social Change</strong></p>\n<p>Constructive, a leading brand experience design &amp; digital design agency that works exclusively with social impact organizations is looking for an outstanding technical expert and creative thinker to join our team as a Sr. Web Developer.</p>\n<p>If you’re an experienced technologist who has demonstrated expertise building Wordpress websites that demand a high degree of creative and technical complexity, thrive on being a collaborative problem solver, and believe that the best digital experiences happen when strategy, technology, and design work together, then we’d love to hear from you. And if you care deeply about issues like climate change, social justice, and economic equality—and want to work on interesting projects that make a meaningful positive impact on them—then we think you’ll love working with us and our clients.</p>\n<p><strong>A bit about the role</strong></p>\n<p>Sr. Web Developers at Constructive need great expertise both in creating powerful back-end publishing systems and in elegant front-end digital experiences. They need to write code that’s semantically sound and adheres to current best practices. They must be proactive thinkers who are always looking to bring new ideas to the table and improve how we work. And they must thrive on working collaboratively in multi-disciplinary teams.</p>\n<p><strong>A bit about us</strong></p>\n<p>We’re a diverse, close-knit bunch who are serious about having fun producing exceptional work. We play to win—for our clients, for ourselves, and for the world. We’ve got each other’s backs. We have high expectations and the work ethic to match them. And we’re all together in the same open office, so there’s music and a lot of joking mixed-in with being heads-down on work.</p>\n<p><strong>A bit about diversity</strong></p>\n<p>We believe strongly that diversity is one of our greatest strengths—that the more perspectives we bring to the mix, the better we are as people and the better partner we are for our clients. So, in considering if Constructive is a good fit for you, know that all we care about is that you’re qualified to do the job, share most or all of our values, and want to be here. These are the things we’ll be evaluating for every applicant.</p>\n<p><strong>What we need you to do extremely well</strong></p>\n<p>We’re looking for a developer who’s eager to play a leading role in Constructive’s digital practice. We’ll need you to have strong demonstrated success having done all or most of the following things for at least 3-5 years—and a passion for doing them extremely well.</p>\n<ul>\n<li>Understand the web development landscape, contributing significantly to creating internal technology strategies that align with broader brand strategy.</li>\n<li>Collaborate across teams to plan and execute ambitious digital projects.</li>\n<li>Develop backend and frontend, taking ownership of your projects from start to finish.</li>\n<li>Participate in QA/UAT testing to ensure that what we deliver is what we promised—and that it lives up to our standards.</li>\n<li>Document your work to make it easier for other developers, both now and in the future, to work with what you’ve built.</li>\n<li>Improve best practices, recommend tools, and build technical frameworks that make our work more efficient, effective, and technically front-of-field.</li>\n<li>Contribute to ongoing development and support for existing websites.</li>\n<li>Contribute to developing proposals and estimates for projects you will be a lead developer.</li>\n<li>Be a team player who has a bias towards listening, takes serious pride in their work, and is always looking for our process and results to be better the next time out.</li>\n<li>Have a sense of humor. Seriously, life can be stressful enough these days.</li>\n</ul>\n<p><strong>Expertise that’s important in our work</strong></p>\n<p>Right now, these are the specific technologies and tasks that are essential to our work (which we always remain open to evaluating and evolving). We’ll need you to have about 5 years of professional experience in most of these things.</p>\n<ul>\n<li>Expert-level Wordpress Development (Min 3 years experience)</li>\n<li>Expert CSS chops (and SCSS!)</li>\n<li>Strong front-end development experience (experience with at least 1 Javascript framework: React, Angular, Vue)</li>\n<li>Strong preprocessor experience (Webpack / Gulp)</li>\n<li>Strong Git experience</li>\n<li>Experience with MySQL</li>\n<li>Experience executing third-party integrations (Salesforce, Mailchimp, Blackbaud, Fluxx, Google Maps API, etc.)</li>\n<li>Comfortable with D3</li>\n<li>Comfortable with AWS</li>\n<li>Comfortable with Server Administration &amp; DevOps</li>\n</ul>\n<p><strong>What’s in it for you?</strong></p>\n<p>We do our best to make sure everyone at Constructive is taken care of with a great mix of salary, benefits and perks, opportunities for professional growth, and a healthy dose of time off. We also always reward individual initiative and outsized contributions to our collective success. Along with your base salary, here are the benefits and perks we have on tap at Constructive for 2018-2019 to add to this:</p>\n<p><strong>Benefits &amp; Perks</strong></p>\n<ul>\n<li>Health, Dental &amp; Vision Insurance</li>\n<li>401K plan with 4% company match</li>\n<li>Annual profit sharing bonus+performance bonuses (no less than 10% of company profit split equally by all employees as profit sharing)</li>\n<li>2 weeks paid vacation (+1 additional day per year)</li>\n<li>Paid vacation between Christmas &amp; New Year's</li>\n<li>1/2-day Summer Fridays (Approx 16 days)</li>\n<li>1 week paid personal/sick days</li>\n<li>Unlimited work-from-home days (within reason!) after 6 months</li>\n<li>Monthly employee-voted gift card awards</li>\n<li>TransitChek (pay for transit w/ pre-tax $)</li>\n<li>Discounted Company Cell Phone Plan</li>\n<li>$1K annual professional development stipend</li>\n<li>New client bonus (2.5% of largest contract in year 1 for any non-inbound client)</li>\n<li>Coffee, healthy snacks, soda</li>\n<li>Company lunch every Wednesday</li>\n<li>Weekly Happy Hr (every non-summer Friday)</li>\n<li>Bi-monthly Company Events (sporting events, bowling, holiday party, etc)</li>\n<li>The feeling of satisfaction knowing that your work is helping make the world a better place.</li>\n</ul>\n<p><strong>Interested? Great! Then please send an email to titled “Senior Web Developer” to <a href=\"mailto:jobs@constructive.co\">jobs@constructive.co</a> with the following</strong></p>\n<ul>\n<li>A resume</li>\n<li>A cover letter telling us a bit about you and what excites you about joining our team</li>\n<li>Links to your own website, websites you’ve worked on, github, whatever\nDesired salary (freelance rate for those interested in consulting with us)</li>\n</ul>\n",
        "how_to_apply": "<p>Interested? Great! Then please send an email to titled “Senior Web Developer” to <a href=\"mailto:jobs@constructive.co\">jobs@constructive.co</a> with the following</p>\n",
        "company_logo": null
    },
    {
        "id": "36bb2228-e201-11e8-9310-b526bfa5a16e",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/36bb2228-e201-11e8-9310-b526bfa5a16e",
        "created_at": "Tue Nov 06 20:19:44 UTC 2018",
        "company": "Cortex Building Intelligence",
        "company_url": "https://cortexintel.com/",
        "location": "New York, NY",
        "title": "Software Engineer, Full Stack (Rails, React)",
        "description": "<p><strong>Company Description</strong></p>\n<p>Cortex is a rapidly growing technology startup.  We provide software for Commercial Real Estate buildings that enables operators to run their buildings with significantly more precision.  This is creating substantial financial savings (up to $850k per year per building), while also having a significant sustainability impact (reducing energy use by 5-10% or the equivalent of taking 850 cars off the road).</p>\n<p><strong>Job Description</strong></p>\n<p>At Cortex, we are as proud of our pristine codebase as we are of our mission to create more sustainable cities. We accomplish this mission by using IoT data, Machine Learning, and modern web development to transform the way large buildings operate.  We are looking for a talented Software Engineer to work collaboratively with us to deliver amazing product experiences across all of our application’s channels including web, mobile, email and push notifications.  The Engineer in this role will have the opportunity to learn from an experienced team while accelerating their career with both guided and autonomous work.</p>\n<p><strong>Responsibilities</strong></p>\n<ul>\n<li>Creating new software product experiences that assist building operators in efficiently and effectively running their buildings by delivering our high impact Machine Learning recommendations through our web, mobile, email, and push notification channels.</li>\n<li>Integrating with third-party APIs to import utility company and building management system data to be used to feed our Machine Learning algorithms.</li>\n<li>Working closely with our Customer Success team to support client onboarding and operations.</li>\n<li>Taking ownership of our Internal Tooling needs to allow our Customer Success team to scale their operational support of our clients.</li>\n</ul>\n<p><strong>Qualifications</strong></p>\n<ul>\n<li>4+ years of pragmatic, real-world experience creating, maintaining, testing, and deploying high-quality code to production systems.</li>\n<li>Strong understanding of web development technologies, OOP languages, and relational databases.  We use Ruby with Rails, JavaScript with React, and Postgres.</li>\n<li>Experience working with standard software engineering tools and practices such as version control, automated testing, and lightweight project management.  We use Git, RSpec, and Clubhouse.</li>\n<li>Product-focused.  Have the ability to understand the needs of our users and translate those needs into prioritized product features.</li>\n<li>Excellent verbal and written communication skills.  Committed, hard-working, and thoughtful.</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>The usual suspects: Competitive compensation/equity, commuter benefits, and access to Medical, HSA and 401k plans.</li>\n<li>Unlimited paid time off.</li>\n<li>Your choice of 13” or 15” Macbook Pro.</li>\n<li>Work in an environment where clean code, automated testing, constructive code reviews, collaborative whiteboarding, thoughtful design, and easy deployments are considered to be the standard operating procedure.</li>\n</ul>\n",
        "how_to_apply": "<p>Schedule a time to chat with our CTO, Justin Spradlin: <a href=\"https://calendly.com/justin-spradlin-cortex/chat-with-cortexs-cto\">https://calendly.com/justin-spradlin-cortex/chat-with-cortexs-cto</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbnBXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6ac4f10dc2db58c4f6c8bf99265e3afc94e0b305/8711ac77-126b-48d2-8caf-7c50a26ceb93"
    },
    {
        "id": "a412770a-e1d3-11e8-8b9f-cf224f66af92",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/a412770a-e1d3-11e8-8b9f-cf224f66af92",
        "created_at": "Tue Nov 06 14:54:06 UTC 2018",
        "company": "moovel Group GmbH",
        "company_url": "https://www.moovel.com/de/DE",
        "location": "Berlin",
        "title": "Backend Engineer (f/m) Node.js",
        "description": "<p>Transit Squad seeks Backend Engineer (f/m)</p>\n<p>Hi,\nwe’re the transit team at moovel. We build services, munch data and process real-time information in all things transit - and we’re looking for a backend engineer in the Berlin office to\njoin us in our effort to provide great public transit APIs as one of the pillars for moovel’s rapidly expanding mobility platform.</p>\n<p>FIRST A QUICK LOOK AT US\nOur vision is a planet without traffic jams. Our mission is to transform cities by providing the most convenient and sustainable mobility solutions. We create outstanding products with technical excellence, an agile mindset, an open feedback and failure culture and fun at work. moovel is part of a large global corporation (Daimler AG), but at the heart of it we still are a startup. We act as a partner for cities, transport networks and mobility service providers with the goal of making cities smarter and creating an operating system for urban mobility that provides access to appropriate mobility options in urban areas and paves the way for the future with autonomous vehicles. Currently, 250 employees work in small creative teams in Germany and the US at four locations - Hamburg, Berlin, Stuttgart and Portland.</p>\n<p>HOW THE ROLE WORKS\nWe gather in small engineering teams organized around specific topics. The individual teams enjoy a high degree of autonomy, trust and responsibility. Innovation is key and very much encouraged and embraced in our teams. We value pragmatism, simplicity and collaboration. We live an open feedback and failure culture, because we know that both are necessary to find proper solutions.</p>\n<p>With us you’ll use state of the art technology and work self-determined in small, autonomous and agile teams. moovel tries to maintain a culture where engineers are provided with the tools\nof their choice and a friendly environment in which they can thrive.</p>\n<p>SOME OF THE THINGS YOU WILL DO\nTeams at moovel choose the tools they regard as best fit for their problems, at their discretion. Hence the technology stack is rather diverse. We employ a microservice backend architecture based on Docker and AWS. Cloud Services are leveraged wherever they help us to focus on our task. We practice Continuous Delivery and value DevOps culture (you build it, you run it). On the Frontend (IOS, Android and Web) we adopted and embraced Technologies like Swift, Kotlin, Rx or React.</p>\n<p>Breaking down concrete tasks for this position is not that easy, but that's what makes it so exciting. Here are some things we want to entrust you right away:</p>\n<ul>\n<li>You write, monitor, scale and architect microservices that comprise our transit backend</li>\n<li>You build infrastructure and tooling for importing data into our data stores</li>\n<li>You develop services using Node.js &amp; Python</li>\n<li>You perform analysis to enable data driven decisions</li>\n<li>You write processing pipelines in Python</li>\n<li>Collaborate with cross-functional teams to define, design and ship new features</li>\n</ul>\n<p>ABOUT YOU\nYou should have experience in writing, maintaining &amp; debugging web services. You should be concerned about quality and maintainable code. Some exposure to functional programming, async concepts and micro services would be useful. While having working experience in the Node.js or Python web stack is a plus, it’s not a show-stopper in case you’re flexible and well versed in alternatives like Rails or Play. Since we are working in a rapidly evolving environment you should be open to pick up new languages, tools and frameworks. Furthermore, we are working with Amazon Web Services so it would be good if you are familiar with cloud technologies and methodologies like 12 Factor.</p>\n<p>You should be familiar with SQL. Additionally, it would be nice if you have experience with any of Elasticsearch, Lucene, Solr or similar search technologies. </p>\n<p>As it is our corporate language, you should have good written and verbal communication skills in English.</p>\n<p>BENEFITS</p>\n<ul>\n<li>Choose your own hardware</li>\n<li>Working with newest technologies &amp; microservices</li>\n<li>Company pension plan</li>\n<li>Free breakfast, coffee &amp; water</li>\n<li>Mobility allowance</li>\n<li>Be part of an interdisciplinary team of experts</li>\n<li>Working on products with a high impact on society</li>\n<li>International teams</li>\n<li>Child care allowance</li>\n<li>Flexible working hours</li>\n</ul>\n<p>Sounds good?\nWe are more than happy to meet you soon! Just click the application form.</p>\n<p>Your Transit Squad\nMagnus, Engineering Manager Search</p>\n<p>Click here for the application!</p>\n<p>If you have any questions or are in need for further information feel free to contact\nJanosch Fingerhut\n+49 30 549073811</p>\n",
        "how_to_apply": "<p>Click here for the application!</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbTFXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f3516d50eaf556f5817391b6fa7484e24bfe85f1/412aec9a-9ac1-46bd-b50f-c0bbafeb2d09"
    },
    {
        "id": "5dad93a8-e11f-11e8-9f88-578950b09034",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/5dad93a8-e11f-11e8-9f88-578950b09034",
        "created_at": "Mon Nov 05 17:27:42 UTC 2018",
        "company": "REPAY - Realtime Electronic Payments",
        "company_url": null,
        "location": "Phoenix, Atlanta, Remote-US Based",
        "title": "Full Stack Developer - Python",
        "description": "<p>REPAY – Realtime Electronic Payments is an established and fast growing, Financial Technology company. We build great software that enables businesses to move faster by removing friction in payments processing by offering a comprehensive line of electronic payment solutions including debit and credit card processing, ACH processing, instant funding, and electronic bill payment systems with full IVR, text, and mobile capabilities.</p>\n<p>REPAY is looking for an experienced Full Stack Developer (Python) to be part of our Agile and growing software development team in expanding our core payment processing platform and products within the consumer finance industry. Work in a small team, where you will have an immediate and measurable impact on our fast-growing business by helping us reach the next level and stage of growth. Here, we work hard—but we have lots of fun doing it. So, if you like a cool, collaborative, and challenging work environment, you’ll fit right in.</p>\n<p>THIS POSITION CAN BE REMOTE (US BASED) OR IN TEMPE, AZ OR ATLANTA, GA</p>\n<p>REPAY’s Tech Stack:</p>\n<p>Python 3.x\nPyramid\nReact\nReact Native\nAWS\nRedux\nRedshift\nDocker\nPostgres\nInteract with the TwilioAPI, SendGrid, and others</p>\n<p>You’ll be responsible for:</p>\n<ul>\n<li>Building and enhancing our core API, user interfaces, and backend processing systems via new greenfield development and supporting legacy systems</li>\n<li>Integrating with existing corporate and partner applications which span multiple languages and frameworks</li>\n<li>Developing high performance and reusable software with excellent test coverage</li>\n<li>Developing and deploying to cloud-based technology (AWS)</li>\n<li>Participate in the design of our core products</li>\n<li>Evaluating existing and new technologies and ensuring our applications utilize industry best practices</li>\n<li>Supporting the operations team in order to provide the best uptime and service quality</li>\n<li>Occasional travel to Tempe, AZ for remote employees</li>\n</ul>\n<p>Skills &amp; Requirements:</p>\n<ul>\n<li>Experience working with Python (3.x), Django and/or Pyramid</li>\n<li>Experience with building highly available systems</li>\n<li>Experience working with JavaScript</li>\n<li>A track record of success with developing modern APIs</li>\n<li>Good understanding of application security</li>\n</ul>\n<p>Preferred Skills &amp; Requirements:</p>\n<ul>\n<li>Experience working with ReactJS, React-Native</li>\n<li>Docker strongly preferred</li>\n<li>Good understanding of Payments processing and/or developing Payments products</li>\n<li>Familiarity of PCI compliance</li>\n</ul>\n<p>Why #REPAYrocks:</p>\n<ul>\n<li>Access to online learning platforms like PluralSight, Udemy, AskLynda.</li>\n<li>Encourage continuing education including professional conferences and events</li>\n<li>Flexible schedule/work from home</li>\n<li>Employee bonus program</li>\n<li>REPAY has been named by FORTUNE® magazine as one of the Top 50 “Best Small Workplaces in America” for 2017!  <a href=\"http://fortune.com/best-small-workplaces/repay-48/\">http://fortune.com/best-small-workplaces/repay-48/</a>\n</li>\n<li>REPAY was ranked again for the 8th straight year in a row #2164 on the Inc. 5000 List of America’s Fastest Growing Private Companies for 2018!</li>\n<li>REPAY has also been certified as a Great Places to Work company for 2017!\nWhy Join the REPAY Family?</li>\n<li>Growing ~ We are the industry-leading, financial-technology provider in the Consumer Finance space and continue to set the standard for application development and delivery.</li>\n<li>Awesome Work Environment ~ Business to casual dress, great snacks and beverages, open-air collaborative team setting.</li>\n<li>Great teaming and Work-Life-Balance ~ The team is fun, smart, and collaborative. We truly enjoy working together.  We are all self-driven, motivated professionals that do not require micro-management to make sure we honor our work and project commitments.</li>\n<li>Leadership Support ~ The founders and leadership team “get” and recognize both individual and team performance.</li>\n<li>Difficult Problems to Solve ~ We create highly sophisticated payment processing applications and are constantly pushing the boundaries of what is possible on the web, with mobile, SMS, and IVR applications in support of alternative payment channels. We are working on extensive new product and feature development.</li>\n<li>Innovation and Ideas ~ We constantly listen to clients and employees to find the best ideas, and we provide the resources necessary to ensure those priorities are implemented quickly.</li>\n</ul>\n<p>DIRECT APPLICANTS ONLY, NO C2C, MUST BE ELIGIBLE TO WORK FOR A US EMPLOYER</p>\n",
        "how_to_apply": "<p>Email your resume to <a href=\"mailto:jcohen@repay.com\">jcohen@repay.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbUJXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cb7bad5865d7efe72d42202ded74b3a9fe4b3c50/2852a53c-707a-48ff-af93-718314386315"
    },
    {
        "id": "e10970ae-df31-11e8-8043-db2f2a1252c8",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/e10970ae-df31-11e8-8043-db2f2a1252c8",
        "created_at": "Sat Nov 03 06:31:26 UTC 2018",
        "company": "Live Graphic Systems",
        "company_url": "https://www.ligrsystems.com/careers/senior-full-stack-javascript-engineer",
        "location": "Australia and/or Remote",
        "title": "Senior Full-Stack Javascript Engineer",
        "description": "<p>Who we are</p>\n<p>LiGr systems is a growing startup in the sports and media tech industry which creates automated, real-time data-driven graphic displays (scoreboards, team lists, infographics) for sports organisations from grassroots to professional for use primarily over live video broadcasts.</p>\n<p>Who we're looking for:</p>\n<p>This is a unique opportunity to build exciting, bleeding edge technology in the sports and broadcast industry, and we are looking for a talented, experienced javascript/web engineer to join our team and help build on our ideas.</p>\n<p>The successful applicant will be able to assist us in meeting the challenges of scale as we expand our operation internationally. You will have an immediate opportunity to influence the product strategy and organisational culture.</p>\n<p>Successful candidates will be invited to meet our leadership team in person or over video chat.</p>\n<p>The following skills are required</p>\n<p>Strong engineering ability,\nFluent / Advanced English,\nExcellent practical problem-solving,\nA passion for software,\nGreat written communication skills,\nOrganisational skills,\nContinuous Learner,\nAbility to work unsupervised</p>\n<p>The following skills are highly valued</p>\n<p>Cloud infrastructure e.g. containers(docker), Kubernetes, GCP, cloud functions,\nReact, webpack, babel, redux\nSvg, gsap, animation/motion graphics\nEvent-driven architectures, event sourcing,\nTesting unit/integration/e2e/CI/CD,\nUnderstanding of design systems,\nCSS</p>\n<p>The following is also valued</p>\n<p>Some understanding of sport,\nVideo streaming - encoding/hls/rtmp/storage/facebook/youtube</p>\n<p>Our current stack:</p>\n<p>React,\nNode.js,\nDocker,\nKubernetes,\nGCP,\nGoogle Firestore</p>\n<p>What you”ll be doing</p>\n<p>Creating web interfaces/content management systems,\nImplementing graphic components,\nImproving event-driven architecture and building backend services</p>\n<p>Benefits of the role</p>\n<p>In addition to being a part of a great team, working in a fun and creative environment and learning from the best technical minds in the sports industry, we offer:</p>\n<p>Competitive salary,\nAccess to the latest tools and technologies,\nWork with global sporting bodies and sports leagues,\nRemote work with a virtual and regular communication environment (Trello, Slack, Github etc),\nStart-up sized company, where you can make an immediate impact,\nBuild software that will have a global impact on sports and the future of sports broadcast,\nOur team is technical and understands developer needs</p>\n<p>Apply</p>\n<p>Applying is easy. Send an email with your resume, website, Github account, links to apps or anything else you're proud of. If we like what we see, we’ll get in touch and organise a catchup in person or over video chat. We’ll then tell you more about the role and we can decide if there's a fit.</p>\n<p>Email applications to <a href=\"mailto:luke@ligrsystems.com\">luke@ligrsystems.com</a></p>\n",
        "how_to_apply": "<p>Email <a href=\"mailto:luke@ligrsystems.com\">luke@ligrsystems.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbGRXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3f0edf89d5fad53a1a86e8ac0472360882eb11af/b1bdfcc7-18e7-4394-83e2-0f539fb92289"
    },
    {
        "id": "2d215050-dea2-11e8-9a31-2431d393de1e",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/2d215050-dea2-11e8-9a31-2431d393de1e",
        "created_at": "Fri Nov 02 13:22:25 UTC 2018",
        "company": "Aera Technology",
        "company_url": "https://www.aeratechnology.com/careers",
        "location": "Bucharest",
        "title": "Senior User Interface Software Engineer",
        "description": "<p>Do you want to shape the future of enterprise software?</p>\n<p>At Aera Technology, we apply Internet scale technology to the challenges facing enterprise businesses. Think of the self-driving car: connected, always-on, thinking, and autonomous. Our mission is to enable companies in the same way.</p>\n<p>We're hiring exceptionally talented UI developers to join our top-notch engineering team. This is a great opportunity to be part of a team developing cutting-edge enterprise cloud platform. You must be highly motivated, independent, result oriented and enjoy working in a start-up atmosphere.</p>\n<p><strong>Responsibilities</strong></p>\n<ul>\n<li>Develop new features and components in our existing web application.</li>\n<li>Build reusable code and libraries for future use.</li>\n<li>Work with PM and UX designer to understand the requirement and ensure the technical feasibility of UI/UX design.</li>\n<li>Optimize application for maximum speed and scalability.</li>\n<li>Learn and research latest JavaScript frameworks and work on PoC projects to integrate and upgrade existing application.</li>\n<li>Collaborate with other team members and with cross-functional teams and stakeholders across geographies.</li>\n<li>Create and execute unit test cases and contribute to test automation.</li>\n<li>Participate in design and code reviews.</li>\n</ul>\n<p><strong>About You</strong></p>\n<ul>\n<li>A passion for UI/UX</li>\n<li>You are an experienced UI developer with a proven track record of delivering great software.</li>\n<li>Experience with HTML, CSS, HTML5, OO Javascript, modern frameworks such as ReactJS, Polymer, VueJS or ExtJS/Sencha.</li>\n<li>Experience with NodeJS, Browserify, Babelify, Gulp, Bower.</li>\n<li>An ability to write code for responsive UI and implement common widgets.</li>\n<li>Have a passion for quality and writing clean, solid, readable code that scales and performs well.</li>\n<li>A firm grasp of Computer Science fundamentals including object-oriented design, data structures, algorithm design, problem-solving, and complexity analysis.</li>\n<li>Experience with Java, Rest API is a big plus.</li>\n<li>Experience with cloud services. Experience with microservices would be a bonus.</li>\n<li>An urge to collaborate with other architects, designers, product managers, and software developers to influence product direction and functional requirements.</li>\n<li>Ability to coach and collaborate inside and outside the team - You enjoy working closely with others, teaching, and learning, and are comfortable showing off your work.</li>\n<li>Have a positive energy and enthusiasm - cultural fit is a big deal for us, we’re looking for smart people who are excited about solving big problems and are self-motivated to get things done.</li>\n<li>Are highly organized and have a professional attitude towards work - You're an exceptional communicator, you are pragmatic, and you know how to build trust.</li>\n</ul>\n<p>At Aera, we're on a mission to solve the biggest, most intractable challenges of enterprise software. We envision the rise of the Self-Driving Enterprise: a more autonomously functioning business with a central operating system that connects and orchestrates business operations. Our platform is increasingly used by the world's largest companies to identify and respond to market opportunities faster.</p>\n<p>If you share our passion for building the next generation of enterprise software and implementing it for the most sophisticated customers in the world, you’ve met your match. Headquartered in Mountain View, California, we're growing fast, with teams in Mountain View and San Francisco (California), Portland (Oregon), Bucharest and Cluj-Napoca (Romania), Paris (France), Munich (Germany), London (UK), Pune (India), and Sydney (Australia).  So join us, and let’s build this!</p>\n",
        "how_to_apply": "<p>Apply here: <a href=\"https://bit.ly/2Jx6mmO\">https://bit.ly/2Jx6mmO</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbE5XIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--05413e1280c79b2290bac2120cb451141c7922b6/d676ca56-df82-4c76-8f5e-bd7778190625"
    },
    {
        "id": "d5955556-de1b-11e8-97e2-45ff61609ad8",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/d5955556-de1b-11e8-97e2-45ff61609ad8",
        "created_at": "Thu Nov 01 21:20:36 UTC 2018",
        "company": "PlayVS",
        "company_url": "http://www.playvs.com",
        "location": "Santa Monica, CA",
        "title": "Software Engineer, Full Stack",
        "description": "<p>PlayVS is building the infrastructure and official platform for high school esports. We work with game publishers and high school governing bodies to build and operate sanctioned leagues across the country. Our software products tie everything together, creating the world’s first full-stack sports platform. PlayVS is headquartered in Santa Monica, CA and rapidly expanding.</p>\n<p>As an engineer, you’ll be expected to do the normal tech startup duties including:</p>\n<ul>\n<li>\n<p>Writing clean, easily-maintainable code. We’re extremely proud of our lack of technical debt and want to keep it that way.</p>\n</li>\n<li>\n<p>Debugging, documentation, and unit testing. Everyone loves a smooth game day.</p>\n</li>\n<li>\n<p>Have a natural knack for user experience and pixel-perfect design. You should know CSS like it’s the back of your hand, and be extremely comfortable building modern responsive web apps.</p>\n</li>\n<li>\n<p>Being flexible about your day-to-day tasks. We do everything from tweaking marketing pages to building the real-time match-play systems and data pipelines. You will wear many hats here.</p>\n</li>\n<li>\n<p>Improving our internal tooling and engineering process by contributing your knowledge and unique background.</p>\n</li>\n</ul>\n<p>What we’re looking for:</p>\n<ul>\n<li>\n<p>4+ years of technical experience</p>\n</li>\n<li>\n<p>Interest in gaming or esports, though no prior experience is required\nExperience using NodeJS or NoSQL data stores like Redis, RethinkDB or Mongo</p>\n</li>\n<li>\n<p>Expert developing interfaces using ReactJS</p>\n</li>\n<li>\n<p>Top-notch CSS skills</p>\n</li>\n<li>\n<p>Comfortable working with WebSockets</p>\n</li>\n<li>\n<p>Degree in Computer Science preferred</p>\n</li>\n</ul>\n<p>At PlayVS, we put a heavy emphasis on inclusiveness, diversity, and most importantly, player experience. Our team is small, scrappy, and incredibly talented. The challenges we solve on a daily basis are exciting and relevant. This role is $110K+.  If you are driven by seeing the immediate impact that your code brings, you’ll fit right in here.</p>\n",
        "how_to_apply": "<p>Email us at <a href=\"mailto:careers@playvs.com\">careers@playvs.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa2xXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--02900ed15126cfa0983ebd48ddba2b07539f4c62/7f3abee5-837b-49da-93f7-b44fbe23fc0a"
    },
    {
        "id": "c65408fa-de19-11e8-844c-e31925c0b958",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/c65408fa-de19-11e8-844c-e31925c0b958",
        "created_at": "Thu Nov 01 21:06:30 UTC 2018",
        "company": "PlayVS",
        "company_url": "http://www.playvs.com",
        "location": "Santa Monica, CA",
        "title": "Software Engineer, Frontend ",
        "description": "<p>PlayVS is building the infrastructure and official platform for high school esports. We work with game publishers and high school governing bodies to build and operate sanctioned leagues across the country. Our software products tie everything together, creating the world’s first full-stack sports platform. PlayVS is headquartered in Santa Monica, CA and rapidly expanding.</p>\n<p>As an engineer, you’ll be expected to do the normal tech startup duties including:</p>\n<ul>\n<li>\n<p>Writing clean, easily-maintainable code. We’re extremely proud of our lack of technical debt and want to keep it that way.</p>\n</li>\n<li>\n<p>Debugging, documentation, and unit testing. Everyone loves a smooth game day.</p>\n</li>\n<li>\n<p>Have a natural knack for user experience and pixel-perfect design. You should know CSS like it’s the back of your hand, and be extremely comfortable building modern responsive web apps.</p>\n</li>\n<li>\n<p>Being flexible about your day-to-day tasks. We do everything from tweaking marketing pages to building the real-time match-play systems and data pipelines. You will wear many hats here.</p>\n</li>\n<li>\n<p>Improving our internal tooling and engineering process by contributing your knowledge and unique background.</p>\n</li>\n</ul>\n<p>What we’re looking for:</p>\n<ul>\n<li>\n<p>4+ years of technical experience</p>\n</li>\n<li>\n<p>Interest in gaming or esports</p>\n</li>\n<li>\n<p>Expert developing interfaces using ReactJS</p>\n</li>\n<li>\n<p>Top-notch CSS skills</p>\n</li>\n<li>\n<p>Comfortable working with WebSockets</p>\n</li>\n<li>\n<p>Degree in Computer Science preferred</p>\n</li>\n</ul>\n<p>At PlayVS, we put a heavy emphasis on inclusiveness, diversity, and most importantly, player experience. Our team is small, scrappy, and incredibly talented. The challenges we solve on a daily basis are exciting and relevant.  This role is $90k+.  If you are driven by seeing the immediate impact that your code brings, you’ll fit right in here.\n</p>\n",
        "how_to_apply": "<p>Email us at <a href=\"mailto:careers@playvs.com\">careers@playvs.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa2RXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c006ca2e3659381100d6f6de12d331553cce4e33/2f5dd3f9-319e-4b5e-ab32-093701b04d06"
    },
    {
        "id": "597d15fc-dda9-11e8-8d8c-9919a5047170",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/597d15fc-dda9-11e8-8d8c-9919a5047170",
        "created_at": "Thu Nov 01 07:40:23 UTC 2018",
        "company": "Shiftling",
        "company_url": null,
        "location": "remote",
        "title": "Full Stack Developer ",
        "description": "<p>Looking for an awesome full-stack web developer with experience on both Node.js and React technologies.</p>\n<p>The role requires a product-focused, self-driven engineer who takes pride in delivering a quality application, and also cares about all the details that will make our users happier.</p>\n<p>Required technical skills:\nNode.js (ability to build a quality backend application that will power-up all web/mobile clients)\nPostgreSQL (use as primary database from the backend application)\nReact (ability to build a modern web application using the React ecosystem)\nCSS (ability to produce a responsive website from given designs)\nGit / GitHub (working with git and GitHub flow)\nContinuous-Integration (CI) (ability to setup and use any CI platform of choice for automated testing and deployments)\nDevops: be familiar with at least one of Heroku, AWS, Google Cloud, Azure.</p>\n<p>Nice to have technical skills:\nGraphQL (ability to build a GraphQL API on the backend, as well as consume it on the React web client)\nExperience on integrating with 3rd party payment APIs</p>\n<p>Other required skills:\nFluent in English (both written and verbal)\nExperienced on working remotely in a fast-paced environment</p>\n<p>Conditions:\nEngagement: full-time (40hr / week), long-term\nLocation: remote, minimum overlap of 4 working hrs with Gulf Standard Time (GST).\nCompensation: negotiable, plus stock options</p>\n",
        "how_to_apply": "<p>Email your resume to <a href=\"mailto:bella@shiftling.com\">bella@shiftling.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa1JXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--31ea7282927da02f0d01e5ecf9a7a08ba1bf4864/29a56b2b-08c7-43fe-a2b1-b64ed771d13c"
    },
    {
        "id": "48d5274e-dd45-11e8-8130-eacb3354d656",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/48d5274e-dd45-11e8-8130-eacb3354d656",
        "created_at": "Wed Oct 31 19:45:06 UTC 2018",
        "company": "Traction",
        "company_url": "https://www.tractionco.com/",
        "location": "Sunnyvale, CA ",
        "title": "Lead Full Stack Developer",
        "description": "<p>The Job:</p>\n<p>Traction is looking for a Lead Full Stack Developer. You should have prior experience architecting and developing advanced dynamic projects involving technologies for Front-end, Back-end, Database, DevOps and Mobile, as well as leading teams of engineers working on these projects.</p>\n<p>This role will see you leading a team of developers as well as being an individual contributor to the team.</p>\n<p>We’re on a mission to become one of the most in-demand agencies in the United States, sought out by the best brands in the world to design meaningful experiences for their customers.</p>\n<p>Must be available to work onsite in Sunnyvale, CA exclusively working embedded with our client that is headquartered in Cupertino.</p>\n<p>Core Responsibilities:</p>\n<ul>\n<li>Act as the primary technical contact for an engineering team with other teams across disciplines, potentially leading a team of 2-5 developers</li>\n<li>Work closely with the development manager to ensure requirements and timelines are met</li>\n<li>Work closely with the development manager and back-end teams to architect and integrate front-end code</li>\n<li>Develop advanced applications with a mixture of third-party and proprietary tools and libraries</li>\n</ul>\n<p>Skills and Experience:</p>\n<ul>\n<li>Experience as a lead developer</li>\n<li>2+ years of experience building websites using HTML, CSS, and JavaScript</li>\n<li>8+ years of experience building web applications with any common web technologies (Node.JS, Java, .Net, PHP, Ruby, Python)</li>\n<li>8+ years of experience with modern web frameworks and/or libraries such as React, Angular, etc.</li>\n<li>8+ years of experience in modeling n-tier applications</li>\n<li>6+ years of experience in database modeling; PL/SQL and SQL. MongoDB is a plus</li>\n<li>Experience writing unit tests for web applications</li>\n<li>Experience with containers and container platforms (Docker, Mesos, Kubernetes)</li>\n<li>Experience in defining continuous integration build processes for front-end web development</li>\n<li>Familiarity with CI/CD strategy (AWS, Heroku, Google Cloud)/</li>\n<li>Knowledge of common design patterns in web development (i.e., MVC, MVVM)</li>\n<li>Working knowledge of source control software such as Git (preferred) or SVN</li>\n<li>Exposure to Agile project management methodologies</li>\n<li>Ability to multi-task and manage tasks with varying priorities</li>\n<li>Must be able to brainstorm and communicate technology ideas and issues with peers and management</li>\n<li>Excellent verbal and written communication skills</li>\n<li>Experience in developing applications for Supply Chain business domain, with more focus on Supply Planning, Demand Planning</li>\n<li>Willingness to learn new technologies and implement in short time</li>\n<li>Comfortable working in a multi-discipline, geographically dispersed team</li>\n<li>Experience in leading a team of developers through all processes of development and integration, including test automation</li>\n</ul>\n<p>Education: BA or BS in computer science or equivalent experience</p>\n<p>Extra Credit:</p>\n<ul>\n<li>Experience with e-commerce</li>\n<li>Knowledge of accessibility specifications</li>\n<li>Experience with GraphQL</li>\n<li>Experience with Scala</li>\n</ul>\n<p>Our humblebrag:\nJoin an award-winning, digitally-focused, full-service, independent agency staffed by a bunch of folks who love what they do and do what they love. Still on the rise after 17 years of success, you’ll enjoy a satisfying suite of benefits, as well as the chance to work on the world's most well-know brand.</p>\n<p>Will you accept our mission?\nTraction is dedicated to creating meaningful advertising, branding, and experiences for our clients and their consumers. In order to accomplish this, we have fostered a culture rooted in autonomy, empowerment, collaboration, and—occasionally—mischief. We believe that great work is spontaneous, and the best ideas come from a diverse team of creatively-minded individuals. Our goal is to be an agency where the journey getting there is as great as the work itself, and we’re looking for the right people to help us do it.</p>\n",
        "how_to_apply": "<p><a href=\"https://traction.applytojob.com/apply/rpfYAlIVTX/Lead-Full-Stack-Developer\">https://traction.applytojob.com/apply/rpfYAlIVTX/Lead-Full-Stack-Developer</a></p>\n",
        "company_logo": null
    },
    {
        "id": "dfa47394-dd33-11e8-96a4-acacdfc6a86d",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/dfa47394-dd33-11e8-96a4-acacdfc6a86d",
        "created_at": "Wed Oct 31 17:40:00 UTC 2018",
        "company": "MetaCommunications, Inc.",
        "company_url": null,
        "location": "Iowa City, Iowa",
        "title": "Senior Software Engineer (Frontend)",
        "description": "<p>MetaCommunications, Inc. is looking for an experienced and passionate Senior Software Engineer (Frontend) to provide software engineering leadership and support using cutting edge technologies to support growing client needs. Join a team of developers to build scalable, full stack Cloud–based offerings. Keep up–to–date with technical trends in the industry and evangelize the adoption of new technologies in solution architectures. Maintain responsibility for personal and team goals, give adequate direction to junior developers, and perform peer code reviews. Work extensively with business analysts and UX engineers to deliver world class solutions for clients.</p>\n<p>Our Technology Stack:</p>\n<ul>\n<li>React / Redux.</li>\n<li>JSON Schema / JSON Rules Engine / JSON Schema Forms.</li>\n<li>TypeScript.</li>\n<li>Jest.</li>\n<li>ES 6 Decorators, Async/ Await.</li>\n<li>Material UI, Bootstrap, Foundation, Styled Components.</li>\n<li>Webpack.</li>\n<li>Docker / Kubernetes / Kafka / Elasticsearch.</li>\n</ul>\n<p>Job Description:</p>\n<p>MetaCommunications is looking for a talented Frontend Engineer to join our team. We are looking for someone with strong JavaScript skills and a passion for developing solutions that impact Fortune 500 Companies on a daily basis. We are a tight knit team that is focused on providing excellent service to our customers.</p>\n<p>Individuals who succeed in this position are exceptional at sharing information, enthusiastic, learn quickly and seek opportunities for developing themselves and the team around them. We're looking for someone who isn't scared of the unknown and likes pushing the envelope. No day will look the same, but you will always be expected to rise to the occasion and overcome challenges.</p>\n<p>Join our team and you will:</p>\n<ul>\n<li>Work with a high-performing team to deliver solutions for some of the world’s top brands</li>\n<li>Develop new user-facing features using React.js</li>\n<li>Translate designs and wireframes into high quality code</li>\n<li>Optimize components for maximum performance</li>\n<li>Grow in your knowledge of business processes as you see how some of the world’s top brands operate their creative and marketing teams</li>\n</ul>\n<p>Need to have:</p>\n<ul>\n<li>3+ years of experience with JavaScript</li>\n<li>2+ years of experience with software development</li>\n<li>1+ years of experience with React.js and Redux</li>\n<li>Experience with REST or JavaScript</li>\n<li>Experience with Agile development methods, including TDD, CI, or automated testing</li>\n<li>Git, Gitflow, d Experience using a version control system, such as git, mercurial, perforce</li>\n<li>BA or BS degree</li>\n<li>Experience with CSS pre–processor, including LESS or SASS</li>\n<li>Experience with server-side technologies-Node.js, .Net Core</li>\n<li>Experience with issue tracking and change control tools, Team Services, YouTrack, or Jira</li>\n<li>Experience with building and consuming REST APIs</li>\n<li>Experience with relational database systems, including PostgreSQL, SQL Server, or MySQL</li>\n<li>Experience with technical document writing</li>\n<li>Knowledge of IaaS Cloud hosting solutions, including AWS or Azure</li>\n<li>Possession of excellent oral and written communication skills</li>\n<li>Knowledge of web technologies</li>\n<li>Experience with relational databases and T-SQL</li>\n<li>Experience working with a team of developers on software applications</li>\n</ul>\n<p>How to apply:\n<a href=\"https://www.workgroups.com/about/careers/?p=job%2Foeqh8fwN\">https://www.workgroups.com/about/careers/?p=job%2Foeqh8fwN</a></p>\n<p>Company Statement:</p>\n<p>MetaCommunications is a leader in providing innovative project management software for the world’s best creative teams. Our mission is simple: to build great products that make the best creative teams as productive as possible.</p>\n<p>Our Perks/Benefits:\nWe're a fun team. We build awesome products, solve hard problems and keep a good life balance. Our culture is one of our biggest strengths. In our company, people treat each other with respect and compassion, and together cultivate a culture of teamwork, learning, accountability, and fun. There’s a commitment to understanding the whole person, helping to create a shared, unquestioning environment.</p>\n<ul>\n<li>Medical/Dental Insurance</li>\n<li>401K</li>\n<li>Generous PTO, including both maternal and paternal paid time off</li>\n<li>Optimal workspace in the heart of downtown Iowa City</li>\n<li>$20/month local gym membership within walking distance</li>\n<li>Flexible work environment</li>\n</ul>\n<p>Why work at Meta? We LOVE...\nOur customers:</p>\n<ul>\n<li>Ability to work directly with our customers, many of whom are Fortune 500 companies.</li>\n<li>Opportunity to see the software through the customer lens.</li>\n</ul>\n<p>Our people:</p>\n<ul>\n<li>We are passionate about what we do.</li>\n<li>We collaborate to identify solutions to problems.</li>\n<li>We challenge each other to be better.</li>\n<li>Continuous learners.</li>\n<li>A great mix of cultures and backgrounds.</li>\n<li>We hang out outside of work hours.</li>\n<li>Talented colleagues who want to solve customer issues using an innovative technology.</li>\n<li>People and talent-oriented leadership.</li>\n</ul>\n<p>Our products:</p>\n<ul>\n<li>Exciting technology.</li>\n<li>Environment allows you to quickly learn how software is developed, deployed and maintained.</li>\n<li>Fast-paced environment with new challenges at every turn.</li>\n<li>Opportunities to learn and grow into new roles.</li>\n<li>Dramatically improve the work experience for our customers.</li>\n</ul>\n<p>Our workspace:</p>\n<ul>\n<li>Located in the heart of beautiful downtown Iowa City, only steps from the best eateries.</li>\n<li>Great view of the Ped Mall.</li>\n<li>Natural light everywhere!</li>\n<li>Farmer’s Market Wednesday.</li>\n<li>Inside bike racks</li>\n<li>Free downtown parking</li>\n</ul>\n<p>About MetaCommunications:\nMetaCommunications develops workflow and collaborative productivity solutions that help marketing, creative design, packaging teams and enables workgroups around the world be more productive.</p>\n<p>Our mission is to bring to market new innovative brands, products and approaches to help marketing teams improve creativity, performance and output that delivers dramatic growth and created value for their organization. Our vision is to be a global leader in innovative management solutions that allow people to collaborate, communicate and deliver anytime, anywhere, with speed and simplicity.</p>\n<p>Meta’s team members are collaborative, driven, hungry, fearless problem solvers, flexible and uniquely talented. We find new ways to continually improve our products and services with convenience, security, and reliability for the customer as our key goals. Our culture is people-oriented, with continuous learning is at its core. Our main office is located in downtown Iowa City, IA.</p>\n<p>As a customer-obsessed organization focused on creating win-win relationships, there are many exciting reasons to join the Meta team. We provide competitive salaries, quality healthcare and an enjoyable office environment. We are deeply mission and vision driven and support flexible schedules when needed.</p>\n<p>MetaCommunications has a dynamic, fast-paced, and entrepreneurial environment, which requires a professional, flexible, self-starter orientation. We believe in hiring the best, the brightest, and cultivating a culture of collaboration and appreciation. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, creed, color, religion, sex, sexual orientation, gender identity, national origin, marital status, citizen status, age, disability, military or protected veteran status, genetic predisposition or carrier status or any other legally protected status.</p>\n",
        "how_to_apply": "<p><a href=\"https://www.workgroups.com/about/careers/?p=job%2Foeqh8fwN\">https://www.workgroups.com/about/careers/?p=job%2Foeqh8fwN</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUJXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c6aeed882da03478723a4bbc3bc1ccd2df767b97/97e6e5d2-60e1-49e5-a5a1-a41e960f00be"
    },
    {
        "id": "4ef36d90-dc62-11e8-9d0f-2748d202bd44",
        "type": "Contract",
        "url": "https://jobs.github.com/positions/4ef36d90-dc62-11e8-9d0f-2748d202bd44",
        "created_at": "Tue Oct 30 16:39:18 UTC 2018",
        "company": "Adaptive Financial Consulting Ltd",
        "company_url": "http://weareadaptive.com",
        "location": "London, UK",
        "title": "Web Applications Developer (JavaScript, HTML, React, Finance)",
        "description": "<p>WE OFFER: Greenfield projects, fantastic, collaborative teams and modern web technology.</p>\n<p>We are working on building greenfield trading system and looking for Web Applications Developers (JavaScript, HTML, CSS and ideally React) to join our growing team. You will work alongside a collaborative and welcoming Adaptive team. </p>\n<p>WHO WE ARE</p>\n<p>We are Adaptive, a growing and successful software company with a great reputation amongst staff and clients alike. We work closely with our financial clients to build bespoke software solutions to support their business goals. Our client's success relies on us making sound technical decisions, collaborating with stakeholders and being up to date with the latest technology and practices in the Fintech industry. </p>\n<p>WHO YOU ARE</p>\n<p>Does crafting elegant and performant software solution excite you? Are you eager to move into/continue your career in the finance industry? Would you like the opportunity to learn from industry-leading consultants in a laid-back, professional and friendly environment? You will be able to clearly model, articulate and solve complex problems. You will have a strong passion for software engineering and technology, actively contributing to the team’s expertise. We value those who are not afraid to be out of their comfort zone. Opportunities often arise where developers are able to gain exposure in many areas of software development/business. We are looking for team players who are proactive and use their initiative.</p>\n<p>You will:</p>\n<ul>\n<li>Work with a skilled, collaborative and friendly team.</li>\n<li>Work in a test-driven, Agile development fashion. You will remain abreast of the newest developments in technology and quickly adapt to them to achieve better results.</li>\n<li>Prioritise delivery over your own technical curiosity (although of course, we want you to be technically curious!).</li>\n</ul>\n<p>Required skills and experience:</p>\n<ul>\n<li>Solid, professional web development experience</li>\n<li>Significant knowledge of JavaScript: you understand prototypical inheritance, scope, and closures</li>\n<li>Proficiency in user experience technologies like JavaScript, HTML5, CSS3, and frameworks such as Angular.js or React.js</li>\n<li>Experience integrating with systems written in Java</li>\n<li>Armed with a strong desire to raise the bar for your team technically, you are tenacious, curious, and collaborative in all aspects of your work</li>\n<li>A quick learner with excellent communication skills</li>\n<li>BSc/MSc in Computer Science or equivalent</li>\n<li>Language: English (fluent)</li>\n</ul>\n<p>Desirable skills and experience:</p>\n<ul>\n<li>Experience working with distributed teams</li>\n<li>Experience with TypeScript, Rx.js, Redux</li>\n</ul>\n<p>Some of our success stories include:</p>\n<p>An app store that allows users to browse available apps and install to their desktop without Administrator rights. The system provides an auto-update mechanism and also captures usage statistics</p>\n<p>Adaptive brought our experience in large-scale e-commerce platforms to quickly specify and agree an architecture with the client. The design enabled rapid development in the short term but also granted flexibility and agility in the long term.</p>\n<p>Please note that the successful candidate will need to have a background check due to the kind of projects we work on.</p>\n<p>Adaptive's Privacy Notice for Candidates can be found here: <a href=\"https://weareadaptive.com/privacy-notice-applicants-adaptive-financial-consulting-ltd/\">https://weareadaptive.com/privacy-notice-applicants-adaptive-financial-consulting-ltd/</a></p>\n<p>WHAT WE CAN OFFER YOU</p>\n<ul>\n<li>\n<p>A competitive salary package/rate</p>\n</li>\n<li>\n<p>Experienced, supportive, smart and friendly colleagues</p>\n</li>\n<li>\n<p>Work with high-profile clients using the latest technology stacks.</p>\n</li>\n<li>\n<p>Friday beers!</p>\n</li>\n</ul>\n<p>THE INTERVIEW PROCESS</p>\n<p>Don't worry, we won't put you through tens of interviews! We'll review your application and if it's aligned with what we're looking for, we'll arrange a phone call with you. If after that phone call, we're both happy to proceed, we'll arrange for you to speak with someone in the technical team by phone. If that goes well and we're all still happy, we'll invite you to our offices to meet with us for an interview </p>\n<p>You can find out more about our company by visiting weareadaptive.com. Search for us on Glassdoor to find out what our staff think about us.</p>\n<p>Please note that this role is open to direct candidates only; strictly no agencies or third parties. We will not accept unauthorised submissions but if you choose to disregard this and the candidate looks good, who knows, we might contact them directly....</p>\n<p>In return, we offer a very positive work environment that’s informal, friendly and truly collaborative. We have plenty of informal and formal get-togethers and team lunches. You can find out more about us by visiting our website.</p>\n",
        "how_to_apply": "<p>Please apply via this link: <a href=\"https://grnh.se/cb8994e21\">https://grnh.se/cb8994e21</a></p>\n",
        "company_logo": null
    }
]