[
  {
    "id": "cc10f91b-1ccf-406a-9228-0b357db7481f",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/cc10f91b-1ccf-406a-9228-0b357db7481f",
    "created_at": "Wed Feb 12 20:10:31 UTC 2020",
    "company": "PolicyStat RLDatix",
    "company_url": "https://rldatix.com/en-us/products/policy-management",
    "location": "Indianapolis, IN",
    "title": "Python + Django Software Engineer",
    "description": "<h1>Make An Impact On Healthcare</h1>\n<p><a href=\"https://rldatix.com/en-us/products/policy-management\">PolicyStat's</a> mission is to improve healthcare delivery through better processes. We help our clients make their policies and procedures easier to find, access, and manage. Hundreds of hospitals use our SaaS application to ensure that this critical information is correct, their staff can find it, and that it supports regulatory compliance.</p>\n<p><a href=\"https://hub.jhu.edu/2016/05/03/medical-errors-third-leading-cause-of-death/\">More than 250,000 Americans die each year as a result of medical error</a>. Many of these deaths could have been prevented with existing best practices for quality and patient safety. A hospital's best tool for standardizing and implementing these life-saving improvements are their written policies and procedures.</p>\n<h1>Python + Django Software Engineer</h1>\n<p><strong>ON-SITE</strong>: Indianapolis, IN or Toronto, Canada</p>\n<p><strong>REMOTE</strong>: Indiana, New Jersey, and other locations</p>\n<p>As a critical member of our small product team, you'll assume several roles including back-end and front-end development, on-call support, API design, architecture, operations and database engineering.</p>\n<h2>Technical Requirements</h2>\n<ul>\n<li>Demonstrated proficiency with Python and Django</li>\n<li>Demonstrated understanding of Linux, Git, JavaScript, CSS and HTML5</li>\n</ul>\n<h2>Cultural Requirements</h2>\n<ul>\n<li>Ability to work effectively and collaborate on a small team.</li>\n<li>Excellent communication skills and strong teamwork ethic.</li>\n<li>Passion and enthusiasm for creating amazing products and delivering unparalleled user experience.</li>\n<li>Strongly motivated by opportunities to positively impact the direction of the company and products.</li>\n</ul>\n<h2>Responsibilities</h2>\n<ul>\n<li>Serve in the weekly rotation for triage of escalated support questions and server alerts.</li>\n<li>Take initiative to address pain points that you and/or the team experience by working to improve the software, tools or processes of PolicyStat.</li>\n<li>Review code contributed by the team and get it ready for production.</li>\n<li>Design, develop, document, and write automated tests for new features.</li>\n<li>Proactively analyze, diagnose, and resolve software regressions.</li>\n<li>Write well designed, testable, efficient code.</li>\n</ul>\n<h2>Highly Desired Skills</h2>\n<ul>\n<li>Demonstrated proficiency with React, GraphQL, MySQL, IPSec, SAML.</li>\n<li>A GitHub profile with lots of code and experience contributing to open source projects.</li>\n</ul>\n<h2>Compensation and Benefits</h2>\n<ul>\n<li>Market-based salary from $80k to $110k+ USD</li>\n<li>Health (including telemedicine) with HSA, dental, vision, disability, and life insurance</li>\n<li>10 paid holidays</li>\n<li>PTO: 15 days each year to start; 20 days starting the calendar year of third anniversary</li>\n<li>Annual paid team trip to engineering conference (Djangocon, pycon, etc)</li>\n<li>(on-site) Weekly catered team lunches</li>\n</ul>\n<h1>About PolicyStat</h1>\n<ul>\n<li>Founded in 2006, <a href=\"https://www.prnewswire.com/news-releases/rldatix-to-acquire-icontracts-300848612.html\">acquired</a> by <a href=\"https://www.rldatix.com\">RLDatix</a> in 2019.</li>\n<li>Technology stack: Python 3.7, Django 2.2, AWS (RDS, EC2, S3), Ubuntu Linux, MySQL, GraphQL, React (work in progress)</li>\n<li>Toolkit: Git, Vagrant, VirtualBox, Trello, <a href=\"https://github.com/PolicyStat\">GitHub</a>, Jenkins, continuous delivery / daily deploys (1000 in 2019), fast iterations</li>\n<li>See our <a href=\"https://stackoverflow.com/jobs/companies/policystat\">Stack Overflow Company</a> page</li>\n</ul>\n<h1>Apply</h1>\n<h2>Interview Process</h2>\n<ul>\n<li>Application review.</li>\n<li>Complete a <a href=\"https://medium.com/policystat-product-development/why-all-jobs-interviews-should-include-doing-real-work-34b54d393939\">work sample</a> (&lt; 60 minutes) in Python.</li>\n<li>Phone or video conversation with the team lead (&lt; 30 minutes).</li>\n<li>Complete a work sample (&lt; 3 hours) in Python + Django.</li>\n<li>Culture conversation with team members (on-site, if possible, otherwise remote video conference).</li>\n</ul>\n<p><a href=\"../interview_process.md\">See more details</a></p>\n<h2>Remote Locations</h2>\n<p>We can hire individuals for full time employment who reside in\nCalifornia, Texas, Massachusetts, South Carolina, Florida, Pennsylvania, Illinois, Idaho, Indiana, Kentucky, Michigan, Missouri, New Jersey, New Mexico, Washington or some parts of Canada.\n<strong>If you reside in some other location, we can only pay you through a company</strong>.\nIf you have not already created a company\n(one that is responsible for taxes and can legally receive payments),\nyou will either need to create one,\nor alternatively we can hire you through a service such as\n<a href=\"https://upwork.com\">Upwork</a>.</p>\n<p><a href=\"http://bit.ly/pstat-jobs-python-django-engineer-2020-apply-github\">Click here to apply (Google Form)</a></p>\n",
    "how_to_apply": "<p><a href=\"http://bit.ly/pstat-jobs-python-django-engineer-2020-apply-github\">http://bit.ly/pstat-jobs-python-django-engineer-2020-apply-github</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc1YrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--bf59a414f124093d99f8a1fee3e69e7170bfd7ca/PolicyStat_Print_Full-Color-iContracts-v2.png"
  },
  {
    "id": "e88f3540-77d4-4559-ad3d-9d59f2f824d7",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/e88f3540-77d4-4559-ad3d-9d59f2f824d7",
    "created_at": "Wed Feb 12 16:59:07 UTC 2020",
    "company": "Toptal",
    "company_url": "https://topt.al/KAcqXg",
    "location": "Remote",
    "title": "React Native Developer – Remote",
    "description": "<p>Are you interested in a lucrative career as a freelance developer? With freelancing on the rise, thousands of developers worldwide are changing the way they work, from full-time employment to full-time remote freelancing. At Toptal, you’ll find remote freelance opportunities with leading global companies, on your terms.</p>\n<p>Unlike a regular nine-to-five job or, more often what can feel like a nine-to-nine job, working with Toptal means choosing your own projects from the world’s leading organizations, on your own hours and at the rate you decide. Our robust screening process helps ensure that you won’t have to bid against other freelancers and can maintain a steady stream of work. It’s the type of work/life balance that empowers you to travel the world, or stay at home. You’re in control of shaping your environment to however you work best while establishing yourself as an elite developer.</p>\n<p>To learn more from Toptalers that made it big through freelancing, check out the following article: <a href=\"https://topt.al/5jcRrP\">https://topt.al/5jcRrP</a></p>\n<p>Developers in our elite network share:</p>\n<ul>\n<li>English language proficiency</li>\n<li>3+ years of professional experience</li>\n<li>Project management skills</li>\n<li>A keen attention to detail</li>\n</ul>\n<p>Note: We are looking for talent who are able to freelance on a full time basis.\nIf you’re interested in joining the Toptal network, take the next step by clicking on the following link and completing the short form: <a href=\"https://topt.al/xRcxRa\">https://topt.al/xRcxRa</a></p>\n",
    "how_to_apply": "<p>If you’re interested in joining the Toptal network, take the next step by clicking on the following link and completing the short form:\n<a href=\"https://topt.al/xRcxRa\">https://topt.al/xRcxRa</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBclIrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e8054a405b41ec30724e2c62f68aaa53e71b6c76/Toptal%20Logo%20Main%20Colors-RGB.jpg"
  },
  {
    "id": "677e6c8d-5880-4784-bf28-fc37d1b3ce11",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/677e6c8d-5880-4784-bf28-fc37d1b3ce11",
    "created_at": "Wed Feb 12 15:10:10 UTC 2020",
    "company": "CGM France",
    "company_url": "https://www.cgm.com/de/index.de.jsp",
    "location": "Nanterre",
    "title": "Architecte logiciel e-Santé",
    "description": "<h2><strong>En tant que Architecte Logiciel e-Santé confirmé vous êtes acteur de la eSanté!</strong></h2>\n<p>Nous sommes des pionniers de la santé numérique et passionnés par le développement et l’implémentation de nouvelles technologies. Pour poursuivre notre croissance, nous recherchons des Collaborateurs engagés et dynamiques qui s’épanouiront au sein de nos équipes tout en poursuivant leur projet professionnel.</p>\n<h2><strong>Vous contribuerez à notre succès en:</strong></h2>\n<p>Rattaché(e) au Responsable Développement, vous interviendrez dans les équipes de développement de Produit (\"feature team\") qui assurent la maintenance et l’évolution de nos logiciels dans un cadre Agile Scrum.\nVotre rôle se décline sur les axes suivants :</p>\n<ul>\n<li>Réalisation d'études d'impact sur le SI suite à des demandes de changements fonctionnels, sur un mode agile</li>\n<li>Design de la solution en amont, dans le respect de la cible d'architecture du SI en transformation dont vous alimentez la construction</li>\n<li>Référent auprès des développeurs sur les normes de développement et les outils de la forge logicielle que vous contribuez à soutenir et améliorer</li>\n<li>Implémentations des sujets techniques complexes, des services d'entreprise et des frameworks nécessaires aux développeurs</li>\n<li>Accompagnement sur le projet pour porter et cadrer les sujets techniques dans la roadmap fonctionnelle</li>\n</ul>\n<h2><strong>Nous attendons de vous:</strong></h2>\n<ul>\n<li>Expérience significative dans un poste de développement, dans une équipe à taille humaine et dans un contexte international et multiculturel</li>\n<li>Capacité à prendre de la hauteur et à travailler de façon constructive avec les analystes fonctionnels (MOA Produit), le Scrum Master et le manager</li>\n<li>Capacité à gérer plusieurs sujets en parallèle</li>\n<li>Capacité à expliquer la solution technique et accompagner les développeurs dans son implémentation</li>\n<li>Capacité à avancer par itérations et baby-steps</li>\n<li>Autonome, organisé et méthodique</li>\n<li>Créatif, Constructif et orienté-résultats</li>\n<li>Sens des responsabilités, facilitateur et engagé à aider les équipes à atteindre leurs objectif</li>\n<li>Niveau expert en langage de programmation .NET C#(Client lourds, Web Services, ASP.NET, .NET Core) et expérimenté en JS (Angular ou REACT)</li>\n<li>Maîtrise des concepts et connaissance des outils d'une forge logicielle orientée CI/CD (Jira, Git/Gitflow, Gital-CI, Azure Devops, Jenkins, etc…)</li>\n<li>Expérience sur la gestion et l'évolution d'un système legacy</li>\n<li>Maîtrise des pratiques d'architecture services/micro-services et des conteneurs</li>\n<li>Capacité à prototyper et itérer sur la définition de la solution</li>\n<li>Expérience souhaitée sur des outils et méthodologies orientés tests (TDD, BDD)</li>\n<li>Français et Anglais courant</li>\n<li>Parfaite maîtrise des outils bureautiques classiques (Mail, Internet, Excel, Word, Visio …)</li>\n</ul>\n<h2><strong>Nous vous offrons:</strong></h2>\n<ul>\n<li>Votre environnement de travail est agréable, moderne et dynamique</li>\n<li>Vous rejoignez un groupe international de 5000 personnes, avec de réelles opportunités de carrière en France et à l’étranger</li>\n<li>Vous participez au futur de la e-santé, en rejoignant un acteur majeur de ce secteur</li>\n</ul>\n<p>Nous sommes impatients de recevoir votre candidature ainsi que vos prétentions salariales.</p>\n<p><a href=\"https://compugroupmedical.redirect.your-jobresponse.com/architecte_logiciel_e_sante_nanterre/263747/V819/apply\">Cliquez ici pour accéder au formulaire de candidature!</a></p>\n<p><strong>Synchronizing Healthcare</strong></p>\n<p><strong>Rejoignez-nous!</strong></p>\n<p><strong>Référence:</strong>\nreq3362</p>\n<p><strong>Lieu:</strong>\nMontpellier</p>\n<p><strong>Domaine:</strong>\nSoftware Development</p>\n<p><strong>Contact:</strong>\n<a href=\"mailto:career@cgm.com\">career@cgm.com</a></p>\n<p>T +33 (0) 147 162 679</p>\n<ul>\n<li>Groupe international leader dans la eSanté</li>\n<li>Plus de 717 Million d’Euros de CA en 2018</li>\n<li>Environ 5 000 employés dans le monde</li>\n<li>Une base Client unique de plus de 1 million d’Utilisateurs</li>\n<li>Nos équipes sont présentes dans 19 pays et ont des Clients dans 55 pays</li>\n<li>Plus de 30 d’expérience</li>\n</ul>\n",
    "how_to_apply": "<p><a href=\"https://compugroupmedical.redirect.your-jobresponse.com/architecte_logiciel_e_sante_nanterre/263747/V819/apply\">Cliquez ici pour accéder au formulaire de candidature!</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcWwrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cb2606e35ea1388f296d20b53950223f242d7fb9/Compugroup%20logo.jpeg"
  },
  {
    "id": "8b49f1bd-27af-4464-9d90-96b501cfe718",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/8b49f1bd-27af-4464-9d90-96b501cfe718",
    "created_at": "Wed Feb 12 08:47:12 UTC 2020",
    "company": "Virail GmbH",
    "company_url": "https://www.virail.com/",
    "location": "BERLIN",
    "title": "Frontend Engineer - UX (m /w / d)",
    "description": "<h1>What we do</h1>\n<p>Virail is a travel transportation portal with customers across more than 30 countries. Every year we help more than 60 million users find the perfect solution for their trip. Our comparison tool works with more than 2000 transportation companies and lets you find the optimal travel solutions, no matter your needs.</p>\n<p>Who we are We’re a team of seasoned industry professionals with experience in major firms including Google, Trivago, Facile.it, Smava, Jimdo and Happycar, now on a quest to make travel easier and faster for everyone.</p>\n<h1>Your tasks</h1>\n<p>You will join a cross-functional team consisting of engineering and product professionals. Our team is in charge of improving the virail web application with the goal to provide the best travel solution possible for our users.</p>\n<p>You will be the owner of UX on the engineering side. You will focus on shaping our web frontend by creating new exciting features and providing A/B testing capabilities, although there are of course touch points with the backend side. When the need occurs you will work together with product in the conception phase by implementing prototypes as well as including your own creative ideas to make our platform exciting. Our vision is to create a culture of experimentation which unlocks the creative potential of the entire company and you will be a core contributor to this new culture.</p>\n<h1>Must have</h1>\n<ul>\n<li>3+ years of Javascript development and React library.</li>\n<li>2+ years experience with PHP development.</li>\n<li>Very good understanding of frontend technologies.</li>\n<li>Good knowledge of CSS, SCSS, SASS.</li>\n<li>Experience with UX best-practices (especially on mobile) and A/B testing.</li>\n<li>Familiar with MVC pattern based software development.</li>\n<li>Experience with API implementation.</li>\n<li>Loves to work with Unix environments (we use Debian internally).</li>\n<li>Good communication in English.</li>\n</ul>\n<h1>Nice-to-have</h1>\n<ul>\n<li>Experience with SQL/Postgres.</li>\n<li>Contribution to the open source community.</li>\n<li>Experience with Vue.js</li>\n</ul>\n<h1>Your mindset</h1>\n<p>You like to work independently and being the owner of your tasks. Of course you won’t be left alone and your peers will support you any time. You have an agile mindset and support the idea of self-managed teams. We offer</p>\n<ul>\n<li>Prime office location in the heart of Berlin. Free coffee and snacks.</li>\n<li>Open remote work policy and flexible working hours.</li>\n<li>Unrestricted freedom to apply your ideas to a fast growing business.</li>\n<li>Mentorship from seasoned industry veterans.</li>\n<li>Competitive salary.</li>\n</ul>\n<p>Interested?\nSend an email to <a href=\"mailto:jobs@virail.com\">jobs@virail.com</a></p>\n",
    "how_to_apply": "<p>Send an email to <a href=\"mailto:jobs@virail.com\">jobs@virail.com</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbmQrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7a0653f18d124e7ab8fbdd914c19be1d685538c2/virail%20logo.jpg"
  },
  {
    "id": "a1ab6d2f-ec9b-48de-b6b8-03146ea3ac2c",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/a1ab6d2f-ec9b-48de-b6b8-03146ea3ac2c",
    "created_at": "Tue Feb 11 17:37:20 UTC 2020",
    "company": "Last Call Media",
    "company_url": "http://www.lastcallmedia.com",
    "location": "Remote",
    "title": "PHP Engineer (Remote)",
    "description": "<p>Last Call Media is looking for a well rounded PHP developer to join our team!</p>\n<p><strong>The Role</strong></p>\n<p>Last Call Media is looking for someone who understands just how flexible the PHP programming language can be, and enjoys, neh, is proud that the majority of the internet uses the PHP language.</p>\n<p>The ideal candidate will have experience in PHP frameworks such as WordPress, Symfony, Drupal, CodeIgniter but also has been involved with big single PHP files with inline CSS/HTML/(My)SQL/PHP. Last Call Media is looking for an advocate of best practices and someone who is willing to be opinionated about what they believe in when it comes to building successful programming projects.</p>\n<p>Last Call Media is a fully distributed company so you can work from anywhere, but we ask that you be able to commit to at least 5 hours of overlap with New York time (ET), Monday through Friday.</p>\n<p><strong>What you’ll do:</strong></p>\n<ul>\n<li>Review and analyze existing PHP sites for ways to improve and/or provide advice on how to migrate off antiquated monolith systems. Implement analyses from start to finish.</li>\n<li>Work with clients to communicate how and why existing PHP code works or doesn’t.</li>\n<li>Create and maintain product roadmaps, feature backlogs and product documentation, and user stories.</li>\n<li>Understand who the end user of a project is and how to build and/or suggest front-end interfaces to help them accomplish their tasks as simply and practically as possible.</li>\n<li>Participate in team and company retrospectives to help define and refine working agreements and processes to help us work more effectively together as a team.</li>\n</ul>\n<p><strong>What you’ll bring:</strong></p>\n<ul>\n<li>A proven track record of leading the delivery of digital products and services that delight customers.</li>\n<li>3+ years of similar experience in a digital agency, consultancy, or equivalent setting where you were accountable to several client engagements.</li>\n<li>An obvious drive to grow and learn from the highly-skilled team around you</li>\n<li>Experience with large-scale open source web technologies (such as Drupal, WordPress, and React).</li>\n<li>Experience and/or a desire to work remotely.</li>\n<li>Ability to work efficiently, sometimes under tight deadlines</li>\n</ul>\n<p><strong>It’d be nice if you also had:</strong></p>\n<ul>\n<li>Front-end framework experience like ReactJS/AngularJS/VueJS</li>\n<li>Relational database experience and understanding of how to improve DB performance</li>\n<li>Server administration and/or setups like Apache/NodeJS/Nginx and a general comfortability in the Linux environment</li>\n<li>Familiarity with Atlassian tools, such as Jira and Confluence.</li>\n</ul>\n<p><strong>All of us at LCM pride ourselves on being:</strong></p>\n<ul>\n<li>Able to empathize, which helps us understand the need of the client, the customer, the product, and the team at LCM.</li>\n<li>Highly communicative</li>\n<li>Able to work independently</li>\n<li>Comfortable asking for help</li>\n<li>Experienced with communicating directly with clients</li>\n<li>Eager and motivated to learn new concepts</li>\n<li>A team player in a collaborative environment</li>\n<li>A fast learner</li>\n</ul>\n<p><strong>Application Process</strong></p>\n<p>Applicants should submit through the careers section a current resume and cover letter that includes links to a few digital products you completed recently and an answer to the following question: In 3-5 sentences please share a little about what, in your opinion, the biggest challenges are working at an all remote company. If you haven’t worked for an all remote company, please try and answer the question anyway! Lastly, while resumes and interviews are a great way to learn more about you, all candidates should be prepared to complete a brief hypothetical virtual recruitment exercise and submit reference(s) upon request.</p>\n<p>To apply visit: <a href=\"https://lastcallmedia.com/careers\">https://lastcallmedia.com/careers</a></p>\n<p>This position is compensated at a salary commensurate with skill and experience, with comprehensive benefits including an annual professional development budget, and varied, engaging work for enterprise-level clients. If this position already sounds like you or sounds like where you're headed, please reach out! Applicants should submit a current resume and cover letter through the careers section and should be prepared to submit a code sample(s) and reference(s) upon request.</p>\n",
    "how_to_apply": "<p>To apply visit: <a href=\"https://lastcallmedia.freshteam.com/jobs/sMPI2WIGv6Dl/php-engineer-remote\">https://lastcallmedia.freshteam.com/jobs/sMPI2WIGv6Dl/php-engineer-remote</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbXgrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8335d8a37becbfe0d0dbca605c721b510c5895ee/LCM_Secondary_Logo_Red_RGB.png"
  },
  {
    "id": "60d06501-244b-4e0d-9dd8-0caa71685111",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/60d06501-244b-4e0d-9dd8-0caa71685111",
    "created_at": "Mon Feb 10 19:55:03 UTC 2020",
    "company": "Kite",
    "company_url": "http://kite.com",
    "location": "San Francisco",
    "title": "Software Engineer, Developer Tools",
    "description": "<p><em>“I really love the line-of-code completions in the new kite.com.” — Guido van Rossum, creator of Python</em></p>\n<p>Programmers spend too much time doing repetitive work — copying and pasting from StackOverflow, fixing simple errors, and writing boilerplate code. We're building an AI code engine that does this work for you. Programming using Kite is faster and more fun.</p>\n<p>Kite is well-funded by top investors in Silicon Valley, including the founders of PayPal, Stripe, Palantir, and Dropbox to name a few. We are looking to expand our 15-person startup with talented individuals who are interested in joining an early stage startup. The ideal candidate is excited to help guide the direction of our product and company. They will have a significant amount of ownership of critical technical components. Our team is growing rapidly and we hope you'll grow with us too!</p>\n<p><strong>What you’ll do:</strong></p>\n<ul>\n<li>Wear many hats, work with multiple components in different parts of the stack</li>\n<li>Define, develop and perform performance/scalability benchmarks for the Kite app</li>\n<li>Utilize various profiling tools to identify performance and concurrency bottleneck, propose and implement optimizations to improve the Kite product</li>\n<li>Contribute to the development of core product features and initiatives</li>\n<li>Collaborate with the product team on improving the user experience of the Copilot, website and editor plugins</li>\n</ul>\n<p><strong>What you’ve done:</strong></p>\n<ul>\n<li>A track record of working in small teams to build new software from scratch</li>\n<li>Experience building complex software outside of frameworks or existing infrastructure</li>\n<li>Ability to learn and evaluate new technologies quickly</li>\n<li>Experience taking ownership of projects and delivering results</li>\n<li>Experience with backend and/or frontend technologies (e.g Go/Java/C++, Javascript/Nodejs/React)</li>\n<li>Worked with multiple platforms (Windows, Linux, macOS)</li>\n<li>Nice to have: Experience with Go, native client software, and/or DevOps</li>\n</ul>\n<p><strong>Who you are:</strong></p>\n<ul>\n<li>Bachelor’s Degree in Computer Science or related field</li>\n<li>Minimum of 3+ years of engineering experience</li>\n<li>Experience building reliable and scalable systems</li>\n<li>Ability to work daily from our San Francisco office (wonderful office in the bustling Financial District area)</li>\n<li>Excited to work on a small, growing team in a startup environment</li>\n</ul>\n",
    "how_to_apply": "<p><a href=\"https://jobs.lever.co/kite\">Apply Here</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa3grIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0b893cf00d6c1a5c5f93ef77a357a9492665d804/%2311182F%20-%20dark%20navy%202x%20Twitter%20Logo.png"
  },
  {
    "id": "7b7d433d-caf3-4b1b-9cf1-e4c25d560a53",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/7b7d433d-caf3-4b1b-9cf1-e4c25d560a53",
    "created_at": "Fri Feb 07 18:03:55 UTC 2020",
    "company": "Fundera",
    "company_url": "https://www.fundera.com/",
    "location": "New York",
    "title": "Senior Software Engineer",
    "description": "<p>Fundera</p>\n<p>Here’s the thing—we hate traditional job descriptions. In our experience, they’re a terrible representation of what a job really entails and never paint a true picture of what it’s like to work at an organization.</p>\n<p>That’s why, at Fundera, we do things differently. Instead of presenting you with some run-of-the-mill job description, we offer potential candidates our Job Spotlights. This gives us a chance to tell you the story of us, why you should work here, and what the role is really like.</p>\n<p>Who’s Fundera and Why Should I Care?</p>\n<p>Fundera is the go-to financial resource for small businesses. We’re here to help entrepreneurs achieve their financial goals and grow businesses as big as their aspirations.</p>\n<p>As a catalyst for smart financial decisions, our combination of proprietary technology and financial expertise provides business owners with tailored solutions based on their unique needs and eligibility—helping them prosper, create more jobs, and, ultimately, grow the economy.</p>\n<p>Armed with one of the most experienced and passionate leadership teams in the business and backed by the industry’s leading investors, we’ve made a big impact on Main Street in just a short amount of time (Fundera launched in 2014 and has helped 35,000+ small businesses find their best financial solutions and secure over $1 billion in funding).</p>\n<p>We’re experiencing massive growth year over year, and our impact on America’s job creators grows with us. We’re looking to further our impact and need incredible, ambitious, mission-oriented people to get there.</p>\n<p>If you want to make a difference, if you want to create a workplace and life you love, and if you want to learn more and grow faster than you will at any other point in your career, you should keep reading.</p>\n<p>What Is It Like to Work Here?</p>\n<p>The easiest way to answer this is to check out our great rating on Glassdoor, take a deep dive into a few of our employee profiles, or look into some of our recent awards, like Crain’s Best Places to Work. Also, don’t forget to peep our Instagram.</p>\n<p>For more detail, though, here are a few of our favorite things:</p>\n<ol>\n<li>We want people who elevate the game - and offer meaningful equity in our fast-growing company to compensate for top performers.</li>\n<li>We offer generous medical, dental, and vision insurance—you shouldn’t have to stress about your health. (And less stress makes you healthier, right?!)</li>\n<li>Yes, your Fundera family is very important, but yours at home matters most. That’s why we offer incredibly generous maternity and paternity leave, have a family-friendly office, and love nothing more than seeing our Fundera kiddos at company events and socials.</li>\n<li>Everybody needs a little R&amp;R—but we want our team to have more than just a little. You’ll get flexible PTO and we mean legitimately flexible PTO.</li>\n<li>We sponsor regular catered lunches with really cool speakers (like the founders of Birchbox, CityRow, and Percolate). We also regularly host company happy hours, and other events such as employee-led trivia and visits to customers. It’s important to bring our team together as much as possible.</li>\n<li>Transparency is what our product is built on—and so is our culture. Whether that means regular all-hands meetings, board decks circulated every month, or a highly accessible leadership team, we’re all stakeholders in this company and never forget that.</li>\n</ol>\n<p>Ultimately, at Fundera, you get to come to work with a group of supportive, talented, ambitious individuals who will teach you something new every day, whilst building a product that will truly and actually change the lives of America’s small businesses and job creators. We think it’s pretty cool, and think you will, too.</p>\n<p>Is This Role Right for Me?</p>\n<p>Our Senior Software Engineer will join a team of engineers that are curious, humble, and can hop in and tackle a wide range of projects. We aim to build systems that are reliable and simple, user experiences that are beautiful and frictionless, and internal tools that help us all do our jobs better. If you’re interested in the position, here are a few things you’ll get to do and the qualifications that will make you successful in this role.</p>\n<p>As our Senior Software Engineer, You’ll Get to...</p>\n<p>Contribute ideas for projects to drive the team forward.</p>\n<ul>\n<li>Develop new features that surprise and delight our users.</li>\n<li>Work up and down the stack, from schema changes to front end javascript in the same day.</li>\n<li>Work with product managers and designers to build a well-rounded product.</li>\n<li>Measure and graph your features so we can know how something is performing.</li>\n<li>Constantly be learning from teammates, as well as sharing any knowledge and skills you have with\nothers.</li>\n<li>Create with empathy - always considering the end user and be an advocate for their experience.</li>\n</ul>\n<p>We’re Looking for People Who Have...</p>\n<ul>\n<li>5+ years of real world experience.</li>\n<li>Some familiarity with Fundera’s current stack or similar technologies: Rails, React, AWS, Postgres,\nDocker, CircleCI, StatsD, InfluxDB, Grafana.</li>\n<li>Proficiency in Unix environments.</li>\n<li>Experience working with web systems.</li>\n<li>Excellent interpersonal skills.</li>\n<li>A passion for helping small businesses.</li>\n</ul>\n<p>What Should I Do If I’m Interested?</p>\n<p>If working at Fundera gets you excited, we want to hear from you, regardless of whether you think this role is a fit. If you think you’ve got the relevant experience, apply below to be our Senior Software Engineer.</p>\n",
    "how_to_apply": "<p>Please apply at this link and reference Github <a href=\"https://jobs.lever.co/fundera/7133b9e4-36bf-4bad-90f2-abe18f1a342f\">https://jobs.lever.co/fundera/7133b9e4-36bf-4bad-90f2-abe18f1a342f</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUorIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--576683b0f1523f1d4662c695312c920cabcbd9bf/logo%20wordmark@4x.png"
  },
  {
    "id": "9847705a-14d3-475a-9c7b-1624a5cd84f8",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/9847705a-14d3-475a-9c7b-1624a5cd84f8",
    "created_at": "Thu Feb 06 18:51:56 UTC 2020",
    "company": "Tynker",
    "company_url": "http://www.tynker.com",
    "location": "Mountain View",
    "title": "Front-End Web Developer",
    "description": "<p>We are looking for a full-stack developer who has a strong command of web development including Angular, CSS3, HTML5, Javascript, cross-browser development techniques and has a passion for building pixel-perfect, clean and elegant code. You will work with a team of developers building tools and frameworks used by millions of K-12 students to learn to code. While frameworks are great, you should have no problems building your own or hacking existing ones.</p>\n<p>Tynker is the #1 Kids Coding platform and helps millions of students learn coding. Our self-paced courses and creativity tools guide them from block coding to JavaScript, Swift and and Python. Tynker’s mission is to provide every child with solid foundations in STEM, programming and critical thinking skills to prepare them to become better architects of their future world. Join a dynamic team of developers to come up with new and stimulating ways to engage young coders to get creative with code!</p>\n<p>Primary Tasks:</p>\n<ul>\n<li>Create awesome web experiences for young coders</li>\n<li>Transform design comps made by creative leads to functional web applications</li>\n<li>Create scalable cloud backend software that handles millions of users</li>\n<li>Iterate and improve experiences periodically based on feedback</li>\n</ul>\n<p>Requirements:</p>\n<ul>\n<li>BS/MS degree in Computer Science</li>\n<li>5+ years of professional experience building and maintaining large sites (50+ pages)</li>\n<li>Full grasp of HTML, CSS, JavaScript, and AJAX-based JSON/XML web services</li>\n<li>Should be proficient using frameworks like Angular, React, Foundation or Bootstrap</li>\n<li>Must be comfortable with using PHP, Mongo, and other back-end technologies</li>\n<li>Ability to debug cross-browser/cross-domain issues</li>\n<li>Solid foundation creating cross-browser and responsive web experiences and understand the nuances of supporting tablet and mobile browsers</li>\n<li>Must be able to quickly adapt and learn to work within an unfamiliar codebase</li>\n<li>Must be familiar with various design and architectural patterns</li>\n<li>Demonstrated ability to be self-driven and work with minimal supervision</li>\n<li>Experience creating APIs and RESTful web services is preferred</li>\n<li>Strong object oriented fundamentals with prior experience in Java or C++ is a plus</li>\n</ul>\n",
    "how_to_apply": "<p>Email your resume and cover letter to <a href=\"mailto:jobs@tynker.com\">jobs@tynker.com</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ3ArIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d3a83fbb4d89ef700a492ec3a4965e36fc099ea1/tynker-200x200.png"
  },
  {
    "id": "34c96fab-15a0-440a-870d-78963c5c3715",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/34c96fab-15a0-440a-870d-78963c5c3715",
    "created_at": "Tue Feb 04 16:57:43 UTC 2020",
    "company": "Dancor Solutions",
    "company_url": "https://dancorsolutions.com/",
    "location": "Columbus, OH",
    "title": "Backend PHP Developer (experience required)",
    "description": "<p><strong>Job Description:</strong></p>\n<p>Dancor Solutions is looking for a talented PHP developer / web developer / software developer with solid experience; someone who can write clean, tight code and thrives in a small team environment.</p>\n<p>This is a full-time position in which the ideal client should be able to come up with innovative ideas leading to solutions for our clients in a timely manner. They should be able to learn new skills as needed, and be able to balance several projects concurrently. The ideal candidate will possess the technical skills to handle the workload as well as the social skills to effectively communicate in an extremely fluid, team-based environment.</p>\n<p>At Dancor Solutions, we pride ourselves on working quickly and efficiently with quality as one cohesive team, and the candidate should be able to keep a calm head and a positive attitude in fast-paced situations.</p>\n<p><strong>Company Description:</strong></p>\n<p>Dancor Solutions’ technology division focuses on creating and developing unique web and SaaS applications for desktop, tablet, and mobile devices for our large existing client base of Fortune 100 companies. We are a team-oriented small company where each team member collaborates on innovative and creative projects, and has the opportunity to make a great deal of impact on final projects. Our company culture is an energetic, fun, flexible, creative, and open environment.</p>\n<p><strong>Top Reasons to Work With Us:</strong></p>\n<ul>\n<li>We’re passionate about building customized solutions that help our clients and their associates thrive</li>\n<li>Start-up environment in long-standing, fast-growing company</li>\n<li>Collaborative team environment that’s open to and encourages new ideas</li>\n<li>A casual, open work environment</li>\n<li>Work in a fun, energetic company culture</li>\n</ul>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Proficient with PHP. Multiple-language candidates preferred</li>\n<li>Proficient with Object Oriented PHP and/or MVC including Laravel</li>\n<li>Proficient with MySQL, Queries and Data Construction</li>\n<li>Proficient with MS Office Suite, including Excel, Word</li>\n<li>Proficient understanding of web markup, including HTML5, CSS3</li>\n<li>Proficient understanding of client-side scripting and JavaScript frameworks, including jQuery</li>\n<li>Basic understanding of advanced JavaScript libraries and frameworks, such as ReactJS, Gulp, Webpack</li>\n<li>Basic understanding of server-side CSS pre-processing platforms, such as LESS and SASS</li>\n<li>Solid understanding of asynchronous request handling, partial page updates, and AJAX</li>\n<li>Proficient understanding of cross-browser compatibility issues and ways to work around them</li>\n<li>Proficient understanding of code versioning tools, such as Git and SVN</li>\n</ul>\n<p><strong>You are:</strong></p>\n<ul>\n<li>A self-motivated individual that is able to work and collaborate in a small team environment with minimal supervision</li>\n<li>Someone who has a commitment to coding standards, documentation, and best practices</li>\n<li>Excited about and have the desire to learn new technologies</li>\n<li>Passionate about using open source tools and frameworks - a follower of PHP standard recommendations</li>\n<li>Able to develop new features based on client requirements</li>\n<li>Able build reusable code and libraries for future use</li>\n<li>Someone who assures that all user input is validated and sanitized</li>\n</ul>\n<p><strong>This is an on-site position and relocation assistance is not provided.</strong></p>\n",
    "how_to_apply": "<p>Email your resume to <a href=\"mailto:careers@dancorsolutions.com\">careers@dancorsolutions.com</a></p>\n<p>This is an on-site position (Columbus, OH) and relocation assistance is not provided.</p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc2w5IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--15bfe0371630f8582f34d2497f67e82c25f1fc17/0.png"
  },
  {
    "id": "abddd671-8641-455d-a36d-03606a87918b",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/abddd671-8641-455d-a36d-03606a87918b",
    "created_at": "Mon Feb 03 18:45:43 UTC 2020",
    "company": "NIKE",
    "company_url": "https://jobs.nike.com/",
    "location": "Beaverton, Oregon",
    "title": "Senior Software Engineer (Front End)",
    "description": "<p>At Nike, we understand that consumer trust is the true currency of our data-driven world. As we expand our digital advantage to unlock a new era of consumer services, experiences and solutions, we will be guided by our core believe that consumers’ trust is earned, not given. We work hard to maintain this trust every day.</p>\n<p>By embedding privacy within every product and experience and by investing in high quality data, platforms, and models to create unbreakable relationships, we ensure that as we innovate, we do so with the consumer at the center. We create the future of sport together.</p>\n<p>If you're ready to innovate and lead in the Digital space, join Nike's Global Technology organization. We bring together technology and process expertise to deliver one-stop solutions that enable Nike, Inc.'s digital products and services. We are responsible for creating, developing and deploying seamless, tailored and inherently social experiences to its Digital consumers. Working with our organization will be rewarding, challenging, and most definitely not be just another job.</p>\n<p>As a Software Engineer on our Launch Engineering team, you will bring a broad experience of successfully ideating and delivering value that enables Nike to increase productivity, realize efficiencies and build profitable customer experiences. You will be responsible for building simple and intuitive User Interfaces for a variety of internal privacy tools within Nike. Interest and experience in the latest methodologies goes a long way here and we're looking for people who are passionate about the world of value-driven solution delivery. You'll get to work alongside truly talented teams and help them enhance their performance by promoting collaboration and innovation.</p>\n<p>What you’ll do:</p>\n<ul>\n<li>Work in a fast-paced agile environment</li>\n<li>Work in true DevOps fashion owning the entire tech stack</li>\n<li>Build Nike’s data privacy vision for today’s data driven world</li>\n<li>Design, implement, and maintain a variety of user interfaces for Nike’s privacy tools</li>\n<li>Participate in code and design reviews</li>\n<li>Collaborate with other amazing engineers to power the most exciting digital experiences for athletes on the market</li>\n</ul>\n<p>What You Bring to Nike:</p>\n<ul>\n<li>5+ years of experience as a highly productive developer with front-end technologies</li>\n<li>Excellent knowledge of Javascript (ES6), CSS, HTML</li>\n<li>Full-stack front-end developer with experience in React/Redux, Express, Node.js</li>\n<li>Knowledgeable with version control systems (Git) and issue tracking tools (JIRA)</li>\n<li>Experience with TDD, which may include Mocha, Chai, Sinon, etc.</li>\n<li>Experience with CD/CI and related tools (Jenkins etc.)</li>\n<li>Hands on experience in AWS</li>\n<li>Strong communication skills and great product sense</li>\n<li>Passion for sports!</li>\n</ul>\n",
    "how_to_apply": "<p><a href=\"https://jobs.nike.com/job/00470890?utm_source=Github&amp;utm_medium=Jobslots&amp;utm_campaign=SeniorSoftwareEngineerFrontEnd\">https://jobs.nike.com/job/00470890?utm_source=Github&amp;utm_medium=Jobslots&amp;utm_campaign=SeniorSoftwareEngineerFrontEnd</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBck45IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1520744b9f7c63e505eb8cd723324734fedad0de/NIKE.png"
  }
]
